XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/usb_reg.h
/**
  ******************************************************************************
  * @file    usb_reg.h
  * @version V1.0
  * @date    2021-04-20
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __USB_REG_H__
#define __USB_REG_H__

#include "bl606p.h"

/* 0x000 : HCCAP */
#define USB_HCCAP_OFFSET    (0x000)
#define USB_CAPLENGTH       USB_CAPLENGTH
#define USB_CAPLENGTH_POS   (0U)
#define USB_CAPLENGTH_LEN   (8U)
#define USB_CAPLENGTH_MSK   (((1U << USB_CAPLENGTH_LEN) - 1) << USB_CAPLENGTH_POS)
#define USB_CAPLENGTH_UMSK  (~(((1U << USB_CAPLENGTH_LEN) - 1) << USB_CAPLENGTH_POS))
#define USB_HCIVERSION      USB_HCIVERSION
#define USB_HCIVERSION_POS  (16U)
#define USB_HCIVERSION_LEN  (16U)
#define USB_HCIVERSION_MSK  (((1U << USB_HCIVERSION_LEN) - 1) << USB_HCIVERSION_POS)
#define USB_HCIVERSION_UMSK (~(((1U << USB_HCIVERSION_LEN) - 1) << USB_HCIVERSION_POS))

/* 0x004 : HCSPARAMS */
#define USB_HCSPARAMS_OFFSET (0x004)
#define USB_N_PORTS          USB_N_PORTS
#define USB_N_PORTS_POS      (0U)
#define USB_N_PORTS_LEN      (4U)
#define USB_N_PORTS_MSK      (((1U << USB_N_PORTS_LEN) - 1) << USB_N_PORTS_POS)
#define USB_N_PORTS_UMSK     (~(((1U << USB_N_PORTS_LEN) - 1) << USB_N_PORTS_POS))

/* 0x008 : HCCPARAMS */
#define USB_HCCPARAMS_OFFSET       (0x008)
#define USB_PROG_FR_LIST_FLAG      USB_PROG_FR_LIST_FLAG
#define USB_PROG_FR_LIST_FLAG_POS  (1U)
#define USB_PROG_FR_LIST_FLAG_LEN  (1U)
#define USB_PROG_FR_LIST_FLAG_MSK  (((1U << USB_PROG_FR_LIST_FLAG_LEN) - 1) << USB_PROG_FR_LIST_FLAG_POS)
#define USB_PROG_FR_LIST_FLAG_UMSK (~(((1U << USB_PROG_FR_LIST_FLAG_LEN) - 1) << USB_PROG_FR_LIST_FLAG_POS))
#define USB_ASYN_SCH_PARK_CAP      USB_ASYN_SCH_PARK_CAP
#define USB_ASYN_SCH_PARK_CAP_POS  (2U)
#define USB_ASYN_SCH_PARK_CAP_LEN  (1U)
#define USB_ASYN_SCH_PARK_CAP_MSK  (((1U << USB_ASYN_SCH_PARK_CAP_LEN) - 1) << USB_ASYN_SCH_PARK_CAP_POS)
#define USB_ASYN_SCH_PARK_CAP_UMSK (~(((1U << USB_ASYN_SCH_PARK_CAP_LEN) - 1) << USB_ASYN_SCH_PARK_CAP_POS))

/* 0x010 : USBCMD */
#define USBCMD_OFFSET        (0x010)
#define USB_RS               USB_RS
#define USB_RS_POS           (0U)
#define USB_RS_LEN           (1U)
#define USB_RS_MSK           (((1U << USB_RS_LEN) - 1) << USB_RS_POS)
#define USB_RS_UMSK          (~(((1U << USB_RS_LEN) - 1) << USB_RS_POS))
#define USB_HC_RESET         USB_HC_RESET
#define USB_HC_RESET_POS     (1U)
#define USB_HC_RESET_LEN     (1U)
#define USB_HC_RESET_MSK     (((1U << USB_HC_RESET_LEN) - 1) << USB_HC_RESET_POS)
#define USB_HC_RESET_UMSK    (~(((1U << USB_HC_RESET_LEN) - 1) << USB_HC_RESET_POS))
#define USB_FRL_SIZE         USB_FRL_SIZE
#define USB_FRL_SIZE_POS     (2U)
#define USB_FRL_SIZE_LEN     (2U)
#define USB_FRL_SIZE_MSK     (((1U << USB_FRL_SIZE_LEN) - 1) << USB_FRL_SIZE_POS)
#define USB_FRL_SIZE_UMSK    (~(((1U << USB_FRL_SIZE_LEN) - 1) << USB_FRL_SIZE_POS))
#define USB_PSCH_EN          USB_PSCH_EN
#define USB_PSCH_EN_POS      (4U)
#define USB_PSCH_EN_LEN      (1U)
#define USB_PSCH_EN_MSK      (((1U << USB_PSCH_EN_LEN) - 1) << USB_PSCH_EN_POS)
#define USB_PSCH_EN_UMSK     (~(((1U << USB_PSCH_EN_LEN) - 1) << USB_PSCH_EN_POS))
#define USB_ASCH_EN          USB_ASCH_EN
#define USB_ASCH_EN_POS      (5U)
#define USB_ASCH_EN_LEN      (1U)
#define USB_ASCH_EN_MSK      (((1U << USB_ASCH_EN_LEN) - 1) << USB_ASCH_EN_POS)
#define USB_ASCH_EN_UMSK     (~(((1U << USB_ASCH_EN_LEN) - 1) << USB_ASCH_EN_POS))
#define USB_INT_OAAD         USB_INT_OAAD
#define USB_INT_OAAD_POS     (6U)
#define USB_INT_OAAD_LEN     (1U)
#define USB_INT_OAAD_MSK     (((1U << USB_INT_OAAD_LEN) - 1) << USB_INT_OAAD_POS)
#define USB_INT_OAAD_UMSK    (~(((1U << USB_INT_OAAD_LEN) - 1) << USB_INT_OAAD_POS))
#define USB_ASYN_PK_CNT      USB_ASYN_PK_CNT
#define USB_ASYN_PK_CNT_POS  (8U)
#define USB_ASYN_PK_CNT_LEN  (2U)
#define USB_ASYN_PK_CNT_MSK  (((1U << USB_ASYN_PK_CNT_LEN) - 1) << USB_ASYN_PK_CNT_POS)
#define USB_ASYN_PK_CNT_UMSK (~(((1U << USB_ASYN_PK_CNT_LEN) - 1) << USB_ASYN_PK_CNT_POS))
#define USB_ASYN_PK_EN       USB_ASYN_PK_EN
#define USB_ASYN_PK_EN_POS   (11U)
#define USB_ASYN_PK_EN_LEN   (1U)
#define USB_ASYN_PK_EN_MSK   (((1U << USB_ASYN_PK_EN_LEN) - 1) << USB_ASYN_PK_EN_POS)
#define USB_ASYN_PK_EN_UMSK  (~(((1U << USB_ASYN_PK_EN_LEN) - 1) << USB_ASYN_PK_EN_POS))
#define USB_INT_THRC         USB_INT_THRC
#define USB_INT_THRC_POS     (16U)
#define USB_INT_THRC_LEN     (8U)
#define USB_INT_THRC_MSK     (((1U << USB_INT_THRC_LEN) - 1) << USB_INT_THRC_POS)
#define USB_INT_THRC_UMSK    (~(((1U << USB_INT_THRC_LEN) - 1) << USB_INT_THRC_POS))

/* 0x014 : USBSTS */
#define USBSTS_OFFSET        (0x014)
#define USB_INT              USB_INT
#define USB_INT_POS          (0U)
#define USB_INT_LEN          (1U)
#define USB_INT_MSK          (((1U << USB_INT_LEN) - 1) << USB_INT_POS)
#define USB_INT_UMSK         (~(((1U << USB_INT_LEN) - 1) << USB_INT_POS))
#define USBERR_INT           USBERR_INT
#define USBERR_INT_POS       (1U)
#define USBERR_INT_LEN       (1U)
#define USBERR_INT_MSK       (((1U << USBERR_INT_LEN) - 1) << USBERR_INT_POS)
#define USBERR_INT_UMSK      (~(((1U << USBERR_INT_LEN) - 1) << USBERR_INT_POS))
#define USB_PO_CHG_DET       USB_PO_CHG_DET
#define USB_PO_CHG_DET_POS   (2U)
#define USB_PO_CHG_DET_LEN   (1U)
#define USB_PO_CHG_DET_MSK   (((1U << USB_PO_CHG_DET_LEN) - 1) << USB_PO_CHG_DET_POS)
#define USB_PO_CHG_DET_UMSK  (~(((1U << USB_PO_CHG_DET_LEN) - 1) << USB_PO_CHG_DET_POS))
#define USB_FRL_ROL          USB_FRL_ROL
#define USB_FRL_ROL_POS      (3U)
#define USB_FRL_ROL_LEN      (1U)
#define USB_FRL_ROL_MSK      (((1U << USB_FRL_ROL_LEN) - 1) << USB_FRL_ROL_POS)
#define USB_FRL_ROL_UMSK     (~(((1U << USB_FRL_ROL_LEN) - 1) << USB_FRL_ROL_POS))
#define USB_H_SYSERR         USB_H_SYSERR
#define USB_H_SYSERR_POS     (4U)
#define USB_H_SYSERR_LEN     (1U)
#define USB_H_SYSERR_MSK     (((1U << USB_H_SYSERR_LEN) - 1) << USB_H_SYSERR_POS)
#define USB_H_SYSERR_UMSK    (~(((1U << USB_H_SYSERR_LEN) - 1) << USB_H_SYSERR_POS))
#define USB_INT_OAA          USB_INT_OAA
#define USB_INT_OAA_POS      (5U)
#define USB_INT_OAA_LEN      (1U)
#define USB_INT_OAA_MSK      (((1U << USB_INT_OAA_LEN) - 1) << USB_INT_OAA_POS)
#define USB_INT_OAA_UMSK     (~(((1U << USB_INT_OAA_LEN) - 1) << USB_INT_OAA_POS))
#define USB_HCHALTED         USB_HCHALTED
#define USB_HCHALTED_POS     (12U)
#define USB_HCHALTED_LEN     (1U)
#define USB_HCHALTED_MSK     (((1U << USB_HCHALTED_LEN) - 1) << USB_HCHALTED_POS)
#define USB_HCHALTED_UMSK    (~(((1U << USB_HCHALTED_LEN) - 1) << USB_HCHALTED_POS))
#define USB_RECLAMATION      USB_RECLAMATION
#define USB_RECLAMATION_POS  (13U)
#define USB_RECLAMATION_LEN  (1U)
#define USB_RECLAMATION_MSK  (((1U << USB_RECLAMATION_LEN) - 1) << USB_RECLAMATION_POS)
#define USB_RECLAMATION_UMSK (~(((1U << USB_RECLAMATION_LEN) - 1) << USB_RECLAMATION_POS))
#define USB_PSCH_STS         USB_PSCH_STS
#define USB_PSCH_STS_POS     (14U)
#define USB_PSCH_STS_LEN     (1U)
#define USB_PSCH_STS_MSK     (((1U << USB_PSCH_STS_LEN) - 1) << USB_PSCH_STS_POS)
#define USB_PSCH_STS_UMSK    (~(((1U << USB_PSCH_STS_LEN) - 1) << USB_PSCH_STS_POS))
#define USB_ASCH_STS         USB_ASCH_STS
#define USB_ASCH_STS_POS     (15U)
#define USB_ASCH_STS_LEN     (1U)
#define USB_ASCH_STS_MSK     (((1U << USB_ASCH_STS_LEN) - 1) << USB_ASCH_STS_POS)
#define USB_ASCH_STS_UMSK    (~(((1U << USB_ASCH_STS_LEN) - 1) << USB_ASCH_STS_POS))

