XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/usb_reg.h
/* 0x108 : DEV_TST */
#define USB_DEV_TST_OFFSET       (0x108)
#define USB_TST_CLRFF_HOV        USB_TST_CLRFF_HOV
#define USB_TST_CLRFF_HOV_POS    (0U)
#define USB_TST_CLRFF_HOV_LEN    (1U)
#define USB_TST_CLRFF_HOV_MSK    (((1U << USB_TST_CLRFF_HOV_LEN) - 1) << USB_TST_CLRFF_HOV_POS)
#define USB_TST_CLRFF_HOV_UMSK   (~(((1U << USB_TST_CLRFF_HOV_LEN) - 1) << USB_TST_CLRFF_HOV_POS))
#define USB_TST_LPCX             USB_TST_LPCX
#define USB_TST_LPCX_POS         (1U)
#define USB_TST_LPCX_LEN         (1U)
#define USB_TST_LPCX_MSK         (((1U << USB_TST_LPCX_LEN) - 1) << USB_TST_LPCX_POS)
#define USB_TST_LPCX_UMSK        (~(((1U << USB_TST_LPCX_LEN) - 1) << USB_TST_LPCX_POS))
#define USB_TST_CLREA            USB_TST_CLREA
#define USB_TST_CLREA_POS        (2U)
#define USB_TST_CLREA_LEN        (1U)
#define USB_TST_CLREA_MSK        (((1U << USB_TST_CLREA_LEN) - 1) << USB_TST_CLREA_POS)
#define USB_TST_CLREA_UMSK       (~(((1U << USB_TST_CLREA_LEN) - 1) << USB_TST_CLREA_POS))
#define USB_TST_DISTO_HOV        USB_TST_DISTO_HOV
#define USB_TST_DISTO_HOV_POS    (4U)
#define USB_TST_DISTO_HOV_LEN    (1U)
#define USB_TST_DISTO_HOV_MSK    (((1U << USB_TST_DISTO_HOV_LEN) - 1) << USB_TST_DISTO_HOV_POS)
#define USB_TST_DISTO_HOV_UMSK   (~(((1U << USB_TST_DISTO_HOV_LEN) - 1) << USB_TST_DISTO_HOV_POS))
#define USB_TST_MOD_HOV          USB_TST_MOD_HOV
#define USB_TST_MOD_HOV_POS      (5U)
#define USB_TST_MOD_HOV_LEN      (1U)
#define USB_TST_MOD_HOV_MSK      (((1U << USB_TST_MOD_HOV_LEN) - 1) << USB_TST_MOD_HOV_POS)
#define USB_TST_MOD_HOV_UMSK     (~(((1U << USB_TST_MOD_HOV_LEN) - 1) << USB_TST_MOD_HOV_POS))
#define USB_DISGENSOF            USB_DISGENSOF
#define USB_DISGENSOF_POS        (6U)
#define USB_DISGENSOF_LEN        (1U)
#define USB_DISGENSOF_MSK        (((1U << USB_DISGENSOF_LEN) - 1) << USB_DISGENSOF_POS)
#define USB_DISGENSOF_UMSK       (~(((1U << USB_DISGENSOF_LEN) - 1) << USB_DISGENSOF_POS))
#define USB_TST_MOD_TYP_HOV      USB_TST_MOD_TYP_HOV
#define USB_TST_MOD_TYP_HOV_POS  (7U)
#define USB_TST_MOD_TYP_HOV_LEN  (1U)
#define USB_TST_MOD_TYP_HOV_MSK  (((1U << USB_TST_MOD_TYP_HOV_LEN) - 1) << USB_TST_MOD_TYP_HOV_POS)
#define USB_TST_MOD_TYP_HOV_UMSK (~(((1U << USB_TST_MOD_TYP_HOV_LEN) - 1) << USB_TST_MOD_TYP_HOV_POS))

/* 0x10C : DEV_SFN */
#define USB_DEV_SFN_OFFSET (0x10C)
#define USB_SOFN           USB_SOFN
#define USB_SOFN_POS       (0U)
#define USB_SOFN_LEN       (11U)
#define USB_SOFN_MSK       (((1U << USB_SOFN_LEN) - 1) << USB_SOFN_POS)
#define USB_SOFN_UMSK      (~(((1U << USB_SOFN_LEN) - 1) << USB_SOFN_POS))
#define USB_USOFN          USB_USOFN
#define USB_USOFN_POS      (11U)
#define USB_USOFN_LEN      (3U)
#define USB_USOFN_MSK      (((1U << USB_USOFN_LEN) - 1) << USB_USOFN_POS)
#define USB_USOFN_UMSK     (~(((1U << USB_USOFN_LEN) - 1) << USB_USOFN_POS))

/* 0x110 : DEV_SMT */
#define USB_DEV_SMT_OFFSET (0x110)
#define USB_SOFMT          USB_SOFMT
#define USB_SOFMT_POS      (0U)
#define USB_SOFMT_LEN      (16U)
#define USB_SOFMT_MSK      (((1U << USB_SOFMT_LEN) - 1) << USB_SOFMT_POS)
#define USB_SOFMT_UMSK     (~(((1U << USB_SOFMT_LEN) - 1) << USB_SOFMT_POS))

/* 0x114 : PHY_TST */
#define USB_PHY_TST_OFFSET  (0x114)
#define USB_UNPLUG          USB_UNPLUG
#define USB_UNPLUG_POS      (0U)
#define USB_UNPLUG_LEN      (1U)
#define USB_UNPLUG_MSK      (((1U << USB_UNPLUG_LEN) - 1) << USB_UNPLUG_POS)
#define USB_UNPLUG_UMSK     (~(((1U << USB_UNPLUG_LEN) - 1) << USB_UNPLUG_POS))
#define USB_TST_JSTA        USB_TST_JSTA
#define USB_TST_JSTA_POS    (1U)
#define USB_TST_JSTA_LEN    (1U)
#define USB_TST_JSTA_MSK    (((1U << USB_TST_JSTA_LEN) - 1) << USB_TST_JSTA_POS)
#define USB_TST_JSTA_UMSK   (~(((1U << USB_TST_JSTA_LEN) - 1) << USB_TST_JSTA_POS))
#define USB_TST_KSTA        USB_TST_KSTA
#define USB_TST_KSTA_POS    (2U)
#define USB_TST_KSTA_LEN    (1U)
#define USB_TST_KSTA_MSK    (((1U << USB_TST_KSTA_LEN) - 1) << USB_TST_KSTA_POS)
#define USB_TST_KSTA_UMSK   (~(((1U << USB_TST_KSTA_LEN) - 1) << USB_TST_KSTA_POS))
#define USB_TST_SE0NAK      USB_TST_SE0NAK
#define USB_TST_SE0NAK_POS  (3U)
#define USB_TST_SE0NAK_LEN  (1U)
#define USB_TST_SE0NAK_MSK  (((1U << USB_TST_SE0NAK_LEN) - 1) << USB_TST_SE0NAK_POS)
#define USB_TST_SE0NAK_UMSK (~(((1U << USB_TST_SE0NAK_LEN) - 1) << USB_TST_SE0NAK_POS))
#define USB_TST_PKT         USB_TST_PKT
#define USB_TST_PKT_POS     (4U)
#define USB_TST_PKT_LEN     (1U)
#define USB_TST_PKT_MSK     (((1U << USB_TST_PKT_LEN) - 1) << USB_TST_PKT_POS)
#define USB_TST_PKT_UMSK    (~(((1U << USB_TST_PKT_LEN) - 1) << USB_TST_PKT_POS))

/* 0x118 : DEV_VCTL */
#define USB_DEV_VCTL_OFFSET    (0x118)
#define USB_VCTL_HOV           USB_VCTL_HOV
#define USB_VCTL_HOV_POS       (0U)
#define USB_VCTL_HOV_LEN       (5U)
#define USB_VCTL_HOV_MSK       (((1U << USB_VCTL_HOV_LEN) - 1) << USB_VCTL_HOV_POS)
#define USB_VCTL_HOV_UMSK      (~(((1U << USB_VCTL_HOV_LEN) - 1) << USB_VCTL_HOV_POS))
#define USB_VCTLOAD_N_HOV      USB_VCTLOAD_N_HOV
#define USB_VCTLOAD_N_HOV_POS  (5U)
#define USB_VCTLOAD_N_HOV_LEN  (1U)
#define USB_VCTLOAD_N_HOV_MSK  (((1U << USB_VCTLOAD_N_HOV_LEN) - 1) << USB_VCTLOAD_N_HOV_POS)
#define USB_VCTLOAD_N_HOV_UMSK (~(((1U << USB_VCTLOAD_N_HOV_LEN) - 1) << USB_VCTLOAD_N_HOV_POS))

/* 0x11C : DEV_CXCFG */
#define USB_DEV_CXCFG_OFFSET (0x11C)
#define USB_VSTA_HOV         USB_VSTA_HOV
#define USB_VSTA_HOV_POS     (0U)
#define USB_VSTA_HOV_LEN     (8U)
#define USB_VSTA_HOV_MSK     (((1U << USB_VSTA_HOV_LEN) - 1) << USB_VSTA_HOV_POS)
#define USB_VSTA_HOV_UMSK    (~(((1U << USB_VSTA_HOV_LEN) - 1) << USB_VSTA_HOV_POS))

/* 0x120 : DEV_CXCFE */
#define USB_DEV_CXCFE_OFFSET (0x120)
#define USB_CX_DONE          USB_CX_DONE
#define USB_CX_DONE_POS      (0U)
#define USB_CX_DONE_LEN      (1U)
#define USB_CX_DONE_MSK      (((1U << USB_CX_DONE_LEN) - 1) << USB_CX_DONE_POS)
#define USB_CX_DONE_UMSK     (~(((1U << USB_CX_DONE_LEN) - 1) << USB_CX_DONE_POS))
#define USB_TST_PKDONE       USB_TST_PKDONE
#define USB_TST_PKDONE_POS   (1U)
#define USB_TST_PKDONE_LEN   (1U)
#define USB_TST_PKDONE_MSK   (((1U << USB_TST_PKDONE_LEN) - 1) << USB_TST_PKDONE_POS)
#define USB_TST_PKDONE_UMSK  (~(((1U << USB_TST_PKDONE_LEN) - 1) << USB_TST_PKDONE_POS))
#define USB_CX_STL           USB_CX_STL
#define USB_CX_STL_POS       (2U)
#define USB_CX_STL_LEN       (1U)
#define USB_CX_STL_MSK       (((1U << USB_CX_STL_LEN) - 1) << USB_CX_STL_POS)
#define USB_CX_STL_UMSK      (~(((1U << USB_CX_STL_LEN) - 1) << USB_CX_STL_POS))
#define USB_CX_CLR           USB_CX_CLR
#define USB_CX_CLR_POS       (3U)
#define USB_CX_CLR_LEN       (1U)
#define USB_CX_CLR_MSK       (((1U << USB_CX_CLR_LEN) - 1) << USB_CX_CLR_POS)
#define USB_CX_CLR_UMSK      (~(((1U << USB_CX_CLR_LEN) - 1) << USB_CX_CLR_POS))
#define USB_CX_FUL           USB_CX_FUL
#define USB_CX_FUL_POS       (4U)
#define USB_CX_FUL_LEN       (1U)
#define USB_CX_FUL_MSK       (((1U << USB_CX_FUL_LEN) - 1) << USB_CX_FUL_POS)
#define USB_CX_FUL_UMSK      (~(((1U << USB_CX_FUL_LEN) - 1) << USB_CX_FUL_POS))
#define USB_CX_EMP           USB_CX_EMP
#define USB_CX_EMP_POS       (5U)
#define USB_CX_EMP_LEN       (1U)
#define USB_CX_EMP_MSK       (((1U << USB_CX_EMP_LEN) - 1) << USB_CX_EMP_POS)
#define USB_CX_EMP_UMSK      (~(((1U << USB_CX_EMP_LEN) - 1) << USB_CX_EMP_POS))
#define USB_F0_EMP           USB_F0_EMP
#define USB_F0_EMP_POS       (8U)
#define USB_F0_EMP_LEN       (1U)
#define USB_F0_EMP_MSK       (((1U << USB_F0_EMP_LEN) - 1) << USB_F0_EMP_POS)
#define USB_F0_EMP_UMSK      (~(((1U << USB_F0_EMP_LEN) - 1) << USB_F0_EMP_POS))
#define USB_F1_EMP           USB_F1_EMP
#define USB_F1_EMP_POS       (9U)
#define USB_F1_EMP_LEN       (1U)
#define USB_F1_EMP_MSK       (((1U << USB_F1_EMP_LEN) - 1) << USB_F1_EMP_POS)
#define USB_F1_EMP_UMSK      (~(((1U << USB_F1_EMP_LEN) - 1) << USB_F1_EMP_POS))
#define USB_F2_EMP           USB_F2_EMP
#define USB_F2_EMP_POS       (10U)
#define USB_F2_EMP_LEN       (1U)
#define USB_F2_EMP_MSK       (((1U << USB_F2_EMP_LEN) - 1) << USB_F2_EMP_POS)
#define USB_F2_EMP_UMSK      (~(((1U << USB_F2_EMP_LEN) - 1) << USB_F2_EMP_POS))
#define USB_F3_EMP           USB_F3_EMP
#define USB_F3_EMP_POS       (11U)
#define USB_F3_EMP_LEN       (1U)
#define USB_F3_EMP_MSK       (((1U << USB_F3_EMP_LEN) - 1) << USB_F3_EMP_POS)
#define USB_F3_EMP_UMSK      (~(((1U << USB_F3_EMP_LEN) - 1) << USB_F3_EMP_POS))
#define USB_F4_EMP           USB_F4_EMP
#define USB_F4_EMP_POS       (12U)
#define USB_F4_EMP_LEN       (1U)
#define USB_F4_EMP_MSK       (((1U << USB_F4_EMP_LEN) - 1) << USB_F4_EMP_POS)
#define USB_F4_EMP_UMSK      (~(((1U << USB_F4_EMP_LEN) - 1) << USB_F4_EMP_POS))
#define USB_F5_EMP           USB_F5_EMP
#define USB_F5_EMP_POS       (13U)
#define USB_F5_EMP_LEN       (1U)
#define USB_F5_EMP_MSK       (((1U << USB_F5_EMP_LEN) - 1) << USB_F5_EMP_POS)
#define USB_F5_EMP_UMSK      (~(((1U << USB_F5_EMP_LEN) - 1) << USB_F5_EMP_POS))
#define USB_F6_EMP           USB_F6_EMP
#define USB_F6_EMP_POS       (14U)
#define USB_F6_EMP_LEN       (1U)
#define USB_F6_EMP_MSK       (((1U << USB_F6_EMP_LEN) - 1) << USB_F6_EMP_POS)
#define USB_F6_EMP_UMSK      (~(((1U << USB_F6_EMP_LEN) - 1) << USB_F6_EMP_POS))
#define USB_F7_EMP           USB_F7_EMP
#define USB_F7_EMP_POS       (15U)
#define USB_F7_EMP_LEN       (1U)
#define USB_F7_EMP_MSK       (((1U << USB_F7_EMP_LEN) - 1) << USB_F7_EMP_POS)
#define USB_F7_EMP_UMSK      (~(((1U << USB_F7_EMP_LEN) - 1) << USB_F7_EMP_POS))
#define USB_F8_EMP           USB_F8_EMP
#define USB_F8_EMP_POS       (16U)
#define USB_F8_EMP_LEN       (1U)
#define USB_F8_EMP_MSK       (((1U << USB_F8_EMP_LEN) - 1) << USB_F8_EMP_POS)
#define USB_F8_EMP_UMSK      (~(((1U << USB_F8_EMP_LEN) - 1) << USB_F8_EMP_POS))
#define USB_F9_EMP           USB_F9_EMP
#define USB_F9_EMP_POS       (17U)
#define USB_F9_EMP_LEN       (1U)
#define USB_F9_EMP_MSK       (((1U << USB_F9_EMP_LEN) - 1) << USB_F9_EMP_POS)
#define USB_F9_EMP_UMSK      (~(((1U << USB_F9_EMP_LEN) - 1) << USB_F9_EMP_POS))
#define USB_F10_EMP          USB_F10_EMP
#define USB_F10_EMP_POS      (18U)
#define USB_F10_EMP_LEN      (1U)
#define USB_F10_EMP_MSK      (((1U << USB_F10_EMP_LEN) - 1) << USB_F10_EMP_POS)
#define USB_F10_EMP_UMSK     (~(((1U << USB_F10_EMP_LEN) - 1) << USB_F10_EMP_POS))
#define USB_F11_EMP          USB_F11_EMP
#define USB_F11_EMP_POS      (19U)
#define USB_F11_EMP_LEN      (1U)
#define USB_F11_EMP_MSK      (((1U << USB_F11_EMP_LEN) - 1) << USB_F11_EMP_POS)
#define USB_F11_EMP_UMSK     (~(((1U << USB_F11_EMP_LEN) - 1) << USB_F11_EMP_POS))
#define USB_F12_EMP          USB_F12_EMP
#define USB_F12_EMP_POS      (20U)
#define USB_F12_EMP_LEN      (1U)
#define USB_F12_EMP_MSK      (((1U << USB_F12_EMP_LEN) - 1) << USB_F12_EMP_POS)
#define USB_F12_EMP_UMSK     (~(((1U << USB_F12_EMP_LEN) - 1) << USB_F12_EMP_POS))
#define USB_F13_EMP          USB_F13_EMP
#define USB_F13_EMP_POS      (21U)
#define USB_F13_EMP_LEN      (1U)
#define USB_F13_EMP_MSK      (((1U << USB_F13_EMP_LEN) - 1) << USB_F13_EMP_POS)
#define USB_F13_EMP_UMSK     (~(((1U << USB_F13_EMP_LEN) - 1) << USB_F13_EMP_POS))
#define USB_F14_EMP          USB_F14_EMP
#define USB_F14_EMP_POS      (22U)
#define USB_F14_EMP_LEN      (1U)
#define USB_F14_EMP_MSK      (((1U << USB_F14_EMP_LEN) - 1) << USB_F14_EMP_POS)
#define USB_F14_EMP_UMSK     (~(((1U << USB_F14_EMP_LEN) - 1) << USB_F14_EMP_POS))
#define USB_F15_EMP          USB_F15_EMP
#define USB_F15_EMP_POS      (23U)
#define USB_F15_EMP_LEN      (1U)
#define USB_F15_EMP_MSK      (((1U << USB_F15_EMP_LEN) - 1) << USB_F15_EMP_POS)
#define USB_F15_EMP_UMSK     (~(((1U << USB_F15_EMP_LEN) - 1) << USB_F15_EMP_POS))
#define USB_CX_FNT           USB_CX_FNT
#define USB_CX_FNT_POS       (24U)
#define USB_CX_FNT_LEN       (7U)
#define USB_CX_FNT_MSK       (((1U << USB_CX_FNT_LEN) - 1) << USB_CX_FNT_POS)
#define USB_CX_FNT_UMSK      (~(((1U << USB_CX_FNT_LEN) - 1) << USB_CX_FNT_POS))

/* 0x124 : DEV_ICR */
#define USB_DEV_ICR_OFFSET (0x124)
#define USB_IDLE_CNT       USB_IDLE_CNT
#define USB_IDLE_CNT_POS   (0U)
#define USB_IDLE_CNT_LEN   (3U)
#define USB_IDLE_CNT_MSK   (((1U << USB_IDLE_CNT_LEN) - 1) << USB_IDLE_CNT_POS)
#define USB_IDLE_CNT_UMSK  (~(((1U << USB_IDLE_CNT_LEN) - 1) << USB_IDLE_CNT_POS))

/* 0x130 : DEV_MIGR */
#define USB_DEV_MIGR_OFFSET (0x130)
#define USB_MINT_G0         USB_MINT_G0
#define USB_MINT_G0_POS     (0U)
#define USB_MINT_G0_LEN     (1U)
#define USB_MINT_G0_MSK     (((1U << USB_MINT_G0_LEN) - 1) << USB_MINT_G0_POS)
#define USB_MINT_G0_UMSK    (~(((1U << USB_MINT_G0_LEN) - 1) << USB_MINT_G0_POS))
#define USB_MINT_G1         USB_MINT_G1
#define USB_MINT_G1_POS     (1U)
#define USB_MINT_G1_LEN     (1U)
#define USB_MINT_G1_MSK     (((1U << USB_MINT_G1_LEN) - 1) << USB_MINT_G1_POS)
#define USB_MINT_G1_UMSK    (~(((1U << USB_MINT_G1_LEN) - 1) << USB_MINT_G1_POS))
#define USB_MINT_G2         USB_MINT_G2
#define USB_MINT_G2_POS     (2U)
#define USB_MINT_G2_LEN     (1U)
#define USB_MINT_G2_MSK     (((1U << USB_MINT_G2_LEN) - 1) << USB_MINT_G2_POS)
#define USB_MINT_G2_UMSK    (~(((1U << USB_MINT_G2_LEN) - 1) << USB_MINT_G2_POS))
#define USB_MINT_G3         USB_MINT_G3
#define USB_MINT_G3_POS     (3U)
#define USB_MINT_G3_LEN     (1U)
#define USB_MINT_G3_MSK     (((1U << USB_MINT_G3_LEN) - 1) << USB_MINT_G3_POS)
#define USB_MINT_G3_UMSK    (~(((1U << USB_MINT_G3_LEN) - 1) << USB_MINT_G3_POS))
#define USB_MINT_G4         USB_MINT_G4
#define USB_MINT_G4_POS     (4U)
#define USB_MINT_G4_LEN     (1U)
#define USB_MINT_G4_MSK     (((1U << USB_MINT_G4_LEN) - 1) << USB_MINT_G4_POS)
#define USB_MINT_G4_UMSK    (~(((1U << USB_MINT_G4_LEN) - 1) << USB_MINT_G4_POS))

