XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/usb_reg.h
/* 0x134 : DEV_MISG0 */
#define USB_DEV_MISG0_OFFSET      (0x134)
#define USB_MCX_SETUP_INT         USB_MCX_SETUP_INT
#define USB_MCX_SETUP_INT_POS     (0U)
#define USB_MCX_SETUP_INT_LEN     (1U)
#define USB_MCX_SETUP_INT_MSK     (((1U << USB_MCX_SETUP_INT_LEN) - 1) << USB_MCX_SETUP_INT_POS)
#define USB_MCX_SETUP_INT_UMSK    (~(((1U << USB_MCX_SETUP_INT_LEN) - 1) << USB_MCX_SETUP_INT_POS))
#define USB_MCX_IN_INT            USB_MCX_IN_INT
#define USB_MCX_IN_INT_POS        (1U)
#define USB_MCX_IN_INT_LEN        (1U)
#define USB_MCX_IN_INT_MSK        (((1U << USB_MCX_IN_INT_LEN) - 1) << USB_MCX_IN_INT_POS)
#define USB_MCX_IN_INT_UMSK       (~(((1U << USB_MCX_IN_INT_LEN) - 1) << USB_MCX_IN_INT_POS))
#define USB_MCX_OUT_INT           USB_MCX_OUT_INT
#define USB_MCX_OUT_INT_POS       (2U)
#define USB_MCX_OUT_INT_LEN       (1U)
#define USB_MCX_OUT_INT_MSK       (((1U << USB_MCX_OUT_INT_LEN) - 1) << USB_MCX_OUT_INT_POS)
#define USB_MCX_OUT_INT_UMSK      (~(((1U << USB_MCX_OUT_INT_LEN) - 1) << USB_MCX_OUT_INT_POS))
#define USB_MCX_COMFAIL_INT       USB_MCX_COMFAIL_INT
#define USB_MCX_COMFAIL_INT_POS   (4U)
#define USB_MCX_COMFAIL_INT_LEN   (1U)
#define USB_MCX_COMFAIL_INT_MSK   (((1U << USB_MCX_COMFAIL_INT_LEN) - 1) << USB_MCX_COMFAIL_INT_POS)
#define USB_MCX_COMFAIL_INT_UMSK  (~(((1U << USB_MCX_COMFAIL_INT_LEN) - 1) << USB_MCX_COMFAIL_INT_POS))
#define USB_MCX_COMABORT_INT      USB_MCX_COMABORT_INT
#define USB_MCX_COMABORT_INT_POS  (5U)
#define USB_MCX_COMABORT_INT_LEN  (1U)
#define USB_MCX_COMABORT_INT_MSK  (((1U << USB_MCX_COMABORT_INT_LEN) - 1) << USB_MCX_COMABORT_INT_POS)
#define USB_MCX_COMABORT_INT_UMSK (~(((1U << USB_MCX_COMABORT_INT_LEN) - 1) << USB_MCX_COMABORT_INT_POS))

/* 0x138 : DEV_MISG1 */
#define USB_DEV_MISG1_OFFSET (0x138)
#define USB_MF0_OUT_INT      USB_MF0_OUT_INT
#define USB_MF0_OUT_INT_POS  (0U)
#define USB_MF0_OUT_INT_LEN  (1U)
#define USB_MF0_OUT_INT_MSK  (((1U << USB_MF0_OUT_INT_LEN) - 1) << USB_MF0_OUT_INT_POS)
#define USB_MF0_OUT_INT_UMSK (~(((1U << USB_MF0_OUT_INT_LEN) - 1) << USB_MF0_OUT_INT_POS))
#define USB_MF0_SPK_INT      USB_MF0_SPK_INT
#define USB_MF0_SPK_INT_POS  (1U)
#define USB_MF0_SPK_INT_LEN  (1U)
#define USB_MF0_SPK_INT_MSK  (((1U << USB_MF0_SPK_INT_LEN) - 1) << USB_MF0_SPK_INT_POS)
#define USB_MF0_SPK_INT_UMSK (~(((1U << USB_MF0_SPK_INT_LEN) - 1) << USB_MF0_SPK_INT_POS))
#define USB_MF1_OUT_INT      USB_MF1_OUT_INT
#define USB_MF1_OUT_INT_POS  (2U)
#define USB_MF1_OUT_INT_LEN  (1U)
#define USB_MF1_OUT_INT_MSK  (((1U << USB_MF1_OUT_INT_LEN) - 1) << USB_MF1_OUT_INT_POS)
#define USB_MF1_OUT_INT_UMSK (~(((1U << USB_MF1_OUT_INT_LEN) - 1) << USB_MF1_OUT_INT_POS))
#define USB_MF1_SPK_INT      USB_MF1_SPK_INT
#define USB_MF1_SPK_INT_POS  (3U)
#define USB_MF1_SPK_INT_LEN  (1U)
#define USB_MF1_SPK_INT_MSK  (((1U << USB_MF1_SPK_INT_LEN) - 1) << USB_MF1_SPK_INT_POS)
#define USB_MF1_SPK_INT_UMSK (~(((1U << USB_MF1_SPK_INT_LEN) - 1) << USB_MF1_SPK_INT_POS))
#define USB_MF2_OUT_INT      USB_MF2_OUT_INT
#define USB_MF2_OUT_INT_POS  (4U)
#define USB_MF2_OUT_INT_LEN  (1U)
#define USB_MF2_OUT_INT_MSK  (((1U << USB_MF2_OUT_INT_LEN) - 1) << USB_MF2_OUT_INT_POS)
#define USB_MF2_OUT_INT_UMSK (~(((1U << USB_MF2_OUT_INT_LEN) - 1) << USB_MF2_OUT_INT_POS))
#define USB_MF2_SPK_INT      USB_MF2_SPK_INT
#define USB_MF2_SPK_INT_POS  (5U)
#define USB_MF2_SPK_INT_LEN  (1U)
#define USB_MF2_SPK_INT_MSK  (((1U << USB_MF2_SPK_INT_LEN) - 1) << USB_MF2_SPK_INT_POS)
#define USB_MF2_SPK_INT_UMSK (~(((1U << USB_MF2_SPK_INT_LEN) - 1) << USB_MF2_SPK_INT_POS))
#define USB_MF3_OUT_INT      USB_MF3_OUT_INT
#define USB_MF3_OUT_INT_POS  (6U)
#define USB_MF3_OUT_INT_LEN  (1U)
#define USB_MF3_OUT_INT_MSK  (((1U << USB_MF3_OUT_INT_LEN) - 1) << USB_MF3_OUT_INT_POS)
#define USB_MF3_OUT_INT_UMSK (~(((1U << USB_MF3_OUT_INT_LEN) - 1) << USB_MF3_OUT_INT_POS))
#define USB_MF3_SPK_INT      USB_MF3_SPK_INT
#define USB_MF3_SPK_INT_POS  (7U)
#define USB_MF3_SPK_INT_LEN  (1U)
#define USB_MF3_SPK_INT_MSK  (((1U << USB_MF3_SPK_INT_LEN) - 1) << USB_MF3_SPK_INT_POS)
#define USB_MF3_SPK_INT_UMSK (~(((1U << USB_MF3_SPK_INT_LEN) - 1) << USB_MF3_SPK_INT_POS))
#define USB_MF4_OUT_INT      USB_MF4_OUT_INT
#define USB_MF4_OUT_INT_POS  (8U)
#define USB_MF4_OUT_INT_LEN  (1U)
#define USB_MF4_OUT_INT_MSK  (((1U << USB_MF4_OUT_INT_LEN) - 1) << USB_MF4_OUT_INT_POS)
#define USB_MF4_OUT_INT_UMSK (~(((1U << USB_MF4_OUT_INT_LEN) - 1) << USB_MF4_OUT_INT_POS))
#define USB_MF4_SPK_INT      USB_MF4_SPK_INT
#define USB_MF4_SPK_INT_POS  (9U)
#define USB_MF4_SPK_INT_LEN  (1U)
#define USB_MF4_SPK_INT_MSK  (((1U << USB_MF4_SPK_INT_LEN) - 1) << USB_MF4_SPK_INT_POS)
#define USB_MF4_SPK_INT_UMSK (~(((1U << USB_MF4_SPK_INT_LEN) - 1) << USB_MF4_SPK_INT_POS))
#define USB_MF5_OUT_INT      USB_MF5_OUT_INT
#define USB_MF5_OUT_INT_POS  (10U)
#define USB_MF5_OUT_INT_LEN  (1U)
#define USB_MF5_OUT_INT_MSK  (((1U << USB_MF5_OUT_INT_LEN) - 1) << USB_MF5_OUT_INT_POS)
#define USB_MF5_OUT_INT_UMSK (~(((1U << USB_MF5_OUT_INT_LEN) - 1) << USB_MF5_OUT_INT_POS))
#define USB_MF5_SPK_INT      USB_MF5_SPK_INT
#define USB_MF5_SPK_INT_POS  (11U)
#define USB_MF5_SPK_INT_LEN  (1U)
#define USB_MF5_SPK_INT_MSK  (((1U << USB_MF5_SPK_INT_LEN) - 1) << USB_MF5_SPK_INT_POS)
#define USB_MF5_SPK_INT_UMSK (~(((1U << USB_MF5_SPK_INT_LEN) - 1) << USB_MF5_SPK_INT_POS))
#define USB_MF6_OUT_INT      USB_MF6_OUT_INT
#define USB_MF6_OUT_INT_POS  (12U)
#define USB_MF6_OUT_INT_LEN  (1U)
#define USB_MF6_OUT_INT_MSK  (((1U << USB_MF6_OUT_INT_LEN) - 1) << USB_MF6_OUT_INT_POS)
#define USB_MF6_OUT_INT_UMSK (~(((1U << USB_MF6_OUT_INT_LEN) - 1) << USB_MF6_OUT_INT_POS))
#define USB_MF6_SPK_INT      USB_MF6_SPK_INT
#define USB_MF6_SPK_INT_POS  (13U)
#define USB_MF6_SPK_INT_LEN  (1U)
#define USB_MF6_SPK_INT_MSK  (((1U << USB_MF6_SPK_INT_LEN) - 1) << USB_MF6_SPK_INT_POS)
#define USB_MF6_SPK_INT_UMSK (~(((1U << USB_MF6_SPK_INT_LEN) - 1) << USB_MF6_SPK_INT_POS))
#define USB_MF7_OUT_INT      USB_MF7_OUT_INT
#define USB_MF7_OUT_INT_POS  (14U)
#define USB_MF7_OUT_INT_LEN  (1U)
#define USB_MF7_OUT_INT_MSK  (((1U << USB_MF7_OUT_INT_LEN) - 1) << USB_MF7_OUT_INT_POS)
#define USB_MF7_OUT_INT_UMSK (~(((1U << USB_MF7_OUT_INT_LEN) - 1) << USB_MF7_OUT_INT_POS))
#define USB_MF7_SPK_INT      USB_MF7_SPK_INT
#define USB_MF7_SPK_INT_POS  (15U)
#define USB_MF7_SPK_INT_LEN  (1U)
#define USB_MF7_SPK_INT_MSK  (((1U << USB_MF7_SPK_INT_LEN) - 1) << USB_MF7_SPK_INT_POS)
#define USB_MF7_SPK_INT_UMSK (~(((1U << USB_MF7_SPK_INT_LEN) - 1) << USB_MF7_SPK_INT_POS))
#define USB_MF0_IN_INT       USB_MF0_IN_INT
#define USB_MF0_IN_INT_POS   (16U)
#define USB_MF0_IN_INT_LEN   (1U)
#define USB_MF0_IN_INT_MSK   (((1U << USB_MF0_IN_INT_LEN) - 1) << USB_MF0_IN_INT_POS)
#define USB_MF0_IN_INT_UMSK  (~(((1U << USB_MF0_IN_INT_LEN) - 1) << USB_MF0_IN_INT_POS))
#define USB_MF1_IN_INT       USB_MF1_IN_INT
#define USB_MF1_IN_INT_POS   (17U)
#define USB_MF1_IN_INT_LEN   (1U)
#define USB_MF1_IN_INT_MSK   (((1U << USB_MF1_IN_INT_LEN) - 1) << USB_MF1_IN_INT_POS)
#define USB_MF1_IN_INT_UMSK  (~(((1U << USB_MF1_IN_INT_LEN) - 1) << USB_MF1_IN_INT_POS))
#define USB_MF2_IN_INT       USB_MF2_IN_INT
#define USB_MF2_IN_INT_POS   (18U)
#define USB_MF2_IN_INT_LEN   (1U)
#define USB_MF2_IN_INT_MSK   (((1U << USB_MF2_IN_INT_LEN) - 1) << USB_MF2_IN_INT_POS)
#define USB_MF2_IN_INT_UMSK  (~(((1U << USB_MF2_IN_INT_LEN) - 1) << USB_MF2_IN_INT_POS))
#define USB_MF3_IN_INT       USB_MF3_IN_INT
#define USB_MF3_IN_INT_POS   (19U)
#define USB_MF3_IN_INT_LEN   (1U)
#define USB_MF3_IN_INT_MSK   (((1U << USB_MF3_IN_INT_LEN) - 1) << USB_MF3_IN_INT_POS)
#define USB_MF3_IN_INT_UMSK  (~(((1U << USB_MF3_IN_INT_LEN) - 1) << USB_MF3_IN_INT_POS))
#define USB_MF4_IN_INT       USB_MF4_IN_INT
#define USB_MF4_IN_INT_POS   (20U)
#define USB_MF4_IN_INT_LEN   (1U)
#define USB_MF4_IN_INT_MSK   (((1U << USB_MF4_IN_INT_LEN) - 1) << USB_MF4_IN_INT_POS)
#define USB_MF4_IN_INT_UMSK  (~(((1U << USB_MF4_IN_INT_LEN) - 1) << USB_MF4_IN_INT_POS))
#define USB_MF5_IN_INT       USB_MF5_IN_INT
#define USB_MF5_IN_INT_POS   (21U)
#define USB_MF5_IN_INT_LEN   (1U)
#define USB_MF5_IN_INT_MSK   (((1U << USB_MF5_IN_INT_LEN) - 1) << USB_MF5_IN_INT_POS)
#define USB_MF5_IN_INT_UMSK  (~(((1U << USB_MF5_IN_INT_LEN) - 1) << USB_MF5_IN_INT_POS))
#define USB_MF6_IN_INT       USB_MF6_IN_INT
#define USB_MF6_IN_INT_POS   (22U)
#define USB_MF6_IN_INT_LEN   (1U)
#define USB_MF6_IN_INT_MSK   (((1U << USB_MF6_IN_INT_LEN) - 1) << USB_MF6_IN_INT_POS)
#define USB_MF6_IN_INT_UMSK  (~(((1U << USB_MF6_IN_INT_LEN) - 1) << USB_MF6_IN_INT_POS))
#define USB_MF7_IN_INT       USB_MF7_IN_INT
#define USB_MF7_IN_INT_POS   (23U)
#define USB_MF7_IN_INT_LEN   (1U)
#define USB_MF7_IN_INT_MSK   (((1U << USB_MF7_IN_INT_LEN) - 1) << USB_MF7_IN_INT_POS)
#define USB_MF7_IN_INT_UMSK  (~(((1U << USB_MF7_IN_INT_LEN) - 1) << USB_MF7_IN_INT_POS))
#define USB_MF8_IN_INT       USB_MF8_IN_INT
#define USB_MF8_IN_INT_POS   (24U)
#define USB_MF8_IN_INT_LEN   (1U)
#define USB_MF8_IN_INT_MSK   (((1U << USB_MF8_IN_INT_LEN) - 1) << USB_MF8_IN_INT_POS)
#define USB_MF8_IN_INT_UMSK  (~(((1U << USB_MF8_IN_INT_LEN) - 1) << USB_MF8_IN_INT_POS))
#define USB_MF9_IN_INT       USB_MF9_IN_INT
#define USB_MF9_IN_INT_POS   (25U)
#define USB_MF9_IN_INT_LEN   (1U)
#define USB_MF9_IN_INT_MSK   (((1U << USB_MF9_IN_INT_LEN) - 1) << USB_MF9_IN_INT_POS)
#define USB_MF9_IN_INT_UMSK  (~(((1U << USB_MF9_IN_INT_LEN) - 1) << USB_MF9_IN_INT_POS))
#define USB_MF10_IN_INT      USB_MF10_IN_INT
#define USB_MF10_IN_INT_POS  (26U)
#define USB_MF10_IN_INT_LEN  (1U)
#define USB_MF10_IN_INT_MSK  (((1U << USB_MF10_IN_INT_LEN) - 1) << USB_MF10_IN_INT_POS)
#define USB_MF10_IN_INT_UMSK (~(((1U << USB_MF10_IN_INT_LEN) - 1) << USB_MF10_IN_INT_POS))
#define USB_MF11_IN_INT      USB_MF11_IN_INT
#define USB_MF11_IN_INT_POS  (27U)
#define USB_MF11_IN_INT_LEN  (1U)
#define USB_MF11_IN_INT_MSK  (((1U << USB_MF11_IN_INT_LEN) - 1) << USB_MF11_IN_INT_POS)
#define USB_MF11_IN_INT_UMSK (~(((1U << USB_MF11_IN_INT_LEN) - 1) << USB_MF11_IN_INT_POS))
#define USB_MF12_IN_INT      USB_MF12_IN_INT
#define USB_MF12_IN_INT_POS  (28U)
#define USB_MF12_IN_INT_LEN  (1U)
#define USB_MF12_IN_INT_MSK  (((1U << USB_MF12_IN_INT_LEN) - 1) << USB_MF12_IN_INT_POS)
#define USB_MF12_IN_INT_UMSK (~(((1U << USB_MF12_IN_INT_LEN) - 1) << USB_MF12_IN_INT_POS))
#define USB_MF13_IN_INT      USB_MF13_IN_INT
#define USB_MF13_IN_INT_POS  (29U)
#define USB_MF13_IN_INT_LEN  (1U)
#define USB_MF13_IN_INT_MSK  (((1U << USB_MF13_IN_INT_LEN) - 1) << USB_MF13_IN_INT_POS)
#define USB_MF13_IN_INT_UMSK (~(((1U << USB_MF13_IN_INT_LEN) - 1) << USB_MF13_IN_INT_POS))
#define USB_MF14_IN_INT      USB_MF14_IN_INT
#define USB_MF14_IN_INT_POS  (30U)
#define USB_MF14_IN_INT_LEN  (1U)
#define USB_MF14_IN_INT_MSK  (((1U << USB_MF14_IN_INT_LEN) - 1) << USB_MF14_IN_INT_POS)
#define USB_MF14_IN_INT_UMSK (~(((1U << USB_MF14_IN_INT_LEN) - 1) << USB_MF14_IN_INT_POS))
#define USB_MF15_IN_INT      USB_MF15_IN_INT
#define USB_MF15_IN_INT_POS  (31U)
#define USB_MF15_IN_INT_LEN  (1U)
#define USB_MF15_IN_INT_MSK  (((1U << USB_MF15_IN_INT_LEN) - 1) << USB_MF15_IN_INT_POS)
#define USB_MF15_IN_INT_UMSK (~(((1U << USB_MF15_IN_INT_LEN) - 1) << USB_MF15_IN_INT_POS))

/* 0x13C : DEV_MISG2 */
#define USB_DEV_MISG2_OFFSET        (0x13C)
#define USB_MUSBRST_INT             USB_MUSBRST_INT
#define USB_MUSBRST_INT_POS         (0U)
#define USB_MUSBRST_INT_LEN         (1U)
#define USB_MUSBRST_INT_MSK         (((1U << USB_MUSBRST_INT_LEN) - 1) << USB_MUSBRST_INT_POS)
#define USB_MUSBRST_INT_UMSK        (~(((1U << USB_MUSBRST_INT_LEN) - 1) << USB_MUSBRST_INT_POS))
#define USB_MSUSP_INT               USB_MSUSP_INT
#define USB_MSUSP_INT_POS           (1U)
#define USB_MSUSP_INT_LEN           (1U)
#define USB_MSUSP_INT_MSK           (((1U << USB_MSUSP_INT_LEN) - 1) << USB_MSUSP_INT_POS)
#define USB_MSUSP_INT_UMSK          (~(((1U << USB_MSUSP_INT_LEN) - 1) << USB_MSUSP_INT_POS))
#define USB_MRESM_INT               USB_MRESM_INT
#define USB_MRESM_INT_POS           (2U)
#define USB_MRESM_INT_LEN           (1U)
#define USB_MRESM_INT_MSK           (((1U << USB_MRESM_INT_LEN) - 1) << USB_MRESM_INT_POS)
#define USB_MRESM_INT_UMSK          (~(((1U << USB_MRESM_INT_LEN) - 1) << USB_MRESM_INT_POS))
#define USB_MSEQ_ERR_INT            USB_MSEQ_ERR_INT
#define USB_MSEQ_ERR_INT_POS        (3U)
#define USB_MSEQ_ERR_INT_LEN        (1U)
#define USB_MSEQ_ERR_INT_MSK        (((1U << USB_MSEQ_ERR_INT_LEN) - 1) << USB_MSEQ_ERR_INT_POS)
#define USB_MSEQ_ERR_INT_UMSK       (~(((1U << USB_MSEQ_ERR_INT_LEN) - 1) << USB_MSEQ_ERR_INT_POS))
#define USB_MSEQ_ABORT_INT          USB_MSEQ_ABORT_INT
#define USB_MSEQ_ABORT_INT_POS      (4U)
#define USB_MSEQ_ABORT_INT_LEN      (1U)
#define USB_MSEQ_ABORT_INT_MSK      (((1U << USB_MSEQ_ABORT_INT_LEN) - 1) << USB_MSEQ_ABORT_INT_POS)
#define USB_MSEQ_ABORT_INT_UMSK     (~(((1U << USB_MSEQ_ABORT_INT_LEN) - 1) << USB_MSEQ_ABORT_INT_POS))
#define USB_MTX0BYTE_INT            USB_MTX0BYTE_INT
#define USB_MTX0BYTE_INT_POS        (5U)
#define USB_MTX0BYTE_INT_LEN        (1U)
#define USB_MTX0BYTE_INT_MSK        (((1U << USB_MTX0BYTE_INT_LEN) - 1) << USB_MTX0BYTE_INT_POS)
#define USB_MTX0BYTE_INT_UMSK       (~(((1U << USB_MTX0BYTE_INT_LEN) - 1) << USB_MTX0BYTE_INT_POS))
#define USB_MRX0BYTE_INT            USB_MRX0BYTE_INT
#define USB_MRX0BYTE_INT_POS        (6U)
#define USB_MRX0BYTE_INT_LEN        (1U)
#define USB_MRX0BYTE_INT_MSK        (((1U << USB_MRX0BYTE_INT_LEN) - 1) << USB_MRX0BYTE_INT_POS)
#define USB_MRX0BYTE_INT_UMSK       (~(((1U << USB_MRX0BYTE_INT_LEN) - 1) << USB_MRX0BYTE_INT_POS))
#define USB_MDMA_CMPLT_HOV          USB_MDMA_CMPLT_HOV
#define USB_MDMA_CMPLT_HOV_POS      (7U)
#define USB_MDMA_CMPLT_HOV_LEN      (1U)
#define USB_MDMA_CMPLT_HOV_MSK      (((1U << USB_MDMA_CMPLT_HOV_LEN) - 1) << USB_MDMA_CMPLT_HOV_POS)
#define USB_MDMA_CMPLT_HOV_UMSK     (~(((1U << USB_MDMA_CMPLT_HOV_LEN) - 1) << USB_MDMA_CMPLT_HOV_POS))
#define USB_MDMA_ERROR_HOV          USB_MDMA_ERROR_HOV
#define USB_MDMA_ERROR_HOV_POS      (8U)
#define USB_MDMA_ERROR_HOV_LEN      (1U)
#define USB_MDMA_ERROR_HOV_MSK      (((1U << USB_MDMA_ERROR_HOV_LEN) - 1) << USB_MDMA_ERROR_HOV_POS)
#define USB_MDMA_ERROR_HOV_UMSK     (~(((1U << USB_MDMA_ERROR_HOV_LEN) - 1) << USB_MDMA_ERROR_HOV_POS))
#define USB_MDEV_IDLE_HOV           USB_MDEV_IDLE_HOV
#define USB_MDEV_IDLE_HOV_POS       (9U)
#define USB_MDEV_IDLE_HOV_LEN       (1U)
#define USB_MDEV_IDLE_HOV_MSK       (((1U << USB_MDEV_IDLE_HOV_LEN) - 1) << USB_MDEV_IDLE_HOV_POS)
#define USB_MDEV_IDLE_HOV_UMSK      (~(((1U << USB_MDEV_IDLE_HOV_LEN) - 1) << USB_MDEV_IDLE_HOV_POS))
#define USB_MDEV_WAKEUP_BYVBUS      USB_MDEV_WAKEUP_BYVBUS
#define USB_MDEV_WAKEUP_BYVBUS_POS  (10U)
#define USB_MDEV_WAKEUP_BYVBUS_LEN  (1U)
#define USB_MDEV_WAKEUP_BYVBUS_MSK  (((1U << USB_MDEV_WAKEUP_BYVBUS_LEN) - 1) << USB_MDEV_WAKEUP_BYVBUS_POS)
#define USB_MDEV_WAKEUP_BYVBUS_UMSK (~(((1U << USB_MDEV_WAKEUP_BYVBUS_LEN) - 1) << USB_MDEV_WAKEUP_BYVBUS_POS))
#define USB_MF8_OUT_INT             USB_MF8_OUT_INT
#define USB_MF8_OUT_INT_POS         (16U)
#define USB_MF8_OUT_INT_LEN         (1U)
#define USB_MF8_OUT_INT_MSK         (((1U << USB_MF8_OUT_INT_LEN) - 1) << USB_MF8_OUT_INT_POS)
#define USB_MF8_OUT_INT_UMSK        (~(((1U << USB_MF8_OUT_INT_LEN) - 1) << USB_MF8_OUT_INT_POS))
#define USB_MF8_SPK_INT             USB_MF8_SPK_INT
#define USB_MF8_SPK_INT_POS         (17U)
#define USB_MF8_SPK_INT_LEN         (1U)
#define USB_MF8_SPK_INT_MSK         (((1U << USB_MF8_SPK_INT_LEN) - 1) << USB_MF8_SPK_INT_POS)
#define USB_MF8_SPK_INT_UMSK        (~(((1U << USB_MF8_SPK_INT_LEN) - 1) << USB_MF8_SPK_INT_POS))
#define USB_MF9_OUT_INT             USB_MF9_OUT_INT
#define USB_MF9_OUT_INT_POS         (18U)
#define USB_MF9_OUT_INT_LEN         (1U)
#define USB_MF9_OUT_INT_MSK         (((1U << USB_MF9_OUT_INT_LEN) - 1) << USB_MF9_OUT_INT_POS)
#define USB_MF9_OUT_INT_UMSK        (~(((1U << USB_MF9_OUT_INT_LEN) - 1) << USB_MF9_OUT_INT_POS))
#define USB_MF9_SPK_INT             USB_MF9_SPK_INT
#define USB_MF9_SPK_INT_POS         (19U)
#define USB_MF9_SPK_INT_LEN         (1U)
#define USB_MF9_SPK_INT_MSK         (((1U << USB_MF9_SPK_INT_LEN) - 1) << USB_MF9_SPK_INT_POS)
#define USB_MF9_SPK_INT_UMSK        (~(((1U << USB_MF9_SPK_INT_LEN) - 1) << USB_MF9_SPK_INT_POS))
#define USB_MF10_OUT_INT            USB_MF10_OUT_INT
#define USB_MF10_OUT_INT_POS        (20U)
#define USB_MF10_OUT_INT_LEN        (1U)
#define USB_MF10_OUT_INT_MSK        (((1U << USB_MF10_OUT_INT_LEN) - 1) << USB_MF10_OUT_INT_POS)
#define USB_MF10_OUT_INT_UMSK       (~(((1U << USB_MF10_OUT_INT_LEN) - 1) << USB_MF10_OUT_INT_POS))
#define USB_MF10_SPK_INT            USB_MF10_SPK_INT
#define USB_MF10_SPK_INT_POS        (21U)
#define USB_MF10_SPK_INT_LEN        (1U)
#define USB_MF10_SPK_INT_MSK        (((1U << USB_MF10_SPK_INT_LEN) - 1) << USB_MF10_SPK_INT_POS)
#define USB_MF10_SPK_INT_UMSK       (~(((1U << USB_MF10_SPK_INT_LEN) - 1) << USB_MF10_SPK_INT_POS))
#define USB_MF11_OUT_INT            USB_MF11_OUT_INT
#define USB_MF11_OUT_INT_POS        (22U)
#define USB_MF11_OUT_INT_LEN        (1U)
#define USB_MF11_OUT_INT_MSK        (((1U << USB_MF11_OUT_INT_LEN) - 1) << USB_MF11_OUT_INT_POS)
#define USB_MF11_OUT_INT_UMSK       (~(((1U << USB_MF11_OUT_INT_LEN) - 1) << USB_MF11_OUT_INT_POS))
#define USB_MF11_SPK_INT            USB_MF11_SPK_INT
#define USB_MF11_SPK_INT_POS        (23U)
#define USB_MF11_SPK_INT_LEN        (1U)
#define USB_MF11_SPK_INT_MSK        (((1U << USB_MF11_SPK_INT_LEN) - 1) << USB_MF11_SPK_INT_POS)
#define USB_MF11_SPK_INT_UMSK       (~(((1U << USB_MF11_SPK_INT_LEN) - 1) << USB_MF11_SPK_INT_POS))
#define USB_MF12_OUT_INT            USB_MF12_OUT_INT
#define USB_MF12_OUT_INT_POS        (24U)
#define USB_MF12_OUT_INT_LEN        (1U)
#define USB_MF12_OUT_INT_MSK        (((1U << USB_MF12_OUT_INT_LEN) - 1) << USB_MF12_OUT_INT_POS)
#define USB_MF12_OUT_INT_UMSK       (~(((1U << USB_MF12_OUT_INT_LEN) - 1) << USB_MF12_OUT_INT_POS))
#define USB_MF12_SPK_INT            USB_MF12_SPK_INT
#define USB_MF12_SPK_INT_POS        (25U)
#define USB_MF12_SPK_INT_LEN        (1U)
#define USB_MF12_SPK_INT_MSK        (((1U << USB_MF12_SPK_INT_LEN) - 1) << USB_MF12_SPK_INT_POS)
#define USB_MF12_SPK_INT_UMSK       (~(((1U << USB_MF12_SPK_INT_LEN) - 1) << USB_MF12_SPK_INT_POS))
#define USB_MF13_OUT_INT            USB_MF13_OUT_INT
#define USB_MF13_OUT_INT_POS        (26U)
#define USB_MF13_OUT_INT_LEN        (1U)
#define USB_MF13_OUT_INT_MSK        (((1U << USB_MF13_OUT_INT_LEN) - 1) << USB_MF13_OUT_INT_POS)
#define USB_MF13_OUT_INT_UMSK       (~(((1U << USB_MF13_OUT_INT_LEN) - 1) << USB_MF13_OUT_INT_POS))
#define USB_MF13_SPK_INT            USB_MF13_SPK_INT
#define USB_MF13_SPK_INT_POS        (27U)
#define USB_MF13_SPK_INT_LEN        (1U)
#define USB_MF13_SPK_INT_MSK        (((1U << USB_MF13_SPK_INT_LEN) - 1) << USB_MF13_SPK_INT_POS)
#define USB_MF13_SPK_INT_UMSK       (~(((1U << USB_MF13_SPK_INT_LEN) - 1) << USB_MF13_SPK_INT_POS))
#define USB_MF14_OUT_INT            USB_MF14_OUT_INT
#define USB_MF14_OUT_INT_POS        (28U)
#define USB_MF14_OUT_INT_LEN        (1U)
#define USB_MF14_OUT_INT_MSK        (((1U << USB_MF14_OUT_INT_LEN) - 1) << USB_MF14_OUT_INT_POS)
#define USB_MF14_OUT_INT_UMSK       (~(((1U << USB_MF14_OUT_INT_LEN) - 1) << USB_MF14_OUT_INT_POS))
#define USB_MF14_SPK_INT            USB_MF14_SPK_INT
#define USB_MF14_SPK_INT_POS        (29U)
#define USB_MF14_SPK_INT_LEN        (1U)
#define USB_MF14_SPK_INT_MSK        (((1U << USB_MF14_SPK_INT_LEN) - 1) << USB_MF14_SPK_INT_POS)
#define USB_MF14_SPK_INT_UMSK       (~(((1U << USB_MF14_SPK_INT_LEN) - 1) << USB_MF14_SPK_INT_POS))
#define USB_MF15_OUT_INT            USB_MF15_OUT_INT
#define USB_MF15_OUT_INT_POS        (30U)
#define USB_MF15_OUT_INT_LEN        (1U)
#define USB_MF15_OUT_INT_MSK        (((1U << USB_MF15_OUT_INT_LEN) - 1) << USB_MF15_OUT_INT_POS)
#define USB_MF15_OUT_INT_UMSK       (~(((1U << USB_MF15_OUT_INT_LEN) - 1) << USB_MF15_OUT_INT_POS))
#define USB_MF15_SPK_INT            USB_MF15_SPK_INT
#define USB_MF15_SPK_INT_POS        (31U)
#define USB_MF15_SPK_INT_LEN        (1U)
#define USB_MF15_SPK_INT_MSK        (((1U << USB_MF15_SPK_INT_LEN) - 1) << USB_MF15_SPK_INT_POS)
#define USB_MF15_SPK_INT_UMSK       (~(((1U << USB_MF15_SPK_INT_LEN) - 1) << USB_MF15_SPK_INT_POS))

/* 0x140 : DEV_IGR */
#define USB_DEV_IGR_OFFSET  (0x140)
#define USB_INT_G0          USB_INT_G0
#define USB_INT_G0_POS      (0U)
#define USB_INT_G0_LEN      (1U)
#define USB_INT_G0_MSK      (((1U << USB_INT_G0_LEN) - 1) << USB_INT_G0_POS)
#define USB_INT_G0_UMSK     (~(((1U << USB_INT_G0_LEN) - 1) << USB_INT_G0_POS))
#define USB_INT_G1          USB_INT_G1
#define USB_INT_G1_POS      (1U)
#define USB_INT_G1_LEN      (1U)
#define USB_INT_G1_MSK      (((1U << USB_INT_G1_LEN) - 1) << USB_INT_G1_POS)
#define USB_INT_G1_UMSK     (~(((1U << USB_INT_G1_LEN) - 1) << USB_INT_G1_POS))
#define USB_INT_G2_HOV      USB_INT_G2_HOV
#define USB_INT_G2_HOV_POS  (2U)
#define USB_INT_G2_HOV_LEN  (1U)
#define USB_INT_G2_HOV_MSK  (((1U << USB_INT_G2_HOV_LEN) - 1) << USB_INT_G2_HOV_POS)
#define USB_INT_G2_HOV_UMSK (~(((1U << USB_INT_G2_HOV_LEN) - 1) << USB_INT_G2_HOV_POS))
#define USB_INT_G3          USB_INT_G3
#define USB_INT_G3_POS      (3U)
#define USB_INT_G3_LEN      (1U)
#define USB_INT_G3_MSK      (((1U << USB_INT_G3_LEN) - 1) << USB_INT_G3_POS)
#define USB_INT_G3_UMSK     (~(((1U << USB_INT_G3_LEN) - 1) << USB_INT_G3_POS))
#define USB_INT_G4          USB_INT_G4
#define USB_INT_G4_POS      (4U)
#define USB_INT_G4_LEN      (1U)
#define USB_INT_G4_MSK      (((1U << USB_INT_G4_LEN) - 1) << USB_INT_G4_POS)
#define USB_INT_G4_UMSK     (~(((1U << USB_INT_G4_LEN) - 1) << USB_INT_G4_POS))

/* 0x144 : DEV_ISG0 */
#define USB_DEV_ISG0_OFFSET     (0x144)
#define USB_CX_SETUP_INT        USB_CX_SETUP_INT
#define USB_CX_SETUP_INT_POS    (0U)
#define USB_CX_SETUP_INT_LEN    (1U)
#define USB_CX_SETUP_INT_MSK    (((1U << USB_CX_SETUP_INT_LEN) - 1) << USB_CX_SETUP_INT_POS)
#define USB_CX_SETUP_INT_UMSK   (~(((1U << USB_CX_SETUP_INT_LEN) - 1) << USB_CX_SETUP_INT_POS))
#define USB_CX_IN_INT           USB_CX_IN_INT
#define USB_CX_IN_INT_POS       (1U)
#define USB_CX_IN_INT_LEN       (1U)
#define USB_CX_IN_INT_MSK       (((1U << USB_CX_IN_INT_LEN) - 1) << USB_CX_IN_INT_POS)
#define USB_CX_IN_INT_UMSK      (~(((1U << USB_CX_IN_INT_LEN) - 1) << USB_CX_IN_INT_POS))
#define USB_CX_OUT_INT          USB_CX_OUT_INT
#define USB_CX_OUT_INT_POS      (2U)
#define USB_CX_OUT_INT_LEN      (1U)
#define USB_CX_OUT_INT_MSK      (((1U << USB_CX_OUT_INT_LEN) - 1) << USB_CX_OUT_INT_POS)
#define USB_CX_OUT_INT_UMSK     (~(((1U << USB_CX_OUT_INT_LEN) - 1) << USB_CX_OUT_INT_POS))
#define USB_CX_COMFAIL_INT      USB_CX_COMFAIL_INT
#define USB_CX_COMFAIL_INT_POS  (4U)
#define USB_CX_COMFAIL_INT_LEN  (1U)
#define USB_CX_COMFAIL_INT_MSK  (((1U << USB_CX_COMFAIL_INT_LEN) - 1) << USB_CX_COMFAIL_INT_POS)
#define USB_CX_COMFAIL_INT_UMSK (~(((1U << USB_CX_COMFAIL_INT_LEN) - 1) << USB_CX_COMFAIL_INT_POS))
#define USB_CX_COMABT_INT       USB_CX_COMABT_INT
#define USB_CX_COMABT_INT_POS   (5U)
#define USB_CX_COMABT_INT_LEN   (1U)
#define USB_CX_COMABT_INT_MSK   (((1U << USB_CX_COMABT_INT_LEN) - 1) << USB_CX_COMABT_INT_POS)
#define USB_CX_COMABT_INT_UMSK  (~(((1U << USB_CX_COMABT_INT_LEN) - 1) << USB_CX_COMABT_INT_POS))

