XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/usb_reg.h
/* 0x148 : DEV_ISG1 */
#define USB_DEV_ISG1_OFFSET (0x148)
#define USB_F0_OUT_INT      USB_F0_OUT_INT
#define USB_F0_OUT_INT_POS  (0U)
#define USB_F0_OUT_INT_LEN  (1U)
#define USB_F0_OUT_INT_MSK  (((1U << USB_F0_OUT_INT_LEN) - 1) << USB_F0_OUT_INT_POS)
#define USB_F0_OUT_INT_UMSK (~(((1U << USB_F0_OUT_INT_LEN) - 1) << USB_F0_OUT_INT_POS))
#define USB_F0_SPK_INT      USB_F0_SPK_INT
#define USB_F0_SPK_INT_POS  (1U)
#define USB_F0_SPK_INT_LEN  (1U)
#define USB_F0_SPK_INT_MSK  (((1U << USB_F0_SPK_INT_LEN) - 1) << USB_F0_SPK_INT_POS)
#define USB_F0_SPK_INT_UMSK (~(((1U << USB_F0_SPK_INT_LEN) - 1) << USB_F0_SPK_INT_POS))
#define USB_F1_OUT_INT      USB_F1_OUT_INT
#define USB_F1_OUT_INT_POS  (2U)
#define USB_F1_OUT_INT_LEN  (1U)
#define USB_F1_OUT_INT_MSK  (((1U << USB_F1_OUT_INT_LEN) - 1) << USB_F1_OUT_INT_POS)
#define USB_F1_OUT_INT_UMSK (~(((1U << USB_F1_OUT_INT_LEN) - 1) << USB_F1_OUT_INT_POS))
#define USB_F1_SPK_INT      USB_F1_SPK_INT
#define USB_F1_SPK_INT_POS  (3U)
#define USB_F1_SPK_INT_LEN  (1U)
#define USB_F1_SPK_INT_MSK  (((1U << USB_F1_SPK_INT_LEN) - 1) << USB_F1_SPK_INT_POS)
#define USB_F1_SPK_INT_UMSK (~(((1U << USB_F1_SPK_INT_LEN) - 1) << USB_F1_SPK_INT_POS))
#define USB_F2_OUT_INT      USB_F2_OUT_INT
#define USB_F2_OUT_INT_POS  (4U)
#define USB_F2_OUT_INT_LEN  (1U)
#define USB_F2_OUT_INT_MSK  (((1U << USB_F2_OUT_INT_LEN) - 1) << USB_F2_OUT_INT_POS)
#define USB_F2_OUT_INT_UMSK (~(((1U << USB_F2_OUT_INT_LEN) - 1) << USB_F2_OUT_INT_POS))
#define USB_F2_SPK_INT      USB_F2_SPK_INT
#define USB_F2_SPK_INT_POS  (5U)
#define USB_F2_SPK_INT_LEN  (1U)
#define USB_F2_SPK_INT_MSK  (((1U << USB_F2_SPK_INT_LEN) - 1) << USB_F2_SPK_INT_POS)
#define USB_F2_SPK_INT_UMSK (~(((1U << USB_F2_SPK_INT_LEN) - 1) << USB_F2_SPK_INT_POS))
#define USB_F3_OUT_INT      USB_F3_OUT_INT
#define USB_F3_OUT_INT_POS  (6U)
#define USB_F3_OUT_INT_LEN  (1U)
#define USB_F3_OUT_INT_MSK  (((1U << USB_F3_OUT_INT_LEN) - 1) << USB_F3_OUT_INT_POS)
#define USB_F3_OUT_INT_UMSK (~(((1U << USB_F3_OUT_INT_LEN) - 1) << USB_F3_OUT_INT_POS))
#define USB_F3_SPK_INT      USB_F3_SPK_INT
#define USB_F3_SPK_INT_POS  (7U)
#define USB_F3_SPK_INT_LEN  (1U)
#define USB_F3_SPK_INT_MSK  (((1U << USB_F3_SPK_INT_LEN) - 1) << USB_F3_SPK_INT_POS)
#define USB_F3_SPK_INT_UMSK (~(((1U << USB_F3_SPK_INT_LEN) - 1) << USB_F3_SPK_INT_POS))
#define USB_F4_OUT_INT      USB_F4_OUT_INT
#define USB_F4_OUT_INT_POS  (8U)
#define USB_F4_OUT_INT_LEN  (1U)
#define USB_F4_OUT_INT_MSK  (((1U << USB_F4_OUT_INT_LEN) - 1) << USB_F4_OUT_INT_POS)
#define USB_F4_OUT_INT_UMSK (~(((1U << USB_F4_OUT_INT_LEN) - 1) << USB_F4_OUT_INT_POS))
#define USB_F4_SPK_INT      USB_F4_SPK_INT
#define USB_F4_SPK_INT_POS  (9U)
#define USB_F4_SPK_INT_LEN  (1U)
#define USB_F4_SPK_INT_MSK  (((1U << USB_F4_SPK_INT_LEN) - 1) << USB_F4_SPK_INT_POS)
#define USB_F4_SPK_INT_UMSK (~(((1U << USB_F4_SPK_INT_LEN) - 1) << USB_F4_SPK_INT_POS))
#define USB_F5_OUT_INT      USB_F5_OUT_INT
#define USB_F5_OUT_INT_POS  (10U)
#define USB_F5_OUT_INT_LEN  (1U)
#define USB_F5_OUT_INT_MSK  (((1U << USB_F5_OUT_INT_LEN) - 1) << USB_F5_OUT_INT_POS)
#define USB_F5_OUT_INT_UMSK (~(((1U << USB_F5_OUT_INT_LEN) - 1) << USB_F5_OUT_INT_POS))
#define USB_F5_SPK_INT      USB_F5_SPK_INT
#define USB_F5_SPK_INT_POS  (11U)
#define USB_F5_SPK_INT_LEN  (1U)
#define USB_F5_SPK_INT_MSK  (((1U << USB_F5_SPK_INT_LEN) - 1) << USB_F5_SPK_INT_POS)
#define USB_F5_SPK_INT_UMSK (~(((1U << USB_F5_SPK_INT_LEN) - 1) << USB_F5_SPK_INT_POS))
#define USB_F6_OUT_INT      USB_F6_OUT_INT
#define USB_F6_OUT_INT_POS  (12U)
#define USB_F6_OUT_INT_LEN  (1U)
#define USB_F6_OUT_INT_MSK  (((1U << USB_F6_OUT_INT_LEN) - 1) << USB_F6_OUT_INT_POS)
#define USB_F6_OUT_INT_UMSK (~(((1U << USB_F6_OUT_INT_LEN) - 1) << USB_F6_OUT_INT_POS))
#define USB_F6_SPK_INT      USB_F6_SPK_INT
#define USB_F6_SPK_INT_POS  (13U)
#define USB_F6_SPK_INT_LEN  (1U)
#define USB_F6_SPK_INT_MSK  (((1U << USB_F6_SPK_INT_LEN) - 1) << USB_F6_SPK_INT_POS)
#define USB_F6_SPK_INT_UMSK (~(((1U << USB_F6_SPK_INT_LEN) - 1) << USB_F6_SPK_INT_POS))
#define USB_F7_OUT_INT      USB_F7_OUT_INT
#define USB_F7_OUT_INT_POS  (14U)
#define USB_F7_OUT_INT_LEN  (1U)
#define USB_F7_OUT_INT_MSK  (((1U << USB_F7_OUT_INT_LEN) - 1) << USB_F7_OUT_INT_POS)
#define USB_F7_OUT_INT_UMSK (~(((1U << USB_F7_OUT_INT_LEN) - 1) << USB_F7_OUT_INT_POS))
#define USB_F7_SPK_INT      USB_F7_SPK_INT
#define USB_F7_SPK_INT_POS  (15U)
#define USB_F7_SPK_INT_LEN  (1U)
#define USB_F7_SPK_INT_MSK  (((1U << USB_F7_SPK_INT_LEN) - 1) << USB_F7_SPK_INT_POS)
#define USB_F7_SPK_INT_UMSK (~(((1U << USB_F7_SPK_INT_LEN) - 1) << USB_F7_SPK_INT_POS))
#define USB_F0_IN_INT       USB_F0_IN_INT
#define USB_F0_IN_INT_POS   (16U)
#define USB_F0_IN_INT_LEN   (1U)
#define USB_F0_IN_INT_MSK   (((1U << USB_F0_IN_INT_LEN) - 1) << USB_F0_IN_INT_POS)
#define USB_F0_IN_INT_UMSK  (~(((1U << USB_F0_IN_INT_LEN) - 1) << USB_F0_IN_INT_POS))
#define USB_F1_IN_INT       USB_F1_IN_INT
#define USB_F1_IN_INT_POS   (17U)
#define USB_F1_IN_INT_LEN   (1U)
#define USB_F1_IN_INT_MSK   (((1U << USB_F1_IN_INT_LEN) - 1) << USB_F1_IN_INT_POS)
#define USB_F1_IN_INT_UMSK  (~(((1U << USB_F1_IN_INT_LEN) - 1) << USB_F1_IN_INT_POS))
#define USB_F2_IN_INT       USB_F2_IN_INT
#define USB_F2_IN_INT_POS   (18U)
#define USB_F2_IN_INT_LEN   (1U)
#define USB_F2_IN_INT_MSK   (((1U << USB_F2_IN_INT_LEN) - 1) << USB_F2_IN_INT_POS)
#define USB_F2_IN_INT_UMSK  (~(((1U << USB_F2_IN_INT_LEN) - 1) << USB_F2_IN_INT_POS))
#define USB_F3_IN_INT       USB_F3_IN_INT
#define USB_F3_IN_INT_POS   (19U)
#define USB_F3_IN_INT_LEN   (1U)
#define USB_F3_IN_INT_MSK   (((1U << USB_F3_IN_INT_LEN) - 1) << USB_F3_IN_INT_POS)
#define USB_F3_IN_INT_UMSK  (~(((1U << USB_F3_IN_INT_LEN) - 1) << USB_F3_IN_INT_POS))
#define USB_F4_IN_INT       USB_F4_IN_INT
#define USB_F4_IN_INT_POS   (20U)
#define USB_F4_IN_INT_LEN   (1U)
#define USB_F4_IN_INT_MSK   (((1U << USB_F4_IN_INT_LEN) - 1) << USB_F4_IN_INT_POS)
#define USB_F4_IN_INT_UMSK  (~(((1U << USB_F4_IN_INT_LEN) - 1) << USB_F4_IN_INT_POS))
#define USB_F5_IN_INT       USB_F5_IN_INT
#define USB_F5_IN_INT_POS   (21U)
#define USB_F5_IN_INT_LEN   (1U)
#define USB_F5_IN_INT_MSK   (((1U << USB_F5_IN_INT_LEN) - 1) << USB_F5_IN_INT_POS)
#define USB_F5_IN_INT_UMSK  (~(((1U << USB_F5_IN_INT_LEN) - 1) << USB_F5_IN_INT_POS))
#define USB_F6_IN_INT       USB_F6_IN_INT
#define USB_F6_IN_INT_POS   (22U)
#define USB_F6_IN_INT_LEN   (1U)
#define USB_F6_IN_INT_MSK   (((1U << USB_F6_IN_INT_LEN) - 1) << USB_F6_IN_INT_POS)
#define USB_F6_IN_INT_UMSK  (~(((1U << USB_F6_IN_INT_LEN) - 1) << USB_F6_IN_INT_POS))
#define USB_F7_IN_INT       USB_F7_IN_INT
#define USB_F7_IN_INT_POS   (23U)
#define USB_F7_IN_INT_LEN   (1U)
#define USB_F7_IN_INT_MSK   (((1U << USB_F7_IN_INT_LEN) - 1) << USB_F7_IN_INT_POS)
#define USB_F7_IN_INT_UMSK  (~(((1U << USB_F7_IN_INT_LEN) - 1) << USB_F7_IN_INT_POS))
#define USB_F8_IN_INT       USB_F8_IN_INT
#define USB_F8_IN_INT_POS   (24U)
#define USB_F8_IN_INT_LEN   (1U)
#define USB_F8_IN_INT_MSK   (((1U << USB_F8_IN_INT_LEN) - 1) << USB_F8_IN_INT_POS)
#define USB_F8_IN_INT_UMSK  (~(((1U << USB_F8_IN_INT_LEN) - 1) << USB_F8_IN_INT_POS))
#define USB_F9_IN_INT       USB_F9_IN_INT
#define USB_F9_IN_INT_POS   (25U)
#define USB_F9_IN_INT_LEN   (1U)
#define USB_F9_IN_INT_MSK   (((1U << USB_F9_IN_INT_LEN) - 1) << USB_F9_IN_INT_POS)
#define USB_F9_IN_INT_UMSK  (~(((1U << USB_F9_IN_INT_LEN) - 1) << USB_F9_IN_INT_POS))
#define USB_F10_IN_INT      USB_F10_IN_INT
#define USB_F10_IN_INT_POS  (26U)
#define USB_F10_IN_INT_LEN  (1U)
#define USB_F10_IN_INT_MSK  (((1U << USB_F10_IN_INT_LEN) - 1) << USB_F10_IN_INT_POS)
#define USB_F10_IN_INT_UMSK (~(((1U << USB_F10_IN_INT_LEN) - 1) << USB_F10_IN_INT_POS))
#define USB_F11_IN_INT      USB_F11_IN_INT
#define USB_F11_IN_INT_POS  (27U)
#define USB_F11_IN_INT_LEN  (1U)
#define USB_F11_IN_INT_MSK  (((1U << USB_F11_IN_INT_LEN) - 1) << USB_F11_IN_INT_POS)
#define USB_F11_IN_INT_UMSK (~(((1U << USB_F11_IN_INT_LEN) - 1) << USB_F11_IN_INT_POS))
#define USB_F12_IN_INT      USB_F12_IN_INT
#define USB_F12_IN_INT_POS  (28U)
#define USB_F12_IN_INT_LEN  (1U)
#define USB_F12_IN_INT_MSK  (((1U << USB_F12_IN_INT_LEN) - 1) << USB_F12_IN_INT_POS)
#define USB_F12_IN_INT_UMSK (~(((1U << USB_F12_IN_INT_LEN) - 1) << USB_F12_IN_INT_POS))
#define USB_F13_IN_INT      USB_F13_IN_INT
#define USB_F13_IN_INT_POS  (29U)
#define USB_F13_IN_INT_LEN  (1U)
#define USB_F13_IN_INT_MSK  (((1U << USB_F13_IN_INT_LEN) - 1) << USB_F13_IN_INT_POS)
#define USB_F13_IN_INT_UMSK (~(((1U << USB_F13_IN_INT_LEN) - 1) << USB_F13_IN_INT_POS))
#define USB_F14_IN_INT      USB_F14_IN_INT
#define USB_F14_IN_INT_POS  (30U)
#define USB_F14_IN_INT_LEN  (1U)
#define USB_F14_IN_INT_MSK  (((1U << USB_F14_IN_INT_LEN) - 1) << USB_F14_IN_INT_POS)
#define USB_F14_IN_INT_UMSK (~(((1U << USB_F14_IN_INT_LEN) - 1) << USB_F14_IN_INT_POS))
#define USB_F15_IN_INT      USB_F15_IN_INT
#define USB_F15_IN_INT_POS  (31U)
#define USB_F15_IN_INT_LEN  (1U)
#define USB_F15_IN_INT_MSK  (((1U << USB_F15_IN_INT_LEN) - 1) << USB_F15_IN_INT_POS)
#define USB_F15_IN_INT_UMSK (~(((1U << USB_F15_IN_INT_LEN) - 1) << USB_F15_IN_INT_POS))

/* 0x14C : DEV_ISG2 */
#define USB_DEV_ISG2_OFFSET        (0x14C)
#define USBRST_INT                 USBRST_INT
#define USBRST_INT_POS             (0U)
#define USBRST_INT_LEN             (1U)
#define USBRST_INT_MSK             (((1U << USBRST_INT_LEN) - 1) << USBRST_INT_POS)
#define USBRST_INT_UMSK            (~(((1U << USBRST_INT_LEN) - 1) << USBRST_INT_POS))
#define USB_SUSP_INT               USB_SUSP_INT
#define USB_SUSP_INT_POS           (1U)
#define USB_SUSP_INT_LEN           (1U)
#define USB_SUSP_INT_MSK           (((1U << USB_SUSP_INT_LEN) - 1) << USB_SUSP_INT_POS)
#define USB_SUSP_INT_UMSK          (~(((1U << USB_SUSP_INT_LEN) - 1) << USB_SUSP_INT_POS))
#define USB_RESM_INT               USB_RESM_INT
#define USB_RESM_INT_POS           (2U)
#define USB_RESM_INT_LEN           (1U)
#define USB_RESM_INT_MSK           (((1U << USB_RESM_INT_LEN) - 1) << USB_RESM_INT_POS)
#define USB_RESM_INT_UMSK          (~(((1U << USB_RESM_INT_LEN) - 1) << USB_RESM_INT_POS))
#define USB_ISO_SEQ_ERR_INT        USB_ISO_SEQ_ERR_INT
#define USB_ISO_SEQ_ERR_INT_POS    (3U)
#define USB_ISO_SEQ_ERR_INT_LEN    (1U)
#define USB_ISO_SEQ_ERR_INT_MSK    (((1U << USB_ISO_SEQ_ERR_INT_LEN) - 1) << USB_ISO_SEQ_ERR_INT_POS)
#define USB_ISO_SEQ_ERR_INT_UMSK   (~(((1U << USB_ISO_SEQ_ERR_INT_LEN) - 1) << USB_ISO_SEQ_ERR_INT_POS))
#define USB_ISO_SEQ_ABORT_INT      USB_ISO_SEQ_ABORT_INT
#define USB_ISO_SEQ_ABORT_INT_POS  (4U)
#define USB_ISO_SEQ_ABORT_INT_LEN  (1U)
#define USB_ISO_SEQ_ABORT_INT_MSK  (((1U << USB_ISO_SEQ_ABORT_INT_LEN) - 1) << USB_ISO_SEQ_ABORT_INT_POS)
#define USB_ISO_SEQ_ABORT_INT_UMSK (~(((1U << USB_ISO_SEQ_ABORT_INT_LEN) - 1) << USB_ISO_SEQ_ABORT_INT_POS))
#define USB_TX0BYTE_INT            USB_TX0BYTE_INT
#define USB_TX0BYTE_INT_POS        (5U)
#define USB_TX0BYTE_INT_LEN        (1U)
#define USB_TX0BYTE_INT_MSK        (((1U << USB_TX0BYTE_INT_LEN) - 1) << USB_TX0BYTE_INT_POS)
#define USB_TX0BYTE_INT_UMSK       (~(((1U << USB_TX0BYTE_INT_LEN) - 1) << USB_TX0BYTE_INT_POS))
#define USB_RX0BYTE_INT            USB_RX0BYTE_INT
#define USB_RX0BYTE_INT_POS        (6U)
#define USB_RX0BYTE_INT_LEN        (1U)
#define USB_RX0BYTE_INT_MSK        (((1U << USB_RX0BYTE_INT_LEN) - 1) << USB_RX0BYTE_INT_POS)
#define USB_RX0BYTE_INT_UMSK       (~(((1U << USB_RX0BYTE_INT_LEN) - 1) << USB_RX0BYTE_INT_POS))
#define USB_DMA_CMPLT_HOV          USB_DMA_CMPLT_HOV
#define USB_DMA_CMPLT_HOV_POS      (7U)
#define USB_DMA_CMPLT_HOV_LEN      (1U)
#define USB_DMA_CMPLT_HOV_MSK      (((1U << USB_DMA_CMPLT_HOV_LEN) - 1) << USB_DMA_CMPLT_HOV_POS)
#define USB_DMA_CMPLT_HOV_UMSK     (~(((1U << USB_DMA_CMPLT_HOV_LEN) - 1) << USB_DMA_CMPLT_HOV_POS))
#define USB_DMA_ERROR_HOV          USB_DMA_ERROR_HOV
#define USB_DMA_ERROR_HOV_POS      (8U)
#define USB_DMA_ERROR_HOV_LEN      (1U)
#define USB_DMA_ERROR_HOV_MSK      (((1U << USB_DMA_ERROR_HOV_LEN) - 1) << USB_DMA_ERROR_HOV_POS)
#define USB_DMA_ERROR_HOV_UMSK     (~(((1U << USB_DMA_ERROR_HOV_LEN) - 1) << USB_DMA_ERROR_HOV_POS))
#define USB_DEV_IDLE_HOV           USB_DEV_IDLE_HOV
#define USB_DEV_IDLE_HOV_POS       (9U)
#define USB_DEV_IDLE_HOV_LEN       (1U)
#define USB_DEV_IDLE_HOV_MSK       (((1U << USB_DEV_IDLE_HOV_LEN) - 1) << USB_DEV_IDLE_HOV_POS)
#define USB_DEV_IDLE_HOV_UMSK      (~(((1U << USB_DEV_IDLE_HOV_LEN) - 1) << USB_DEV_IDLE_HOV_POS))
#define USB_DEV_WAKEUP_BYVBUS      USB_DEV_WAKEUP_BYVBUS
#define USB_DEV_WAKEUP_BYVBUS_POS  (10U)
#define USB_DEV_WAKEUP_BYVBUS_LEN  (1U)
#define USB_DEV_WAKEUP_BYVBUS_MSK  (((1U << USB_DEV_WAKEUP_BYVBUS_LEN) - 1) << USB_DEV_WAKEUP_BYVBUS_POS)
#define USB_DEV_WAKEUP_BYVBUS_UMSK (~(((1U << USB_DEV_WAKEUP_BYVBUS_LEN) - 1) << USB_DEV_WAKEUP_BYVBUS_POS))
#define USB_F8_OUT_INT             USB_F8_OUT_INT
#define USB_F8_OUT_INT_POS         (16U)
#define USB_F8_OUT_INT_LEN         (1U)
#define USB_F8_OUT_INT_MSK         (((1U << USB_F8_OUT_INT_LEN) - 1) << USB_F8_OUT_INT_POS)
#define USB_F8_OUT_INT_UMSK        (~(((1U << USB_F8_OUT_INT_LEN) - 1) << USB_F8_OUT_INT_POS))
#define USB_F8_SPK_INT             USB_F8_SPK_INT
#define USB_F8_SPK_INT_POS         (17U)
#define USB_F8_SPK_INT_LEN         (1U)
#define USB_F8_SPK_INT_MSK         (((1U << USB_F8_SPK_INT_LEN) - 1) << USB_F8_SPK_INT_POS)
#define USB_F8_SPK_INT_UMSK        (~(((1U << USB_F8_SPK_INT_LEN) - 1) << USB_F8_SPK_INT_POS))
#define USB_F9_OUT_INT             USB_F9_OUT_INT
#define USB_F9_OUT_INT_POS         (18U)
#define USB_F9_OUT_INT_LEN         (1U)
#define USB_F9_OUT_INT_MSK         (((1U << USB_F9_OUT_INT_LEN) - 1) << USB_F9_OUT_INT_POS)
#define USB_F9_OUT_INT_UMSK        (~(((1U << USB_F9_OUT_INT_LEN) - 1) << USB_F9_OUT_INT_POS))
#define USB_F9_SPK_INT             USB_F9_SPK_INT
#define USB_F9_SPK_INT_POS         (19U)
#define USB_F9_SPK_INT_LEN         (1U)
#define USB_F9_SPK_INT_MSK         (((1U << USB_F9_SPK_INT_LEN) - 1) << USB_F9_SPK_INT_POS)
#define USB_F9_SPK_INT_UMSK        (~(((1U << USB_F9_SPK_INT_LEN) - 1) << USB_F9_SPK_INT_POS))
#define USB_F10_OUT_INT            USB_F10_OUT_INT
#define USB_F10_OUT_INT_POS        (20U)
#define USB_F10_OUT_INT_LEN        (1U)
#define USB_F10_OUT_INT_MSK        (((1U << USB_F10_OUT_INT_LEN) - 1) << USB_F10_OUT_INT_POS)
#define USB_F10_OUT_INT_UMSK       (~(((1U << USB_F10_OUT_INT_LEN) - 1) << USB_F10_OUT_INT_POS))
#define USB_F10_SPK_INT            USB_F10_SPK_INT
#define USB_F10_SPK_INT_POS        (21U)
#define USB_F10_SPK_INT_LEN        (1U)
#define USB_F10_SPK_INT_MSK        (((1U << USB_F10_SPK_INT_LEN) - 1) << USB_F10_SPK_INT_POS)
#define USB_F10_SPK_INT_UMSK       (~(((1U << USB_F10_SPK_INT_LEN) - 1) << USB_F10_SPK_INT_POS))
#define USB_F11_OUT_INT            USB_F11_OUT_INT
#define USB_F11_OUT_INT_POS        (22U)
#define USB_F11_OUT_INT_LEN        (1U)
#define USB_F11_OUT_INT_MSK        (((1U << USB_F11_OUT_INT_LEN) - 1) << USB_F11_OUT_INT_POS)
#define USB_F11_OUT_INT_UMSK       (~(((1U << USB_F11_OUT_INT_LEN) - 1) << USB_F11_OUT_INT_POS))
#define USB_F11_SPK_INT            USB_F11_SPK_INT
#define USB_F11_SPK_INT_POS        (23U)
#define USB_F11_SPK_INT_LEN        (1U)
#define USB_F11_SPK_INT_MSK        (((1U << USB_F11_SPK_INT_LEN) - 1) << USB_F11_SPK_INT_POS)
#define USB_F11_SPK_INT_UMSK       (~(((1U << USB_F11_SPK_INT_LEN) - 1) << USB_F11_SPK_INT_POS))
#define USB_F12_OUT_INT            USB_F12_OUT_INT
#define USB_F12_OUT_INT_POS        (24U)
#define USB_F12_OUT_INT_LEN        (1U)
#define USB_F12_OUT_INT_MSK        (((1U << USB_F12_OUT_INT_LEN) - 1) << USB_F12_OUT_INT_POS)
#define USB_F12_OUT_INT_UMSK       (~(((1U << USB_F12_OUT_INT_LEN) - 1) << USB_F12_OUT_INT_POS))
#define USB_F12_SPK_INT            USB_F12_SPK_INT
#define USB_F12_SPK_INT_POS        (25U)
#define USB_F12_SPK_INT_LEN        (1U)
#define USB_F12_SPK_INT_MSK        (((1U << USB_F12_SPK_INT_LEN) - 1) << USB_F12_SPK_INT_POS)
#define USB_F12_SPK_INT_UMSK       (~(((1U << USB_F12_SPK_INT_LEN) - 1) << USB_F12_SPK_INT_POS))
#define USB_F13_OUT_INT            USB_F13_OUT_INT
#define USB_F13_OUT_INT_POS        (26U)
#define USB_F13_OUT_INT_LEN        (1U)
#define USB_F13_OUT_INT_MSK        (((1U << USB_F13_OUT_INT_LEN) - 1) << USB_F13_OUT_INT_POS)
#define USB_F13_OUT_INT_UMSK       (~(((1U << USB_F13_OUT_INT_LEN) - 1) << USB_F13_OUT_INT_POS))
#define USB_F13_SPK_INT            USB_F13_SPK_INT
#define USB_F13_SPK_INT_POS        (27U)
#define USB_F13_SPK_INT_LEN        (1U)
#define USB_F13_SPK_INT_MSK        (((1U << USB_F13_SPK_INT_LEN) - 1) << USB_F13_SPK_INT_POS)
#define USB_F13_SPK_INT_UMSK       (~(((1U << USB_F13_SPK_INT_LEN) - 1) << USB_F13_SPK_INT_POS))
#define USB_F14_OUT_INT            USB_F14_OUT_INT
#define USB_F14_OUT_INT_POS        (28U)
#define USB_F14_OUT_INT_LEN        (1U)
#define USB_F14_OUT_INT_MSK        (((1U << USB_F14_OUT_INT_LEN) - 1) << USB_F14_OUT_INT_POS)
#define USB_F14_OUT_INT_UMSK       (~(((1U << USB_F14_OUT_INT_LEN) - 1) << USB_F14_OUT_INT_POS))
#define USB_F14_SPK_INT            USB_F14_SPK_INT
#define USB_F14_SPK_INT_POS        (29U)
#define USB_F14_SPK_INT_LEN        (1U)
#define USB_F14_SPK_INT_MSK        (((1U << USB_F14_SPK_INT_LEN) - 1) << USB_F14_SPK_INT_POS)
#define USB_F14_SPK_INT_UMSK       (~(((1U << USB_F14_SPK_INT_LEN) - 1) << USB_F14_SPK_INT_POS))
#define USB_F15_OUT_INT            USB_F15_OUT_INT
#define USB_F15_OUT_INT_POS        (30U)
#define USB_F15_OUT_INT_LEN        (1U)
#define USB_F15_OUT_INT_MSK        (((1U << USB_F15_OUT_INT_LEN) - 1) << USB_F15_OUT_INT_POS)
#define USB_F15_OUT_INT_UMSK       (~(((1U << USB_F15_OUT_INT_LEN) - 1) << USB_F15_OUT_INT_POS))
#define USB_F15_SPK_INT            USB_F15_SPK_INT
#define USB_F15_SPK_INT_POS        (31U)
#define USB_F15_SPK_INT_LEN        (1U)
#define USB_F15_SPK_INT_MSK        (((1U << USB_F15_SPK_INT_LEN) - 1) << USB_F15_SPK_INT_POS)
#define USB_F15_SPK_INT_UMSK       (~(((1U << USB_F15_SPK_INT_LEN) - 1) << USB_F15_SPK_INT_POS))

/* 0x150 : DEV_RXZ */
#define USB_DEV_RXZ_OFFSET   (0x150)
#define USB_RX0BYTE_EP1      USB_RX0BYTE_EP1
#define USB_RX0BYTE_EP1_POS  (0U)
#define USB_RX0BYTE_EP1_LEN  (1U)
#define USB_RX0BYTE_EP1_MSK  (((1U << USB_RX0BYTE_EP1_LEN) - 1) << USB_RX0BYTE_EP1_POS)
#define USB_RX0BYTE_EP1_UMSK (~(((1U << USB_RX0BYTE_EP1_LEN) - 1) << USB_RX0BYTE_EP1_POS))
#define USB_RX0BYTE_EP2      USB_RX0BYTE_EP2
#define USB_RX0BYTE_EP2_POS  (1U)
#define USB_RX0BYTE_EP2_LEN  (1U)
#define USB_RX0BYTE_EP2_MSK  (((1U << USB_RX0BYTE_EP2_LEN) - 1) << USB_RX0BYTE_EP2_POS)
#define USB_RX0BYTE_EP2_UMSK (~(((1U << USB_RX0BYTE_EP2_LEN) - 1) << USB_RX0BYTE_EP2_POS))
#define USB_RX0BYTE_EP3      USB_RX0BYTE_EP3
#define USB_RX0BYTE_EP3_POS  (2U)
#define USB_RX0BYTE_EP3_LEN  (1U)
#define USB_RX0BYTE_EP3_MSK  (((1U << USB_RX0BYTE_EP3_LEN) - 1) << USB_RX0BYTE_EP3_POS)
#define USB_RX0BYTE_EP3_UMSK (~(((1U << USB_RX0BYTE_EP3_LEN) - 1) << USB_RX0BYTE_EP3_POS))
#define USB_RX0BYTE_EP4      USB_RX0BYTE_EP4
#define USB_RX0BYTE_EP4_POS  (3U)
#define USB_RX0BYTE_EP4_LEN  (1U)
#define USB_RX0BYTE_EP4_MSK  (((1U << USB_RX0BYTE_EP4_LEN) - 1) << USB_RX0BYTE_EP4_POS)
#define USB_RX0BYTE_EP4_UMSK (~(((1U << USB_RX0BYTE_EP4_LEN) - 1) << USB_RX0BYTE_EP4_POS))
#define USB_RX0BYTE_EP5      USB_RX0BYTE_EP5
#define USB_RX0BYTE_EP5_POS  (4U)
#define USB_RX0BYTE_EP5_LEN  (1U)
#define USB_RX0BYTE_EP5_MSK  (((1U << USB_RX0BYTE_EP5_LEN) - 1) << USB_RX0BYTE_EP5_POS)
#define USB_RX0BYTE_EP5_UMSK (~(((1U << USB_RX0BYTE_EP5_LEN) - 1) << USB_RX0BYTE_EP5_POS))
#define USB_RX0BYTE_EP6      USB_RX0BYTE_EP6
#define USB_RX0BYTE_EP6_POS  (5U)
#define USB_RX0BYTE_EP6_LEN  (1U)
#define USB_RX0BYTE_EP6_MSK  (((1U << USB_RX0BYTE_EP6_LEN) - 1) << USB_RX0BYTE_EP6_POS)
#define USB_RX0BYTE_EP6_UMSK (~(((1U << USB_RX0BYTE_EP6_LEN) - 1) << USB_RX0BYTE_EP6_POS))
#define USB_RX0BYTE_EP7      USB_RX0BYTE_EP7
#define USB_RX0BYTE_EP7_POS  (6U)
#define USB_RX0BYTE_EP7_LEN  (1U)
#define USB_RX0BYTE_EP7_MSK  (((1U << USB_RX0BYTE_EP7_LEN) - 1) << USB_RX0BYTE_EP7_POS)
#define USB_RX0BYTE_EP7_UMSK (~(((1U << USB_RX0BYTE_EP7_LEN) - 1) << USB_RX0BYTE_EP7_POS))
#define USB_RX0BYTE_EP8      USB_RX0BYTE_EP8
#define USB_RX0BYTE_EP8_POS  (7U)
#define USB_RX0BYTE_EP8_LEN  (1U)
#define USB_RX0BYTE_EP8_MSK  (((1U << USB_RX0BYTE_EP8_LEN) - 1) << USB_RX0BYTE_EP8_POS)
#define USB_RX0BYTE_EP8_UMSK (~(((1U << USB_RX0BYTE_EP8_LEN) - 1) << USB_RX0BYTE_EP8_POS))

