XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/usb_reg.h
/* 0x174 : DEV_INMPS6 */
#define USB_DEV_INMPS6_OFFSET    (0x174)
#define USB_MAXPS_IEP6           USB_MAXPS_IEP6
#define USB_MAXPS_IEP6_POS       (0U)
#define USB_MAXPS_IEP6_LEN       (11U)
#define USB_MAXPS_IEP6_MSK       (((1U << USB_MAXPS_IEP6_LEN) - 1) << USB_MAXPS_IEP6_POS)
#define USB_MAXPS_IEP6_UMSK      (~(((1U << USB_MAXPS_IEP6_LEN) - 1) << USB_MAXPS_IEP6_POS))
#define USB_STL_IEP6             USB_STL_IEP6
#define USB_STL_IEP6_POS         (11U)
#define USB_STL_IEP6_LEN         (1U)
#define USB_STL_IEP6_MSK         (((1U << USB_STL_IEP6_LEN) - 1) << USB_STL_IEP6_POS)
#define USB_STL_IEP6_UMSK        (~(((1U << USB_STL_IEP6_LEN) - 1) << USB_STL_IEP6_POS))
#define USB_RSTG_IEP6            USB_RSTG_IEP6
#define USB_RSTG_IEP6_POS        (12U)
#define USB_RSTG_IEP6_LEN        (1U)
#define USB_RSTG_IEP6_MSK        (((1U << USB_RSTG_IEP6_LEN) - 1) << USB_RSTG_IEP6_POS)
#define USB_RSTG_IEP6_UMSK       (~(((1U << USB_RSTG_IEP6_LEN) - 1) << USB_RSTG_IEP6_POS))
#define USB_TX_NUM_HBW_IEP6      USB_TX_NUM_HBW_IEP6
#define USB_TX_NUM_HBW_IEP6_POS  (13U)
#define USB_TX_NUM_HBW_IEP6_LEN  (2U)
#define USB_TX_NUM_HBW_IEP6_MSK  (((1U << USB_TX_NUM_HBW_IEP6_LEN) - 1) << USB_TX_NUM_HBW_IEP6_POS)
#define USB_TX_NUM_HBW_IEP6_UMSK (~(((1U << USB_TX_NUM_HBW_IEP6_LEN) - 1) << USB_TX_NUM_HBW_IEP6_POS))
#define USB_TX0BYTE_IEP6         USB_TX0BYTE_IEP6
#define USB_TX0BYTE_IEP6_POS     (15U)
#define USB_TX0BYTE_IEP6_LEN     (1U)
#define USB_TX0BYTE_IEP6_MSK     (((1U << USB_TX0BYTE_IEP6_LEN) - 1) << USB_TX0BYTE_IEP6_POS)
#define USB_TX0BYTE_IEP6_UMSK    (~(((1U << USB_TX0BYTE_IEP6_LEN) - 1) << USB_TX0BYTE_IEP6_POS))

/* 0x178 : DEV_INMPS7 */
#define USB_DEV_INMPS7_OFFSET    (0x178)
#define USB_MAXPS_IEP7           USB_MAXPS_IEP7
#define USB_MAXPS_IEP7_POS       (0U)
#define USB_MAXPS_IEP7_LEN       (11U)
#define USB_MAXPS_IEP7_MSK       (((1U << USB_MAXPS_IEP7_LEN) - 1) << USB_MAXPS_IEP7_POS)
#define USB_MAXPS_IEP7_UMSK      (~(((1U << USB_MAXPS_IEP7_LEN) - 1) << USB_MAXPS_IEP7_POS))
#define USB_STL_IEP7             USB_STL_IEP7
#define USB_STL_IEP7_POS         (11U)
#define USB_STL_IEP7_LEN         (1U)
#define USB_STL_IEP7_MSK         (((1U << USB_STL_IEP7_LEN) - 1) << USB_STL_IEP7_POS)
#define USB_STL_IEP7_UMSK        (~(((1U << USB_STL_IEP7_LEN) - 1) << USB_STL_IEP7_POS))
#define USB_RSTG_IEP7            USB_RSTG_IEP7
#define USB_RSTG_IEP7_POS        (12U)
#define USB_RSTG_IEP7_LEN        (1U)
#define USB_RSTG_IEP7_MSK        (((1U << USB_RSTG_IEP7_LEN) - 1) << USB_RSTG_IEP7_POS)
#define USB_RSTG_IEP7_UMSK       (~(((1U << USB_RSTG_IEP7_LEN) - 1) << USB_RSTG_IEP7_POS))
#define USB_TX_NUM_HBW_IEP7      USB_TX_NUM_HBW_IEP7
#define USB_TX_NUM_HBW_IEP7_POS  (13U)
#define USB_TX_NUM_HBW_IEP7_LEN  (2U)
#define USB_TX_NUM_HBW_IEP7_MSK  (((1U << USB_TX_NUM_HBW_IEP7_LEN) - 1) << USB_TX_NUM_HBW_IEP7_POS)
#define USB_TX_NUM_HBW_IEP7_UMSK (~(((1U << USB_TX_NUM_HBW_IEP7_LEN) - 1) << USB_TX_NUM_HBW_IEP7_POS))
#define USB_TX0BYTE_IEP7         USB_TX0BYTE_IEP7
#define USB_TX0BYTE_IEP7_POS     (15U)
#define USB_TX0BYTE_IEP7_LEN     (1U)
#define USB_TX0BYTE_IEP7_MSK     (((1U << USB_TX0BYTE_IEP7_LEN) - 1) << USB_TX0BYTE_IEP7_POS)
#define USB_TX0BYTE_IEP7_UMSK    (~(((1U << USB_TX0BYTE_IEP7_LEN) - 1) << USB_TX0BYTE_IEP7_POS))

/* 0x17C : DEV_INMPS8 */
#define USB_DEV_INMPS8_OFFSET    (0x17C)
#define USB_MAXPS_IEP8           USB_MAXPS_IEP8
#define USB_MAXPS_IEP8_POS       (0U)
#define USB_MAXPS_IEP8_LEN       (11U)
#define USB_MAXPS_IEP8_MSK       (((1U << USB_MAXPS_IEP8_LEN) - 1) << USB_MAXPS_IEP8_POS)
#define USB_MAXPS_IEP8_UMSK      (~(((1U << USB_MAXPS_IEP8_LEN) - 1) << USB_MAXPS_IEP8_POS))
#define USB_STL_IEP8             USB_STL_IEP8
#define USB_STL_IEP8_POS         (11U)
#define USB_STL_IEP8_LEN         (1U)
#define USB_STL_IEP8_MSK         (((1U << USB_STL_IEP8_LEN) - 1) << USB_STL_IEP8_POS)
#define USB_STL_IEP8_UMSK        (~(((1U << USB_STL_IEP8_LEN) - 1) << USB_STL_IEP8_POS))
#define USB_RSTG_IEP8            USB_RSTG_IEP8
#define USB_RSTG_IEP8_POS        (12U)
#define USB_RSTG_IEP8_LEN        (1U)
#define USB_RSTG_IEP8_MSK        (((1U << USB_RSTG_IEP8_LEN) - 1) << USB_RSTG_IEP8_POS)
#define USB_RSTG_IEP8_UMSK       (~(((1U << USB_RSTG_IEP8_LEN) - 1) << USB_RSTG_IEP8_POS))
#define USB_TX_NUM_HBW_IEP8      USB_TX_NUM_HBW_IEP8
#define USB_TX_NUM_HBW_IEP8_POS  (13U)
#define USB_TX_NUM_HBW_IEP8_LEN  (2U)
#define USB_TX_NUM_HBW_IEP8_MSK  (((1U << USB_TX_NUM_HBW_IEP8_LEN) - 1) << USB_TX_NUM_HBW_IEP8_POS)
#define USB_TX_NUM_HBW_IEP8_UMSK (~(((1U << USB_TX_NUM_HBW_IEP8_LEN) - 1) << USB_TX_NUM_HBW_IEP8_POS))
#define USB_TX0BYTE_IEP8         USB_TX0BYTE_IEP8
#define USB_TX0BYTE_IEP8_POS     (15U)
#define USB_TX0BYTE_IEP8_LEN     (1U)
#define USB_TX0BYTE_IEP8_MSK     (((1U << USB_TX0BYTE_IEP8_LEN) - 1) << USB_TX0BYTE_IEP8_POS)
#define USB_TX0BYTE_IEP8_UMSK    (~(((1U << USB_TX0BYTE_IEP8_LEN) - 1) << USB_TX0BYTE_IEP8_POS))

/* 0x180 : DEV_OUTMPS1 */
#define USB_DEV_OUTMPS1_OFFSET (0x180)
#define USB_MAXPS_OEP1         USB_MAXPS_OEP1
#define USB_MAXPS_OEP1_POS     (0U)
#define USB_MAXPS_OEP1_LEN     (11U)
#define USB_MAXPS_OEP1_MSK     (((1U << USB_MAXPS_OEP1_LEN) - 1) << USB_MAXPS_OEP1_POS)
#define USB_MAXPS_OEP1_UMSK    (~(((1U << USB_MAXPS_OEP1_LEN) - 1) << USB_MAXPS_OEP1_POS))
#define USB_STL_OEP1           USB_STL_OEP1
#define USB_STL_OEP1_POS       (11U)
#define USB_STL_OEP1_LEN       (1U)
#define USB_STL_OEP1_MSK       (((1U << USB_STL_OEP1_LEN) - 1) << USB_STL_OEP1_POS)
#define USB_STL_OEP1_UMSK      (~(((1U << USB_STL_OEP1_LEN) - 1) << USB_STL_OEP1_POS))
#define USB_RSTG_OEP1          USB_RSTG_OEP1
#define USB_RSTG_OEP1_POS      (12U)
#define USB_RSTG_OEP1_LEN      (1U)
#define USB_RSTG_OEP1_MSK      (((1U << USB_RSTG_OEP1_LEN) - 1) << USB_RSTG_OEP1_POS)
#define USB_RSTG_OEP1_UMSK     (~(((1U << USB_RSTG_OEP1_LEN) - 1) << USB_RSTG_OEP1_POS))

/* 0x184 : DEV_OUTMPS2 */
#define USB_DEV_OUTMPS2_OFFSET (0x184)
#define USB_MAXPS_OEP2         USB_MAXPS_OEP2
#define USB_MAXPS_OEP2_POS     (0U)
#define USB_MAXPS_OEP2_LEN     (11U)
#define USB_MAXPS_OEP2_MSK     (((1U << USB_MAXPS_OEP2_LEN) - 1) << USB_MAXPS_OEP2_POS)
#define USB_MAXPS_OEP2_UMSK    (~(((1U << USB_MAXPS_OEP2_LEN) - 1) << USB_MAXPS_OEP2_POS))
#define USB_STL_OEP2           USB_STL_OEP2
#define USB_STL_OEP2_POS       (11U)
#define USB_STL_OEP2_LEN       (1U)
#define USB_STL_OEP2_MSK       (((1U << USB_STL_OEP2_LEN) - 1) << USB_STL_OEP2_POS)
#define USB_STL_OEP2_UMSK      (~(((1U << USB_STL_OEP2_LEN) - 1) << USB_STL_OEP2_POS))
#define USB_RSTG_OEP2          USB_RSTG_OEP2
#define USB_RSTG_OEP2_POS      (12U)
#define USB_RSTG_OEP2_LEN      (1U)
#define USB_RSTG_OEP2_MSK      (((1U << USB_RSTG_OEP2_LEN) - 1) << USB_RSTG_OEP2_POS)
#define USB_RSTG_OEP2_UMSK     (~(((1U << USB_RSTG_OEP2_LEN) - 1) << USB_RSTG_OEP2_POS))

/* 0x188 : DEV_OUTMPS3 */
#define USB_DEV_OUTMPS3_OFFSET (0x188)
#define USB_MAXPS_OEP3         USB_MAXPS_OEP3
#define USB_MAXPS_OEP3_POS     (0U)
#define USB_MAXPS_OEP3_LEN     (11U)
#define USB_MAXPS_OEP3_MSK     (((1U << USB_MAXPS_OEP3_LEN) - 1) << USB_MAXPS_OEP3_POS)
#define USB_MAXPS_OEP3_UMSK    (~(((1U << USB_MAXPS_OEP3_LEN) - 1) << USB_MAXPS_OEP3_POS))
#define USB_STL_OEP3           USB_STL_OEP3
#define USB_STL_OEP3_POS       (11U)
#define USB_STL_OEP3_LEN       (1U)
#define USB_STL_OEP3_MSK       (((1U << USB_STL_OEP3_LEN) - 1) << USB_STL_OEP3_POS)
#define USB_STL_OEP3_UMSK      (~(((1U << USB_STL_OEP3_LEN) - 1) << USB_STL_OEP3_POS))
#define USB_RSTG_OEP3          USB_RSTG_OEP3
#define USB_RSTG_OEP3_POS      (12U)
#define USB_RSTG_OEP3_LEN      (1U)
#define USB_RSTG_OEP3_MSK      (((1U << USB_RSTG_OEP3_LEN) - 1) << USB_RSTG_OEP3_POS)
#define USB_RSTG_OEP3_UMSK     (~(((1U << USB_RSTG_OEP3_LEN) - 1) << USB_RSTG_OEP3_POS))

/* 0x18C : DEV_OUTMPS4 */
#define USB_DEV_OUTMPS4_OFFSET (0x18C)
#define USB_MAXPS_OEP4         USB_MAXPS_OEP4
#define USB_MAXPS_OEP4_POS     (0U)
#define USB_MAXPS_OEP4_LEN     (11U)
#define USB_MAXPS_OEP4_MSK     (((1U << USB_MAXPS_OEP4_LEN) - 1) << USB_MAXPS_OEP4_POS)
#define USB_MAXPS_OEP4_UMSK    (~(((1U << USB_MAXPS_OEP4_LEN) - 1) << USB_MAXPS_OEP4_POS))
#define USB_STL_OEP4           USB_STL_OEP4
#define USB_STL_OEP4_POS       (11U)
#define USB_STL_OEP4_LEN       (1U)
#define USB_STL_OEP4_MSK       (((1U << USB_STL_OEP4_LEN) - 1) << USB_STL_OEP4_POS)
#define USB_STL_OEP4_UMSK      (~(((1U << USB_STL_OEP4_LEN) - 1) << USB_STL_OEP4_POS))
#define USB_RSTG_OEP4          USB_RSTG_OEP4
#define USB_RSTG_OEP4_POS      (12U)
#define USB_RSTG_OEP4_LEN      (1U)
#define USB_RSTG_OEP4_MSK      (((1U << USB_RSTG_OEP4_LEN) - 1) << USB_RSTG_OEP4_POS)
#define USB_RSTG_OEP4_UMSK     (~(((1U << USB_RSTG_OEP4_LEN) - 1) << USB_RSTG_OEP4_POS))

/* 0x190 : DEV_OUTMPS5 */
#define USB_DEV_OUTMPS5_OFFSET (0x190)
#define USB_MAXPS_OEP5         USB_MAXPS_OEP5
#define USB_MAXPS_OEP5_POS     (0U)
#define USB_MAXPS_OEP5_LEN     (11U)
#define USB_MAXPS_OEP5_MSK     (((1U << USB_MAXPS_OEP5_LEN) - 1) << USB_MAXPS_OEP5_POS)
#define USB_MAXPS_OEP5_UMSK    (~(((1U << USB_MAXPS_OEP5_LEN) - 1) << USB_MAXPS_OEP5_POS))
#define USB_STL_OEP5           USB_STL_OEP5
#define USB_STL_OEP5_POS       (11U)
#define USB_STL_OEP5_LEN       (1U)
#define USB_STL_OEP5_MSK       (((1U << USB_STL_OEP5_LEN) - 1) << USB_STL_OEP5_POS)
#define USB_STL_OEP5_UMSK      (~(((1U << USB_STL_OEP5_LEN) - 1) << USB_STL_OEP5_POS))
#define USB_RSTG_OEP5          USB_RSTG_OEP5
#define USB_RSTG_OEP5_POS      (12U)
#define USB_RSTG_OEP5_LEN      (1U)
#define USB_RSTG_OEP5_MSK      (((1U << USB_RSTG_OEP5_LEN) - 1) << USB_RSTG_OEP5_POS)
#define USB_RSTG_OEP5_UMSK     (~(((1U << USB_RSTG_OEP5_LEN) - 1) << USB_RSTG_OEP5_POS))

/* 0x194 : DEV_OUTMPS6 */
#define USB_DEV_OUTMPS6_OFFSET (0x194)
#define USB_MAXPS_OEP6         USB_MAXPS_OEP6
#define USB_MAXPS_OEP6_POS     (0U)
#define USB_MAXPS_OEP6_LEN     (11U)
#define USB_MAXPS_OEP6_MSK     (((1U << USB_MAXPS_OEP6_LEN) - 1) << USB_MAXPS_OEP6_POS)
#define USB_MAXPS_OEP6_UMSK    (~(((1U << USB_MAXPS_OEP6_LEN) - 1) << USB_MAXPS_OEP6_POS))
#define USB_STL_OEP6           USB_STL_OEP6
#define USB_STL_OEP6_POS       (11U)
#define USB_STL_OEP6_LEN       (1U)
#define USB_STL_OEP6_MSK       (((1U << USB_STL_OEP6_LEN) - 1) << USB_STL_OEP6_POS)
#define USB_STL_OEP6_UMSK      (~(((1U << USB_STL_OEP6_LEN) - 1) << USB_STL_OEP6_POS))
#define USB_RSTG_OEP6          USB_RSTG_OEP6
#define USB_RSTG_OEP6_POS      (12U)
#define USB_RSTG_OEP6_LEN      (1U)
#define USB_RSTG_OEP6_MSK      (((1U << USB_RSTG_OEP6_LEN) - 1) << USB_RSTG_OEP6_POS)
#define USB_RSTG_OEP6_UMSK     (~(((1U << USB_RSTG_OEP6_LEN) - 1) << USB_RSTG_OEP6_POS))

/* 0x198 : DEV_OUTMPS7 */
#define USB_DEV_OUTMPS7_OFFSET (0x198)
#define USB_MAXPS_OEP7         USB_MAXPS_OEP7
#define USB_MAXPS_OEP7_POS     (0U)
#define USB_MAXPS_OEP7_LEN     (11U)
#define USB_MAXPS_OEP7_MSK     (((1U << USB_MAXPS_OEP7_LEN) - 1) << USB_MAXPS_OEP7_POS)
#define USB_MAXPS_OEP7_UMSK    (~(((1U << USB_MAXPS_OEP7_LEN) - 1) << USB_MAXPS_OEP7_POS))
#define USB_STL_OEP7           USB_STL_OEP7
#define USB_STL_OEP7_POS       (11U)
#define USB_STL_OEP7_LEN       (1U)
#define USB_STL_OEP7_MSK       (((1U << USB_STL_OEP7_LEN) - 1) << USB_STL_OEP7_POS)
#define USB_STL_OEP7_UMSK      (~(((1U << USB_STL_OEP7_LEN) - 1) << USB_STL_OEP7_POS))
#define USB_RSTG_OEP7          USB_RSTG_OEP7
#define USB_RSTG_OEP7_POS      (12U)
#define USB_RSTG_OEP7_LEN      (1U)
#define USB_RSTG_OEP7_MSK      (((1U << USB_RSTG_OEP7_LEN) - 1) << USB_RSTG_OEP7_POS)
#define USB_RSTG_OEP7_UMSK     (~(((1U << USB_RSTG_OEP7_LEN) - 1) << USB_RSTG_OEP7_POS))

/* 0x19C : DEV_OUTMPS8 */
#define USB_DEV_OUTMPS8_OFFSET (0x19C)
#define USB_MAXPS_OEP8         USB_MAXPS_OEP8
#define USB_MAXPS_OEP8_POS     (0U)
#define USB_MAXPS_OEP8_LEN     (11U)
#define USB_MAXPS_OEP8_MSK     (((1U << USB_MAXPS_OEP8_LEN) - 1) << USB_MAXPS_OEP8_POS)
#define USB_MAXPS_OEP8_UMSK    (~(((1U << USB_MAXPS_OEP8_LEN) - 1) << USB_MAXPS_OEP8_POS))
#define USB_STL_OEP8           USB_STL_OEP8
#define USB_STL_OEP8_POS       (11U)
#define USB_STL_OEP8_LEN       (1U)
#define USB_STL_OEP8_MSK       (((1U << USB_STL_OEP8_LEN) - 1) << USB_STL_OEP8_POS)
#define USB_STL_OEP8_UMSK      (~(((1U << USB_STL_OEP8_LEN) - 1) << USB_STL_OEP8_POS))
#define USB_RSTG_OEP8          USB_RSTG_OEP8
#define USB_RSTG_OEP8_POS      (12U)
#define USB_RSTG_OEP8_LEN      (1U)
#define USB_RSTG_OEP8_MSK      (((1U << USB_RSTG_OEP8_LEN) - 1) << USB_RSTG_OEP8_POS)
#define USB_RSTG_OEP8_UMSK     (~(((1U << USB_RSTG_OEP8_LEN) - 1) << USB_RSTG_OEP8_POS))

/* 0x1A0 : DEV_EPMAP0 */
#define USB_DEV_EPMAP0_OFFSET (0x1A0)
#define USB_FNO_IEP1          USB_FNO_IEP1
#define USB_FNO_IEP1_POS      (0U)
#define USB_FNO_IEP1_LEN      (4U)
#define USB_FNO_IEP1_MSK      (((1U << USB_FNO_IEP1_LEN) - 1) << USB_FNO_IEP1_POS)
#define USB_FNO_IEP1_UMSK     (~(((1U << USB_FNO_IEP1_LEN) - 1) << USB_FNO_IEP1_POS))
#define USB_FNO_OEP1          USB_FNO_OEP1
#define USB_FNO_OEP1_POS      (4U)
#define USB_FNO_OEP1_LEN      (4U)
#define USB_FNO_OEP1_MSK      (((1U << USB_FNO_OEP1_LEN) - 1) << USB_FNO_OEP1_POS)
#define USB_FNO_OEP1_UMSK     (~(((1U << USB_FNO_OEP1_LEN) - 1) << USB_FNO_OEP1_POS))
#define USB_FNO_IEP2          USB_FNO_IEP2
#define USB_FNO_IEP2_POS      (8U)
#define USB_FNO_IEP2_LEN      (4U)
#define USB_FNO_IEP2_MSK      (((1U << USB_FNO_IEP2_LEN) - 1) << USB_FNO_IEP2_POS)
#define USB_FNO_IEP2_UMSK     (~(((1U << USB_FNO_IEP2_LEN) - 1) << USB_FNO_IEP2_POS))
#define USB_FNO_OEP2          USB_FNO_OEP2
#define USB_FNO_OEP2_POS      (12U)
#define USB_FNO_OEP2_LEN      (4U)
#define USB_FNO_OEP2_MSK      (((1U << USB_FNO_OEP2_LEN) - 1) << USB_FNO_OEP2_POS)
#define USB_FNO_OEP2_UMSK     (~(((1U << USB_FNO_OEP2_LEN) - 1) << USB_FNO_OEP2_POS))
#define USB_FNO_IEP3          USB_FNO_IEP3
#define USB_FNO_IEP3_POS      (16U)
#define USB_FNO_IEP3_LEN      (4U)
#define USB_FNO_IEP3_MSK      (((1U << USB_FNO_IEP3_LEN) - 1) << USB_FNO_IEP3_POS)
#define USB_FNO_IEP3_UMSK     (~(((1U << USB_FNO_IEP3_LEN) - 1) << USB_FNO_IEP3_POS))
#define USB_FNO_OEP3          USB_FNO_OEP3
#define USB_FNO_OEP3_POS      (20U)
#define USB_FNO_OEP3_LEN      (4U)
#define USB_FNO_OEP3_MSK      (((1U << USB_FNO_OEP3_LEN) - 1) << USB_FNO_OEP3_POS)
#define USB_FNO_OEP3_UMSK     (~(((1U << USB_FNO_OEP3_LEN) - 1) << USB_FNO_OEP3_POS))
#define USB_FNO_IEP4          USB_FNO_IEP4
#define USB_FNO_IEP4_POS      (24U)
#define USB_FNO_IEP4_LEN      (4U)
#define USB_FNO_IEP4_MSK      (((1U << USB_FNO_IEP4_LEN) - 1) << USB_FNO_IEP4_POS)
#define USB_FNO_IEP4_UMSK     (~(((1U << USB_FNO_IEP4_LEN) - 1) << USB_FNO_IEP4_POS))
#define USB_FNO_OEP4          USB_FNO_OEP4
#define USB_FNO_OEP4_POS      (28U)
#define USB_FNO_OEP4_LEN      (4U)
#define USB_FNO_OEP4_MSK      (((1U << USB_FNO_OEP4_LEN) - 1) << USB_FNO_OEP4_POS)
#define USB_FNO_OEP4_UMSK     (~(((1U << USB_FNO_OEP4_LEN) - 1) << USB_FNO_OEP4_POS))

/* 0x1A4 : DEV_EPMAP1 */
#define USB_DEV_EPMAP1_OFFSET (0x1A4)
#define USB_FNO_IEP5          USB_FNO_IEP5
#define USB_FNO_IEP5_POS      (0U)
#define USB_FNO_IEP5_LEN      (4U)
#define USB_FNO_IEP5_MSK      (((1U << USB_FNO_IEP5_LEN) - 1) << USB_FNO_IEP5_POS)
#define USB_FNO_IEP5_UMSK     (~(((1U << USB_FNO_IEP5_LEN) - 1) << USB_FNO_IEP5_POS))
#define USB_FNO_OEP5          USB_FNO_OEP5
#define USB_FNO_OEP5_POS      (4U)
#define USB_FNO_OEP5_LEN      (4U)
#define USB_FNO_OEP5_MSK      (((1U << USB_FNO_OEP5_LEN) - 1) << USB_FNO_OEP5_POS)
#define USB_FNO_OEP5_UMSK     (~(((1U << USB_FNO_OEP5_LEN) - 1) << USB_FNO_OEP5_POS))
#define USB_FNO_IEP6          USB_FNO_IEP6
#define USB_FNO_IEP6_POS      (8U)
#define USB_FNO_IEP6_LEN      (4U)
#define USB_FNO_IEP6_MSK      (((1U << USB_FNO_IEP6_LEN) - 1) << USB_FNO_IEP6_POS)
#define USB_FNO_IEP6_UMSK     (~(((1U << USB_FNO_IEP6_LEN) - 1) << USB_FNO_IEP6_POS))
#define USB_FNO_OEP6          USB_FNO_OEP6
#define USB_FNO_OEP6_POS      (12U)
#define USB_FNO_OEP6_LEN      (4U)
#define USB_FNO_OEP6_MSK      (((1U << USB_FNO_OEP6_LEN) - 1) << USB_FNO_OEP6_POS)
#define USB_FNO_OEP6_UMSK     (~(((1U << USB_FNO_OEP6_LEN) - 1) << USB_FNO_OEP6_POS))
#define USB_FNO_IEP7          USB_FNO_IEP7
#define USB_FNO_IEP7_POS      (16U)
#define USB_FNO_IEP7_LEN      (4U)
#define USB_FNO_IEP7_MSK      (((1U << USB_FNO_IEP7_LEN) - 1) << USB_FNO_IEP7_POS)
#define USB_FNO_IEP7_UMSK     (~(((1U << USB_FNO_IEP7_LEN) - 1) << USB_FNO_IEP7_POS))
#define USB_FNO_OEP7          USB_FNO_OEP7
#define USB_FNO_OEP7_POS      (20U)
#define USB_FNO_OEP7_LEN      (4U)
#define USB_FNO_OEP7_MSK      (((1U << USB_FNO_OEP7_LEN) - 1) << USB_FNO_OEP7_POS)
#define USB_FNO_OEP7_UMSK     (~(((1U << USB_FNO_OEP7_LEN) - 1) << USB_FNO_OEP7_POS))
#define USB_FNO_IEP8          USB_FNO_IEP8
#define USB_FNO_IEP8_POS      (24U)
#define USB_FNO_IEP8_LEN      (4U)
#define USB_FNO_IEP8_MSK      (((1U << USB_FNO_IEP8_LEN) - 1) << USB_FNO_IEP8_POS)
#define USB_FNO_IEP8_UMSK     (~(((1U << USB_FNO_IEP8_LEN) - 1) << USB_FNO_IEP8_POS))
#define USB_FNO_OEP8          USB_FNO_OEP8
#define USB_FNO_OEP8_POS      (28U)
#define USB_FNO_OEP8_LEN      (4U)
#define USB_FNO_OEP8_MSK      (((1U << USB_FNO_OEP8_LEN) - 1) << USB_FNO_OEP8_POS)
#define USB_FNO_OEP8_UMSK     (~(((1U << USB_FNO_OEP8_LEN) - 1) << USB_FNO_OEP8_POS))

/* 0x1A8 : DEV_FMAP */
#define USB_DEV_FMAP_OFFSET (0x1A8)
#define USB_EPNO_FIFO0      USB_EPNO_FIFO0
#define USB_EPNO_FIFO0_POS  (0U)
#define USB_EPNO_FIFO0_LEN  (4U)
#define USB_EPNO_FIFO0_MSK  (((1U << USB_EPNO_FIFO0_LEN) - 1) << USB_EPNO_FIFO0_POS)
#define USB_EPNO_FIFO0_UMSK (~(((1U << USB_EPNO_FIFO0_LEN) - 1) << USB_EPNO_FIFO0_POS))
#define USB_DIR_FIFO0       USB_DIR_FIFO0
#define USB_DIR_FIFO0_POS   (4U)
#define USB_DIR_FIFO0_LEN   (2U)
#define USB_DIR_FIFO0_MSK   (((1U << USB_DIR_FIFO0_LEN) - 1) << USB_DIR_FIFO0_POS)
#define USB_DIR_FIFO0_UMSK  (~(((1U << USB_DIR_FIFO0_LEN) - 1) << USB_DIR_FIFO0_POS))
#define USB_EPNO_FIFO1      USB_EPNO_FIFO1
#define USB_EPNO_FIFO1_POS  (8U)
#define USB_EPNO_FIFO1_LEN  (4U)
#define USB_EPNO_FIFO1_MSK  (((1U << USB_EPNO_FIFO1_LEN) - 1) << USB_EPNO_FIFO1_POS)
#define USB_EPNO_FIFO1_UMSK (~(((1U << USB_EPNO_FIFO1_LEN) - 1) << USB_EPNO_FIFO1_POS))
#define USB_DIR_FIFO1       USB_DIR_FIFO1
#define USB_DIR_FIFO1_POS   (12U)
#define USB_DIR_FIFO1_LEN   (2U)
#define USB_DIR_FIFO1_MSK   (((1U << USB_DIR_FIFO1_LEN) - 1) << USB_DIR_FIFO1_POS)
#define USB_DIR_FIFO1_UMSK  (~(((1U << USB_DIR_FIFO1_LEN) - 1) << USB_DIR_FIFO1_POS))
#define USB_EPNO_FIFO2      USB_EPNO_FIFO2
#define USB_EPNO_FIFO2_POS  (16U)
#define USB_EPNO_FIFO2_LEN  (4U)
#define USB_EPNO_FIFO2_MSK  (((1U << USB_EPNO_FIFO2_LEN) - 1) << USB_EPNO_FIFO2_POS)
#define USB_EPNO_FIFO2_UMSK (~(((1U << USB_EPNO_FIFO2_LEN) - 1) << USB_EPNO_FIFO2_POS))
#define USB_DIR_FIFO2       USB_DIR_FIFO2
#define USB_DIR_FIFO2_POS   (20U)
#define USB_DIR_FIFO2_LEN   (2U)
#define USB_DIR_FIFO2_MSK   (((1U << USB_DIR_FIFO2_LEN) - 1) << USB_DIR_FIFO2_POS)
#define USB_DIR_FIFO2_UMSK  (~(((1U << USB_DIR_FIFO2_LEN) - 1) << USB_DIR_FIFO2_POS))
#define USB_EPNO_FIFO3      USB_EPNO_FIFO3
#define USB_EPNO_FIFO3_POS  (24U)
#define USB_EPNO_FIFO3_LEN  (4U)
#define USB_EPNO_FIFO3_MSK  (((1U << USB_EPNO_FIFO3_LEN) - 1) << USB_EPNO_FIFO3_POS)
#define USB_EPNO_FIFO3_UMSK (~(((1U << USB_EPNO_FIFO3_LEN) - 1) << USB_EPNO_FIFO3_POS))
#define USB_DIR_FIFO3       USB_DIR_FIFO3
#define USB_DIR_FIFO3_POS   (28U)
#define USB_DIR_FIFO3_LEN   (2U)
#define USB_DIR_FIFO3_MSK   (((1U << USB_DIR_FIFO3_LEN) - 1) << USB_DIR_FIFO3_POS)
#define USB_DIR_FIFO3_UMSK  (~(((1U << USB_DIR_FIFO3_LEN) - 1) << USB_DIR_FIFO3_POS))

