XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/usb_reg.h
/* 0x1AC : DEV_FCFG */
#define USB_DEV_FCFG_OFFSET (0x1AC)
#define USB_BLK_TYP_F0      USB_BLK_TYP_F0
#define USB_BLK_TYP_F0_POS  (0U)
#define USB_BLK_TYP_F0_LEN  (2U)
#define USB_BLK_TYP_F0_MSK  (((1U << USB_BLK_TYP_F0_LEN) - 1) << USB_BLK_TYP_F0_POS)
#define USB_BLK_TYP_F0_UMSK (~(((1U << USB_BLK_TYP_F0_LEN) - 1) << USB_BLK_TYP_F0_POS))
#define USB_BLKNO_F0        USB_BLKNO_F0
#define USB_BLKNO_F0_POS    (2U)
#define USB_BLKNO_F0_LEN    (2U)
#define USB_BLKNO_F0_MSK    (((1U << USB_BLKNO_F0_LEN) - 1) << USB_BLKNO_F0_POS)
#define USB_BLKNO_F0_UMSK   (~(((1U << USB_BLKNO_F0_LEN) - 1) << USB_BLKNO_F0_POS))
#define USB_BLKSZ_F0        USB_BLKSZ_F0
#define USB_BLKSZ_F0_POS    (4U)
#define USB_BLKSZ_F0_LEN    (1U)
#define USB_BLKSZ_F0_MSK    (((1U << USB_BLKSZ_F0_LEN) - 1) << USB_BLKSZ_F0_POS)
#define USB_BLKSZ_F0_UMSK   (~(((1U << USB_BLKSZ_F0_LEN) - 1) << USB_BLKSZ_F0_POS))
#define USB_EN_F0           USB_EN_F0
#define USB_EN_F0_POS       (5U)
#define USB_EN_F0_LEN       (1U)
#define USB_EN_F0_MSK       (((1U << USB_EN_F0_LEN) - 1) << USB_EN_F0_POS)
#define USB_EN_F0_UMSK      (~(((1U << USB_EN_F0_LEN) - 1) << USB_EN_F0_POS))
#define USB_BLK_TYP_F1      USB_BLK_TYP_F1
#define USB_BLK_TYP_F1_POS  (8U)
#define USB_BLK_TYP_F1_LEN  (2U)
#define USB_BLK_TYP_F1_MSK  (((1U << USB_BLK_TYP_F1_LEN) - 1) << USB_BLK_TYP_F1_POS)
#define USB_BLK_TYP_F1_UMSK (~(((1U << USB_BLK_TYP_F1_LEN) - 1) << USB_BLK_TYP_F1_POS))
#define USB_BLKNO_F1        USB_BLKNO_F1
#define USB_BLKNO_F1_POS    (10U)
#define USB_BLKNO_F1_LEN    (2U)
#define USB_BLKNO_F1_MSK    (((1U << USB_BLKNO_F1_LEN) - 1) << USB_BLKNO_F1_POS)
#define USB_BLKNO_F1_UMSK   (~(((1U << USB_BLKNO_F1_LEN) - 1) << USB_BLKNO_F1_POS))
#define USB_BLKSZ_F1        USB_BLKSZ_F1
#define USB_BLKSZ_F1_POS    (12U)
#define USB_BLKSZ_F1_LEN    (1U)
#define USB_BLKSZ_F1_MSK    (((1U << USB_BLKSZ_F1_LEN) - 1) << USB_BLKSZ_F1_POS)
#define USB_BLKSZ_F1_UMSK   (~(((1U << USB_BLKSZ_F1_LEN) - 1) << USB_BLKSZ_F1_POS))
#define USB_EN_F1           USB_EN_F1
#define USB_EN_F1_POS       (13U)
#define USB_EN_F1_LEN       (1U)
#define USB_EN_F1_MSK       (((1U << USB_EN_F1_LEN) - 1) << USB_EN_F1_POS)
#define USB_EN_F1_UMSK      (~(((1U << USB_EN_F1_LEN) - 1) << USB_EN_F1_POS))
#define USB_BLK_TYP_F2      USB_BLK_TYP_F2
#define USB_BLK_TYP_F2_POS  (16U)
#define USB_BLK_TYP_F2_LEN  (2U)
#define USB_BLK_TYP_F2_MSK  (((1U << USB_BLK_TYP_F2_LEN) - 1) << USB_BLK_TYP_F2_POS)
#define USB_BLK_TYP_F2_UMSK (~(((1U << USB_BLK_TYP_F2_LEN) - 1) << USB_BLK_TYP_F2_POS))
#define USB_BLKNO_F2        USB_BLKNO_F2
#define USB_BLKNO_F2_POS    (18U)
#define USB_BLKNO_F2_LEN    (2U)
#define USB_BLKNO_F2_MSK    (((1U << USB_BLKNO_F2_LEN) - 1) << USB_BLKNO_F2_POS)
#define USB_BLKNO_F2_UMSK   (~(((1U << USB_BLKNO_F2_LEN) - 1) << USB_BLKNO_F2_POS))
#define USB_BLKSZ_F2        USB_BLKSZ_F2
#define USB_BLKSZ_F2_POS    (20U)
#define USB_BLKSZ_F2_LEN    (1U)
#define USB_BLKSZ_F2_MSK    (((1U << USB_BLKSZ_F2_LEN) - 1) << USB_BLKSZ_F2_POS)
#define USB_BLKSZ_F2_UMSK   (~(((1U << USB_BLKSZ_F2_LEN) - 1) << USB_BLKSZ_F2_POS))
#define USB_EN_F2           USB_EN_F2
#define USB_EN_F2_POS       (21U)
#define USB_EN_F2_LEN       (1U)
#define USB_EN_F2_MSK       (((1U << USB_EN_F2_LEN) - 1) << USB_EN_F2_POS)
#define USB_EN_F2_UMSK      (~(((1U << USB_EN_F2_LEN) - 1) << USB_EN_F2_POS))
#define USB_BLK_TYP_F3      USB_BLK_TYP_F3
#define USB_BLK_TYP_F3_POS  (24U)
#define USB_BLK_TYP_F3_LEN  (2U)
#define USB_BLK_TYP_F3_MSK  (((1U << USB_BLK_TYP_F3_LEN) - 1) << USB_BLK_TYP_F3_POS)
#define USB_BLK_TYP_F3_UMSK (~(((1U << USB_BLK_TYP_F3_LEN) - 1) << USB_BLK_TYP_F3_POS))
#define USB_BLKNO_F3        USB_BLKNO_F3
#define USB_BLKNO_F3_POS    (26U)
#define USB_BLKNO_F3_LEN    (2U)
#define USB_BLKNO_F3_MSK    (((1U << USB_BLKNO_F3_LEN) - 1) << USB_BLKNO_F3_POS)
#define USB_BLKNO_F3_UMSK   (~(((1U << USB_BLKNO_F3_LEN) - 1) << USB_BLKNO_F3_POS))
#define USB_BLKSZ_F3        USB_BLKSZ_F3
#define USB_BLKSZ_F3_POS    (28U)
#define USB_BLKSZ_F3_LEN    (1U)
#define USB_BLKSZ_F3_MSK    (((1U << USB_BLKSZ_F3_LEN) - 1) << USB_BLKSZ_F3_POS)
#define USB_BLKSZ_F3_UMSK   (~(((1U << USB_BLKSZ_F3_LEN) - 1) << USB_BLKSZ_F3_POS))
#define USB_EN_F3           USB_EN_F3
#define USB_EN_F3_POS       (29U)
#define USB_EN_F3_LEN       (1U)
#define USB_EN_F3_MSK       (((1U << USB_EN_F3_LEN) - 1) << USB_EN_F3_POS)
#define USB_EN_F3_UMSK      (~(((1U << USB_EN_F3_LEN) - 1) << USB_EN_F3_POS))

/* 0x1B0 : DEV_FIBC0 */
#define USB_DEV_FIBC0_OFFSET (0x1B0)
#define USB_BC_F0            USB_BC_F0
#define USB_BC_F0_POS        (0U)
#define USB_BC_F0_LEN        (11U)
#define USB_BC_F0_MSK        (((1U << USB_BC_F0_LEN) - 1) << USB_BC_F0_POS)
#define USB_BC_F0_UMSK       (~(((1U << USB_BC_F0_LEN) - 1) << USB_BC_F0_POS))
#define USB_FFRST0_HOV       USB_FFRST0_HOV
#define USB_FFRST0_HOV_POS   (12U)
#define USB_FFRST0_HOV_LEN   (1U)
#define USB_FFRST0_HOV_MSK   (((1U << USB_FFRST0_HOV_LEN) - 1) << USB_FFRST0_HOV_POS)
#define USB_FFRST0_HOV_UMSK  (~(((1U << USB_FFRST0_HOV_LEN) - 1) << USB_FFRST0_HOV_POS))

/* 0x1B4 : DEV_FIBC1 */
#define USB_DEV_FIBC1_OFFSET (0x1B4)
#define USB_BC_F1            USB_BC_F1
#define USB_BC_F1_POS        (0U)
#define USB_BC_F1_LEN        (11U)
#define USB_BC_F1_MSK        (((1U << USB_BC_F1_LEN) - 1) << USB_BC_F1_POS)
#define USB_BC_F1_UMSK       (~(((1U << USB_BC_F1_LEN) - 1) << USB_BC_F1_POS))
#define USB_FFRST1_HOV       USB_FFRST1_HOV
#define USB_FFRST1_HOV_POS   (12U)
#define USB_FFRST1_HOV_LEN   (1U)
#define USB_FFRST1_HOV_MSK   (((1U << USB_FFRST1_HOV_LEN) - 1) << USB_FFRST1_HOV_POS)
#define USB_FFRST1_HOV_UMSK  (~(((1U << USB_FFRST1_HOV_LEN) - 1) << USB_FFRST1_HOV_POS))

/* 0x1B8 : DEV_FIBC2 */
#define USB_DEV_FIBC2_OFFSET (0x1B8)
#define USB_BC_F2            USB_BC_F2
#define USB_BC_F2_POS        (0U)
#define USB_BC_F2_LEN        (11U)
#define USB_BC_F2_MSK        (((1U << USB_BC_F2_LEN) - 1) << USB_BC_F2_POS)
#define USB_BC_F2_UMSK       (~(((1U << USB_BC_F2_LEN) - 1) << USB_BC_F2_POS))
#define USB_FFRST2_HOV       USB_FFRST2_HOV
#define USB_FFRST2_HOV_POS   (12U)
#define USB_FFRST2_HOV_LEN   (1U)
#define USB_FFRST2_HOV_MSK   (((1U << USB_FFRST2_HOV_LEN) - 1) << USB_FFRST2_HOV_POS)
#define USB_FFRST2_HOV_UMSK  (~(((1U << USB_FFRST2_HOV_LEN) - 1) << USB_FFRST2_HOV_POS))

/* 0x1BC : DEV_FIBC3 */
#define USB_DEV_FIBC3_OFFSET (0x1BC)
#define USB_BC_F3            USB_BC_F3
#define USB_BC_F3_POS        (0U)
#define USB_BC_F3_LEN        (11U)
#define USB_BC_F3_MSK        (((1U << USB_BC_F3_LEN) - 1) << USB_BC_F3_POS)
#define USB_BC_F3_UMSK       (~(((1U << USB_BC_F3_LEN) - 1) << USB_BC_F3_POS))
#define USB_FFRST3_HOV       USB_FFRST3_HOV
#define USB_FFRST3_HOV_POS   (12U)
#define USB_FFRST3_HOV_LEN   (1U)
#define USB_FFRST3_HOV_MSK   (((1U << USB_FFRST3_HOV_LEN) - 1) << USB_FFRST3_HOV_POS)
#define USB_FFRST3_HOV_UMSK  (~(((1U << USB_FFRST3_HOV_LEN) - 1) << USB_FFRST3_HOV_POS))

