XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/usb_reg.h
/* 0x1EC : DEV_FCFG4 */
#define USB_DEV_FCFG4_OFFSET (0x1EC)
#define USB_BLK_TYP_F12      USB_BLK_TYP_F12
#define USB_BLK_TYP_F12_POS  (0U)
#define USB_BLK_TYP_F12_LEN  (2U)
#define USB_BLK_TYP_F12_MSK  (((1U << USB_BLK_TYP_F12_LEN) - 1) << USB_BLK_TYP_F12_POS)
#define USB_BLK_TYP_F12_UMSK (~(((1U << USB_BLK_TYP_F12_LEN) - 1) << USB_BLK_TYP_F12_POS))
#define USB_BLKNO_F12        USB_BLKNO_F12
#define USB_BLKNO_F12_POS    (2U)
#define USB_BLKNO_F12_LEN    (2U)
#define USB_BLKNO_F12_MSK    (((1U << USB_BLKNO_F12_LEN) - 1) << USB_BLKNO_F12_POS)
#define USB_BLKNO_F12_UMSK   (~(((1U << USB_BLKNO_F12_LEN) - 1) << USB_BLKNO_F12_POS))
#define USB_BLKSZ_F12        USB_BLKSZ_F12
#define USB_BLKSZ_F12_POS    (4U)
#define USB_BLKSZ_F12_LEN    (1U)
#define USB_BLKSZ_F12_MSK    (((1U << USB_BLKSZ_F12_LEN) - 1) << USB_BLKSZ_F12_POS)
#define USB_BLKSZ_F12_UMSK   (~(((1U << USB_BLKSZ_F12_LEN) - 1) << USB_BLKSZ_F12_POS))
#define USB_EN_F12           USB_EN_F12
#define USB_EN_F12_POS       (5U)
#define USB_EN_F12_LEN       (1U)
#define USB_EN_F12_MSK       (((1U << USB_EN_F12_LEN) - 1) << USB_EN_F12_POS)
#define USB_EN_F12_UMSK      (~(((1U << USB_EN_F12_LEN) - 1) << USB_EN_F12_POS))
#define USB_BLK_TYP_F13      USB_BLK_TYP_F13
#define USB_BLK_TYP_F13_POS  (8U)
#define USB_BLK_TYP_F13_LEN  (2U)
#define USB_BLK_TYP_F13_MSK  (((1U << USB_BLK_TYP_F13_LEN) - 1) << USB_BLK_TYP_F13_POS)
#define USB_BLK_TYP_F13_UMSK (~(((1U << USB_BLK_TYP_F13_LEN) - 1) << USB_BLK_TYP_F13_POS))
#define USB_BLKNO_F13        USB_BLKNO_F13
#define USB_BLKNO_F13_POS    (10U)
#define USB_BLKNO_F13_LEN    (2U)
#define USB_BLKNO_F13_MSK    (((1U << USB_BLKNO_F13_LEN) - 1) << USB_BLKNO_F13_POS)
#define USB_BLKNO_F13_UMSK   (~(((1U << USB_BLKNO_F13_LEN) - 1) << USB_BLKNO_F13_POS))
#define USB_BLKSZ_F13        USB_BLKSZ_F13
#define USB_BLKSZ_F13_POS    (12U)
#define USB_BLKSZ_F13_LEN    (1U)
#define USB_BLKSZ_F13_MSK    (((1U << USB_BLKSZ_F13_LEN) - 1) << USB_BLKSZ_F13_POS)
#define USB_BLKSZ_F13_UMSK   (~(((1U << USB_BLKSZ_F13_LEN) - 1) << USB_BLKSZ_F13_POS))
#define USB_EN_F13           USB_EN_F13
#define USB_EN_F13_POS       (13U)
#define USB_EN_F13_LEN       (1U)
#define USB_EN_F13_MSK       (((1U << USB_EN_F13_LEN) - 1) << USB_EN_F13_POS)
#define USB_EN_F13_UMSK      (~(((1U << USB_EN_F13_LEN) - 1) << USB_EN_F13_POS))
#define USB_BLK_TYP_F14      USB_BLK_TYP_F14
#define USB_BLK_TYP_F14_POS  (16U)
#define USB_BLK_TYP_F14_LEN  (2U)
#define USB_BLK_TYP_F14_MSK  (((1U << USB_BLK_TYP_F14_LEN) - 1) << USB_BLK_TYP_F14_POS)
#define USB_BLK_TYP_F14_UMSK (~(((1U << USB_BLK_TYP_F14_LEN) - 1) << USB_BLK_TYP_F14_POS))
#define USB_BLKNO_F14        USB_BLKNO_F14
#define USB_BLKNO_F14_POS    (18U)
#define USB_BLKNO_F14_LEN    (2U)
#define USB_BLKNO_F14_MSK    (((1U << USB_BLKNO_F14_LEN) - 1) << USB_BLKNO_F14_POS)
#define USB_BLKNO_F14_UMSK   (~(((1U << USB_BLKNO_F14_LEN) - 1) << USB_BLKNO_F14_POS))
#define USB_BLKSZ_F14        USB_BLKSZ_F14
#define USB_BLKSZ_F14_POS    (20U)
#define USB_BLKSZ_F14_LEN    (1U)
#define USB_BLKSZ_F14_MSK    (((1U << USB_BLKSZ_F14_LEN) - 1) << USB_BLKSZ_F14_POS)
#define USB_BLKSZ_F14_UMSK   (~(((1U << USB_BLKSZ_F14_LEN) - 1) << USB_BLKSZ_F14_POS))
#define USB_EN_F14           USB_EN_F14
#define USB_EN_F14_POS       (21U)
#define USB_EN_F14_LEN       (1U)
#define USB_EN_F14_MSK       (((1U << USB_EN_F14_LEN) - 1) << USB_EN_F14_POS)
#define USB_EN_F14_UMSK      (~(((1U << USB_EN_F14_LEN) - 1) << USB_EN_F14_POS))
#define USB_BLK_TYP_F15      USB_BLK_TYP_F15
#define USB_BLK_TYP_F15_POS  (24U)
#define USB_BLK_TYP_F15_LEN  (2U)
#define USB_BLK_TYP_F15_MSK  (((1U << USB_BLK_TYP_F15_LEN) - 1) << USB_BLK_TYP_F15_POS)
#define USB_BLK_TYP_F15_UMSK (~(((1U << USB_BLK_TYP_F15_LEN) - 1) << USB_BLK_TYP_F15_POS))
#define USB_BLKNO_F15        USB_BLKNO_F15
#define USB_BLKNO_F15_POS    (26U)
#define USB_BLKNO_F15_LEN    (2U)
#define USB_BLKNO_F15_MSK    (((1U << USB_BLKNO_F15_LEN) - 1) << USB_BLKNO_F15_POS)
#define USB_BLKNO_F15_UMSK   (~(((1U << USB_BLKNO_F15_LEN) - 1) << USB_BLKNO_F15_POS))
#define USB_BLKSZ_F15        USB_BLKSZ_F15
#define USB_BLKSZ_F15_POS    (28U)
#define USB_BLKSZ_F15_LEN    (1U)
#define USB_BLKSZ_F15_MSK    (((1U << USB_BLKSZ_F15_LEN) - 1) << USB_BLKSZ_F15_POS)
#define USB_BLKSZ_F15_UMSK   (~(((1U << USB_BLKSZ_F15_LEN) - 1) << USB_BLKSZ_F15_POS))
#define USB_EN_F15           USB_EN_F15
#define USB_EN_F15_POS       (29U)
#define USB_EN_F15_LEN       (1U)
#define USB_EN_F15_MSK       (((1U << USB_EN_F15_LEN) - 1) << USB_EN_F15_POS)
#define USB_EN_F15_UMSK      (~(((1U << USB_EN_F15_LEN) - 1) << USB_EN_F15_POS))

/* 0x1F0 : DEV_FIBC4 */
#define USB_DEV_FIBC4_OFFSET (0x1F0)
#define USB_BC_F4            USB_BC_F4
#define USB_BC_F4_POS        (0U)
#define USB_BC_F4_LEN        (11U)
#define USB_BC_F4_MSK        (((1U << USB_BC_F4_LEN) - 1) << USB_BC_F4_POS)
#define USB_BC_F4_UMSK       (~(((1U << USB_BC_F4_LEN) - 1) << USB_BC_F4_POS))
#define USB_FFRST4_HOV       USB_FFRST4_HOV
#define USB_FFRST4_HOV_POS   (12U)
#define USB_FFRST4_HOV_LEN   (1U)
#define USB_FFRST4_HOV_MSK   (((1U << USB_FFRST4_HOV_LEN) - 1) << USB_FFRST4_HOV_POS)
#define USB_FFRST4_HOV_UMSK  (~(((1U << USB_FFRST4_HOV_LEN) - 1) << USB_FFRST4_HOV_POS))

/* 0x1F4 : DEV_FIBC5 */
#define USB_DEV_FIBC5_OFFSET (0x1F4)
#define USB_BC_F5            USB_BC_F5
#define USB_BC_F5_POS        (0U)
#define USB_BC_F5_LEN        (11U)
#define USB_BC_F5_MSK        (((1U << USB_BC_F5_LEN) - 1) << USB_BC_F5_POS)
#define USB_BC_F5_UMSK       (~(((1U << USB_BC_F5_LEN) - 1) << USB_BC_F5_POS))
#define USB_FFRST5_HOV       USB_FFRST5_HOV
#define USB_FFRST5_HOV_POS   (12U)
#define USB_FFRST5_HOV_LEN   (1U)
#define USB_FFRST5_HOV_MSK   (((1U << USB_FFRST5_HOV_LEN) - 1) << USB_FFRST5_HOV_POS)
#define USB_FFRST5_HOV_UMSK  (~(((1U << USB_FFRST5_HOV_LEN) - 1) << USB_FFRST5_HOV_POS))

/* 0x1F8 : DEV_FIBC6 */
#define USB_DEV_FIBC6_OFFSET (0x1F8)
#define USB_BC_F6            USB_BC_F6
#define USB_BC_F6_POS        (0U)
#define USB_BC_F6_LEN        (11U)
#define USB_BC_F6_MSK        (((1U << USB_BC_F6_LEN) - 1) << USB_BC_F6_POS)
#define USB_BC_F6_UMSK       (~(((1U << USB_BC_F6_LEN) - 1) << USB_BC_F6_POS))
#define USB_FFRST6_HOV       USB_FFRST6_HOV
#define USB_FFRST6_HOV_POS   (12U)
#define USB_FFRST6_HOV_LEN   (1U)
#define USB_FFRST6_HOV_MSK   (((1U << USB_FFRST6_HOV_LEN) - 1) << USB_FFRST6_HOV_POS)
#define USB_FFRST6_HOV_UMSK  (~(((1U << USB_FFRST6_HOV_LEN) - 1) << USB_FFRST6_HOV_POS))

/* 0x1FC : DEV_FIBC7 */
#define USB_DEV_FIBC7_OFFSET (0x1FC)
#define USB_BC_F7            USB_BC_F7
#define USB_BC_F7_POS        (0U)
#define USB_BC_F7_LEN        (11U)
#define USB_BC_F7_MSK        (((1U << USB_BC_F7_LEN) - 1) << USB_BC_F7_POS)
#define USB_BC_F7_UMSK       (~(((1U << USB_BC_F7_LEN) - 1) << USB_BC_F7_POS))
#define USB_FFRST7_HOV       USB_FFRST7_HOV
#define USB_FFRST7_HOV_POS   (12U)
#define USB_FFRST7_HOV_LEN   (1U)
#define USB_FFRST7_HOV_MSK   (((1U << USB_FFRST7_HOV_LEN) - 1) << USB_FFRST7_HOV_POS)
#define USB_FFRST7_HOV_UMSK  (~(((1U << USB_FFRST7_HOV_LEN) - 1) << USB_FFRST7_HOV_POS))

/* 0x300 : VDMA_CXFPS1 */
#define USB_VDMA_CXFPS1_OFFSET  (0x300)
#define USB_VDMA_START_CXF      USB_VDMA_START_CXF
#define USB_VDMA_START_CXF_POS  (0U)
#define USB_VDMA_START_CXF_LEN  (1U)
#define USB_VDMA_START_CXF_MSK  (((1U << USB_VDMA_START_CXF_LEN) - 1) << USB_VDMA_START_CXF_POS)
#define USB_VDMA_START_CXF_UMSK (~(((1U << USB_VDMA_START_CXF_LEN) - 1) << USB_VDMA_START_CXF_POS))
#define USB_VDMA_TYPE_CXF       USB_VDMA_TYPE_CXF
#define USB_VDMA_TYPE_CXF_POS   (1U)
#define USB_VDMA_TYPE_CXF_LEN   (1U)
#define USB_VDMA_TYPE_CXF_MSK   (((1U << USB_VDMA_TYPE_CXF_LEN) - 1) << USB_VDMA_TYPE_CXF_POS)
#define USB_VDMA_TYPE_CXF_UMSK  (~(((1U << USB_VDMA_TYPE_CXF_LEN) - 1) << USB_VDMA_TYPE_CXF_POS))
#define USB_VDMA_IO_CXF         USB_VDMA_IO_CXF
#define USB_VDMA_IO_CXF_POS     (2U)
#define USB_VDMA_IO_CXF_LEN     (1U)
#define USB_VDMA_IO_CXF_MSK     (((1U << USB_VDMA_IO_CXF_LEN) - 1) << USB_VDMA_IO_CXF_POS)
#define USB_VDMA_IO_CXF_UMSK    (~(((1U << USB_VDMA_IO_CXF_LEN) - 1) << USB_VDMA_IO_CXF_POS))
#define USB_VDMA_LEN_CXF        USB_VDMA_LEN_CXF
#define USB_VDMA_LEN_CXF_POS    (8U)
#define USB_VDMA_LEN_CXF_LEN    (17U)
#define USB_VDMA_LEN_CXF_MSK    (((1U << USB_VDMA_LEN_CXF_LEN) - 1) << USB_VDMA_LEN_CXF_POS)
#define USB_VDMA_LEN_CXF_UMSK   (~(((1U << USB_VDMA_LEN_CXF_LEN) - 1) << USB_VDMA_LEN_CXF_POS))

/* 0x304 : None */
#define USB_VDMA_CXFPS2_OFFSET  (0x304)
#define USB_VDMA_MADDR_CXF      USB_VDMA_MADDR_CXF
#define USB_VDMA_MADDR_CXF_POS  (0U)
#define USB_VDMA_MADDR_CXF_LEN  (32U)
#define USB_VDMA_MADDR_CXF_MSK  (((1U << USB_VDMA_MADDR_CXF_LEN) - 1) << USB_VDMA_MADDR_CXF_POS)
#define USB_VDMA_MADDR_CXF_UMSK (~(((1U << USB_VDMA_MADDR_CXF_LEN) - 1) << USB_VDMA_MADDR_CXF_POS))

