XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/usb_reg.h
/* 0x308 : None */
#define USB_VDMA_F0PS1_OFFSET  (0x308)
#define USB_VDMA_START_F0      USB_VDMA_START_F0
#define USB_VDMA_START_F0_POS  (0U)
#define USB_VDMA_START_F0_LEN  (1U)
#define USB_VDMA_START_F0_MSK  (((1U << USB_VDMA_START_F0_LEN) - 1) << USB_VDMA_START_F0_POS)
#define USB_VDMA_START_F0_UMSK (~(((1U << USB_VDMA_START_F0_LEN) - 1) << USB_VDMA_START_F0_POS))
#define USB_VDMA_TYPE_F0       USB_VDMA_TYPE_F0
#define USB_VDMA_TYPE_F0_POS   (1U)
#define USB_VDMA_TYPE_F0_LEN   (1U)
#define USB_VDMA_TYPE_F0_MSK   (((1U << USB_VDMA_TYPE_F0_LEN) - 1) << USB_VDMA_TYPE_F0_POS)
#define USB_VDMA_TYPE_F0_UMSK  (~(((1U << USB_VDMA_TYPE_F0_LEN) - 1) << USB_VDMA_TYPE_F0_POS))
#define USB_VDMA_IO_F0         USB_VDMA_IO_F0
#define USB_VDMA_IO_F0_POS     (2U)
#define USB_VDMA_IO_F0_LEN     (1U)
#define USB_VDMA_IO_F0_MSK     (((1U << USB_VDMA_IO_F0_LEN) - 1) << USB_VDMA_IO_F0_POS)
#define USB_VDMA_IO_F0_UMSK    (~(((1U << USB_VDMA_IO_F0_LEN) - 1) << USB_VDMA_IO_F0_POS))
#define USB_VDMA_LEN_F0        USB_VDMA_LEN_F0
#define USB_VDMA_LEN_F0_POS    (8U)
#define USB_VDMA_LEN_F0_LEN    (17U)
#define USB_VDMA_LEN_F0_MSK    (((1U << USB_VDMA_LEN_F0_LEN) - 1) << USB_VDMA_LEN_F0_POS)
#define USB_VDMA_LEN_F0_UMSK   (~(((1U << USB_VDMA_LEN_F0_LEN) - 1) << USB_VDMA_LEN_F0_POS))

/* 0x30C : VDMA_F0PS2 */
#define USB_VDMA_F0PS2_OFFSET  (0x30C)
#define USB_VDMA_MADDR_F0      USB_VDMA_MADDR_F0
#define USB_VDMA_MADDR_F0_POS  (0U)
#define USB_VDMA_MADDR_F0_LEN  (32U)
#define USB_VDMA_MADDR_F0_MSK  (((1U << USB_VDMA_MADDR_F0_LEN) - 1) << USB_VDMA_MADDR_F0_POS)
#define USB_VDMA_MADDR_F0_UMSK (~(((1U << USB_VDMA_MADDR_F0_LEN) - 1) << USB_VDMA_MADDR_F0_POS))

/* 0x310 : VDMA_F1PS1 */
#define USB_VDMA_F1PS1_OFFSET  (0x310)
#define USB_VDMA_START_F1      USB_VDMA_START_F1
#define USB_VDMA_START_F1_POS  (0U)
#define USB_VDMA_START_F1_LEN  (1U)
#define USB_VDMA_START_F1_MSK  (((1U << USB_VDMA_START_F1_LEN) - 1) << USB_VDMA_START_F1_POS)
#define USB_VDMA_START_F1_UMSK (~(((1U << USB_VDMA_START_F1_LEN) - 1) << USB_VDMA_START_F1_POS))
#define USB_VDMA_TYPE_F1       USB_VDMA_TYPE_F1
#define USB_VDMA_TYPE_F1_POS   (1U)
#define USB_VDMA_TYPE_F1_LEN   (1U)
#define USB_VDMA_TYPE_F1_MSK   (((1U << USB_VDMA_TYPE_F1_LEN) - 1) << USB_VDMA_TYPE_F1_POS)
#define USB_VDMA_TYPE_F1_UMSK  (~(((1U << USB_VDMA_TYPE_F1_LEN) - 1) << USB_VDMA_TYPE_F1_POS))
#define USB_VDMA_IO_F1         USB_VDMA_IO_F1
#define USB_VDMA_IO_F1_POS     (2U)
#define USB_VDMA_IO_F1_LEN     (1U)
#define USB_VDMA_IO_F1_MSK     (((1U << USB_VDMA_IO_F1_LEN) - 1) << USB_VDMA_IO_F1_POS)
#define USB_VDMA_IO_F1_UMSK    (~(((1U << USB_VDMA_IO_F1_LEN) - 1) << USB_VDMA_IO_F1_POS))
#define USB_VDMA_LEN_F1        USB_VDMA_LEN_F1
#define USB_VDMA_LEN_F1_POS    (8U)
#define USB_VDMA_LEN_F1_LEN    (17U)
#define USB_VDMA_LEN_F1_MSK    (((1U << USB_VDMA_LEN_F1_LEN) - 1) << USB_VDMA_LEN_F1_POS)
#define USB_VDMA_LEN_F1_UMSK   (~(((1U << USB_VDMA_LEN_F1_LEN) - 1) << USB_VDMA_LEN_F1_POS))

/* 0x314 : VDMA_F1PS2 */
#define USB_VDMA_F1PS2_OFFSET  (0x314)
#define USB_VDMA_MADDR_F1      USB_VDMA_MADDR_F1
#define USB_VDMA_MADDR_F1_POS  (0U)
#define USB_VDMA_MADDR_F1_LEN  (32U)
#define USB_VDMA_MADDR_F1_MSK  (((1U << USB_VDMA_MADDR_F1_LEN) - 1) << USB_VDMA_MADDR_F1_POS)
#define USB_VDMA_MADDR_F1_UMSK (~(((1U << USB_VDMA_MADDR_F1_LEN) - 1) << USB_VDMA_MADDR_F1_POS))

/* 0x318 : VDMA_F2PS1 */
#define USB_VDMA_F2PS1_OFFSET  (0x318)
#define USB_VDMA_START_F2      USB_VDMA_START_F2
#define USB_VDMA_START_F2_POS  (0U)
#define USB_VDMA_START_F2_LEN  (1U)
#define USB_VDMA_START_F2_MSK  (((1U << USB_VDMA_START_F2_LEN) - 1) << USB_VDMA_START_F2_POS)
#define USB_VDMA_START_F2_UMSK (~(((1U << USB_VDMA_START_F2_LEN) - 1) << USB_VDMA_START_F2_POS))
#define USB_VDMA_TYPE_F2       USB_VDMA_TYPE_F2
#define USB_VDMA_TYPE_F2_POS   (1U)
#define USB_VDMA_TYPE_F2_LEN   (1U)
#define USB_VDMA_TYPE_F2_MSK   (((1U << USB_VDMA_TYPE_F2_LEN) - 1) << USB_VDMA_TYPE_F2_POS)
#define USB_VDMA_TYPE_F2_UMSK  (~(((1U << USB_VDMA_TYPE_F2_LEN) - 1) << USB_VDMA_TYPE_F2_POS))
#define USB_VDMA_IO_F2         USB_VDMA_IO_F2
#define USB_VDMA_IO_F2_POS     (2U)
#define USB_VDMA_IO_F2_LEN     (1U)
#define USB_VDMA_IO_F2_MSK     (((1U << USB_VDMA_IO_F2_LEN) - 1) << USB_VDMA_IO_F2_POS)
#define USB_VDMA_IO_F2_UMSK    (~(((1U << USB_VDMA_IO_F2_LEN) - 1) << USB_VDMA_IO_F2_POS))
#define USB_VDMA_LEN_F2        USB_VDMA_LEN_F2
#define USB_VDMA_LEN_F2_POS    (8U)
#define USB_VDMA_LEN_F2_LEN    (17U)
#define USB_VDMA_LEN_F2_MSK    (((1U << USB_VDMA_LEN_F2_LEN) - 1) << USB_VDMA_LEN_F2_POS)
#define USB_VDMA_LEN_F2_UMSK   (~(((1U << USB_VDMA_LEN_F2_LEN) - 1) << USB_VDMA_LEN_F2_POS))

/* 0x31C : VDMA_F2PS2 */
#define USB_VDMA_F2PS2_OFFSET  (0x31C)
#define USB_VDMA_MADDR_F2      USB_VDMA_MADDR_F2
#define USB_VDMA_MADDR_F2_POS  (0U)
#define USB_VDMA_MADDR_F2_LEN  (32U)
#define USB_VDMA_MADDR_F2_MSK  (((1U << USB_VDMA_MADDR_F2_LEN) - 1) << USB_VDMA_MADDR_F2_POS)
#define USB_VDMA_MADDR_F2_UMSK (~(((1U << USB_VDMA_MADDR_F2_LEN) - 1) << USB_VDMA_MADDR_F2_POS))

/* 0x320 : VDMA_F3PS1 */
#define USB_VDMA_F3PS1_OFFSET  (0x320)
#define USB_VDMA_START_F3      USB_VDMA_START_F3
#define USB_VDMA_START_F3_POS  (0U)
#define USB_VDMA_START_F3_LEN  (1U)
#define USB_VDMA_START_F3_MSK  (((1U << USB_VDMA_START_F3_LEN) - 1) << USB_VDMA_START_F3_POS)
#define USB_VDMA_START_F3_UMSK (~(((1U << USB_VDMA_START_F3_LEN) - 1) << USB_VDMA_START_F3_POS))
#define USB_VDMA_TYPE_F3       USB_VDMA_TYPE_F3
#define USB_VDMA_TYPE_F3_POS   (1U)
#define USB_VDMA_TYPE_F3_LEN   (1U)
#define USB_VDMA_TYPE_F3_MSK   (((1U << USB_VDMA_TYPE_F3_LEN) - 1) << USB_VDMA_TYPE_F3_POS)
#define USB_VDMA_TYPE_F3_UMSK  (~(((1U << USB_VDMA_TYPE_F3_LEN) - 1) << USB_VDMA_TYPE_F3_POS))
#define USB_VDMA_IO_F3         USB_VDMA_IO_F3
#define USB_VDMA_IO_F3_POS     (2U)
#define USB_VDMA_IO_F3_LEN     (1U)
#define USB_VDMA_IO_F3_MSK     (((1U << USB_VDMA_IO_F3_LEN) - 1) << USB_VDMA_IO_F3_POS)
#define USB_VDMA_IO_F3_UMSK    (~(((1U << USB_VDMA_IO_F3_LEN) - 1) << USB_VDMA_IO_F3_POS))
#define USB_VDMA_LEN_F3        USB_VDMA_LEN_F3
#define USB_VDMA_LEN_F3_POS    (8U)
#define USB_VDMA_LEN_F3_LEN    (17U)
#define USB_VDMA_LEN_F3_MSK    (((1U << USB_VDMA_LEN_F3_LEN) - 1) << USB_VDMA_LEN_F3_POS)
#define USB_VDMA_LEN_F3_UMSK   (~(((1U << USB_VDMA_LEN_F3_LEN) - 1) << USB_VDMA_LEN_F3_POS))

/* 0x324 : VDMA_F3PS2 */
#define USB_VDMA_F3PS2_OFFSET  (0x324)
#define USB_VDMA_MADDR_F3      USB_VDMA_MADDR_F3
#define USB_VDMA_MADDR_F3_POS  (0U)
#define USB_VDMA_MADDR_F3_LEN  (32U)
#define USB_VDMA_MADDR_F3_MSK  (((1U << USB_VDMA_MADDR_F3_LEN) - 1) << USB_VDMA_MADDR_F3_POS)
#define USB_VDMA_MADDR_F3_UMSK (~(((1U << USB_VDMA_MADDR_F3_LEN) - 1) << USB_VDMA_MADDR_F3_POS))

/* 0x328 : DEV_ISG3 */
#define USB_DEV_ISG3_OFFSET     (0x328)
#define USB_VDMA_CMPLT_CXF      USB_VDMA_CMPLT_CXF
#define USB_VDMA_CMPLT_CXF_POS  (0U)
#define USB_VDMA_CMPLT_CXF_LEN  (1U)
#define USB_VDMA_CMPLT_CXF_MSK  (((1U << USB_VDMA_CMPLT_CXF_LEN) - 1) << USB_VDMA_CMPLT_CXF_POS)
#define USB_VDMA_CMPLT_CXF_UMSK (~(((1U << USB_VDMA_CMPLT_CXF_LEN) - 1) << USB_VDMA_CMPLT_CXF_POS))
#define USB_VDMA_CMPLT_F0       USB_VDMA_CMPLT_F0
#define USB_VDMA_CMPLT_F0_POS   (1U)
#define USB_VDMA_CMPLT_F0_LEN   (1U)
#define USB_VDMA_CMPLT_F0_MSK   (((1U << USB_VDMA_CMPLT_F0_LEN) - 1) << USB_VDMA_CMPLT_F0_POS)
#define USB_VDMA_CMPLT_F0_UMSK  (~(((1U << USB_VDMA_CMPLT_F0_LEN) - 1) << USB_VDMA_CMPLT_F0_POS))
#define USB_VDMA_CMPLT_F1       USB_VDMA_CMPLT_F1
#define USB_VDMA_CMPLT_F1_POS   (2U)
#define USB_VDMA_CMPLT_F1_LEN   (1U)
#define USB_VDMA_CMPLT_F1_MSK   (((1U << USB_VDMA_CMPLT_F1_LEN) - 1) << USB_VDMA_CMPLT_F1_POS)
#define USB_VDMA_CMPLT_F1_UMSK  (~(((1U << USB_VDMA_CMPLT_F1_LEN) - 1) << USB_VDMA_CMPLT_F1_POS))
#define USB_VDMA_CMPLT_F2       USB_VDMA_CMPLT_F2
#define USB_VDMA_CMPLT_F2_POS   (3U)
#define USB_VDMA_CMPLT_F2_LEN   (1U)
#define USB_VDMA_CMPLT_F2_MSK   (((1U << USB_VDMA_CMPLT_F2_LEN) - 1) << USB_VDMA_CMPLT_F2_POS)
#define USB_VDMA_CMPLT_F2_UMSK  (~(((1U << USB_VDMA_CMPLT_F2_LEN) - 1) << USB_VDMA_CMPLT_F2_POS))
#define USB_VDMA_CMPLT_F3       USB_VDMA_CMPLT_F3
#define USB_VDMA_CMPLT_F3_POS   (4U)
#define USB_VDMA_CMPLT_F3_LEN   (1U)
#define USB_VDMA_CMPLT_F3_MSK   (((1U << USB_VDMA_CMPLT_F3_LEN) - 1) << USB_VDMA_CMPLT_F3_POS)
#define USB_VDMA_CMPLT_F3_UMSK  (~(((1U << USB_VDMA_CMPLT_F3_LEN) - 1) << USB_VDMA_CMPLT_F3_POS))
#define USB_VDMA_CMPLT_F4       USB_VDMA_CMPLT_F4
#define USB_VDMA_CMPLT_F4_POS   (5U)
#define USB_VDMA_CMPLT_F4_LEN   (1U)
#define USB_VDMA_CMPLT_F4_MSK   (((1U << USB_VDMA_CMPLT_F4_LEN) - 1) << USB_VDMA_CMPLT_F4_POS)
#define USB_VDMA_CMPLT_F4_UMSK  (~(((1U << USB_VDMA_CMPLT_F4_LEN) - 1) << USB_VDMA_CMPLT_F4_POS))
#define USB_VDMA_CMPLT_F5       USB_VDMA_CMPLT_F5
#define USB_VDMA_CMPLT_F5_POS   (6U)
#define USB_VDMA_CMPLT_F5_LEN   (1U)
#define USB_VDMA_CMPLT_F5_MSK   (((1U << USB_VDMA_CMPLT_F5_LEN) - 1) << USB_VDMA_CMPLT_F5_POS)
#define USB_VDMA_CMPLT_F5_UMSK  (~(((1U << USB_VDMA_CMPLT_F5_LEN) - 1) << USB_VDMA_CMPLT_F5_POS))
#define USB_VDMA_CMPLT_F6       USB_VDMA_CMPLT_F6
#define USB_VDMA_CMPLT_F6_POS   (7U)
#define USB_VDMA_CMPLT_F6_LEN   (1U)
#define USB_VDMA_CMPLT_F6_MSK   (((1U << USB_VDMA_CMPLT_F6_LEN) - 1) << USB_VDMA_CMPLT_F6_POS)
#define USB_VDMA_CMPLT_F6_UMSK  (~(((1U << USB_VDMA_CMPLT_F6_LEN) - 1) << USB_VDMA_CMPLT_F6_POS))
#define USB_VDMA_CMPLT_F7       USB_VDMA_CMPLT_F7
#define USB_VDMA_CMPLT_F7_POS   (8U)
#define USB_VDMA_CMPLT_F7_LEN   (1U)
#define USB_VDMA_CMPLT_F7_MSK   (((1U << USB_VDMA_CMPLT_F7_LEN) - 1) << USB_VDMA_CMPLT_F7_POS)
#define USB_VDMA_CMPLT_F7_UMSK  (~(((1U << USB_VDMA_CMPLT_F7_LEN) - 1) << USB_VDMA_CMPLT_F7_POS))
#define USB_VDMA_CMPLT_F8       USB_VDMA_CMPLT_F8
#define USB_VDMA_CMPLT_F8_POS   (9U)
#define USB_VDMA_CMPLT_F8_LEN   (1U)
#define USB_VDMA_CMPLT_F8_MSK   (((1U << USB_VDMA_CMPLT_F8_LEN) - 1) << USB_VDMA_CMPLT_F8_POS)
#define USB_VDMA_CMPLT_F8_UMSK  (~(((1U << USB_VDMA_CMPLT_F8_LEN) - 1) << USB_VDMA_CMPLT_F8_POS))
#define USB_VDMA_CMPLT_F9       USB_VDMA_CMPLT_F9
#define USB_VDMA_CMPLT_F9_POS   (10U)
#define USB_VDMA_CMPLT_F9_LEN   (1U)
#define USB_VDMA_CMPLT_F9_MSK   (((1U << USB_VDMA_CMPLT_F9_LEN) - 1) << USB_VDMA_CMPLT_F9_POS)
#define USB_VDMA_CMPLT_F9_UMSK  (~(((1U << USB_VDMA_CMPLT_F9_LEN) - 1) << USB_VDMA_CMPLT_F9_POS))
#define USB_VDMA_CMPLT_F10      USB_VDMA_CMPLT_F10
#define USB_VDMA_CMPLT_F10_POS  (11U)
#define USB_VDMA_CMPLT_F10_LEN  (1U)
#define USB_VDMA_CMPLT_F10_MSK  (((1U << USB_VDMA_CMPLT_F10_LEN) - 1) << USB_VDMA_CMPLT_F10_POS)
#define USB_VDMA_CMPLT_F10_UMSK (~(((1U << USB_VDMA_CMPLT_F10_LEN) - 1) << USB_VDMA_CMPLT_F10_POS))
#define USB_VDMA_CMPLT_F11      USB_VDMA_CMPLT_F11
#define USB_VDMA_CMPLT_F11_POS  (12U)
#define USB_VDMA_CMPLT_F11_LEN  (1U)
#define USB_VDMA_CMPLT_F11_MSK  (((1U << USB_VDMA_CMPLT_F11_LEN) - 1) << USB_VDMA_CMPLT_F11_POS)
#define USB_VDMA_CMPLT_F11_UMSK (~(((1U << USB_VDMA_CMPLT_F11_LEN) - 1) << USB_VDMA_CMPLT_F11_POS))
#define USB_VDMA_CMPLT_F12      USB_VDMA_CMPLT_F12
#define USB_VDMA_CMPLT_F12_POS  (13U)
#define USB_VDMA_CMPLT_F12_LEN  (1U)
#define USB_VDMA_CMPLT_F12_MSK  (((1U << USB_VDMA_CMPLT_F12_LEN) - 1) << USB_VDMA_CMPLT_F12_POS)
#define USB_VDMA_CMPLT_F12_UMSK (~(((1U << USB_VDMA_CMPLT_F12_LEN) - 1) << USB_VDMA_CMPLT_F12_POS))
#define USB_VDMA_CMPLT_F13      USB_VDMA_CMPLT_F13
#define USB_VDMA_CMPLT_F13_POS  (14U)
#define USB_VDMA_CMPLT_F13_LEN  (1U)
#define USB_VDMA_CMPLT_F13_MSK  (((1U << USB_VDMA_CMPLT_F13_LEN) - 1) << USB_VDMA_CMPLT_F13_POS)
#define USB_VDMA_CMPLT_F13_UMSK (~(((1U << USB_VDMA_CMPLT_F13_LEN) - 1) << USB_VDMA_CMPLT_F13_POS))
#define USB_VDMA_CMPLT_F14      USB_VDMA_CMPLT_F14
#define USB_VDMA_CMPLT_F14_POS  (15U)
#define USB_VDMA_CMPLT_F14_LEN  (1U)
#define USB_VDMA_CMPLT_F14_MSK  (((1U << USB_VDMA_CMPLT_F14_LEN) - 1) << USB_VDMA_CMPLT_F14_POS)
#define USB_VDMA_CMPLT_F14_UMSK (~(((1U << USB_VDMA_CMPLT_F14_LEN) - 1) << USB_VDMA_CMPLT_F14_POS))
#define USB_VDMA_ERROR_CXF      USB_VDMA_ERROR_CXF
#define USB_VDMA_ERROR_CXF_POS  (16U)
#define USB_VDMA_ERROR_CXF_LEN  (1U)
#define USB_VDMA_ERROR_CXF_MSK  (((1U << USB_VDMA_ERROR_CXF_LEN) - 1) << USB_VDMA_ERROR_CXF_POS)
#define USB_VDMA_ERROR_CXF_UMSK (~(((1U << USB_VDMA_ERROR_CXF_LEN) - 1) << USB_VDMA_ERROR_CXF_POS))
#define USB_VDMA_ERROR_F0       USB_VDMA_ERROR_F0
#define USB_VDMA_ERROR_F0_POS   (17U)
#define USB_VDMA_ERROR_F0_LEN   (1U)
#define USB_VDMA_ERROR_F0_MSK   (((1U << USB_VDMA_ERROR_F0_LEN) - 1) << USB_VDMA_ERROR_F0_POS)
#define USB_VDMA_ERROR_F0_UMSK  (~(((1U << USB_VDMA_ERROR_F0_LEN) - 1) << USB_VDMA_ERROR_F0_POS))
#define USB_VDMA_ERROR_F1       USB_VDMA_ERROR_F1
#define USB_VDMA_ERROR_F1_POS   (18U)
#define USB_VDMA_ERROR_F1_LEN   (1U)
#define USB_VDMA_ERROR_F1_MSK   (((1U << USB_VDMA_ERROR_F1_LEN) - 1) << USB_VDMA_ERROR_F1_POS)
#define USB_VDMA_ERROR_F1_UMSK  (~(((1U << USB_VDMA_ERROR_F1_LEN) - 1) << USB_VDMA_ERROR_F1_POS))
#define USB_VDMA_ERROR_F2       USB_VDMA_ERROR_F2
#define USB_VDMA_ERROR_F2_POS   (19U)
#define USB_VDMA_ERROR_F2_LEN   (1U)
#define USB_VDMA_ERROR_F2_MSK   (((1U << USB_VDMA_ERROR_F2_LEN) - 1) << USB_VDMA_ERROR_F2_POS)
#define USB_VDMA_ERROR_F2_UMSK  (~(((1U << USB_VDMA_ERROR_F2_LEN) - 1) << USB_VDMA_ERROR_F2_POS))
#define USB_VDMA_ERROR_F3       USB_VDMA_ERROR_F3
#define USB_VDMA_ERROR_F3_POS   (20U)
#define USB_VDMA_ERROR_F3_LEN   (1U)
#define USB_VDMA_ERROR_F3_MSK   (((1U << USB_VDMA_ERROR_F3_LEN) - 1) << USB_VDMA_ERROR_F3_POS)
#define USB_VDMA_ERROR_F3_UMSK  (~(((1U << USB_VDMA_ERROR_F3_LEN) - 1) << USB_VDMA_ERROR_F3_POS))
#define USB_VDMA_ERROR_F4       USB_VDMA_ERROR_F4
#define USB_VDMA_ERROR_F4_POS   (21U)
#define USB_VDMA_ERROR_F4_LEN   (1U)
#define USB_VDMA_ERROR_F4_MSK   (((1U << USB_VDMA_ERROR_F4_LEN) - 1) << USB_VDMA_ERROR_F4_POS)
#define USB_VDMA_ERROR_F4_UMSK  (~(((1U << USB_VDMA_ERROR_F4_LEN) - 1) << USB_VDMA_ERROR_F4_POS))
#define USB_VDMA_ERROR_F5       USB_VDMA_ERROR_F5
#define USB_VDMA_ERROR_F5_POS   (22U)
#define USB_VDMA_ERROR_F5_LEN   (1U)
#define USB_VDMA_ERROR_F5_MSK   (((1U << USB_VDMA_ERROR_F5_LEN) - 1) << USB_VDMA_ERROR_F5_POS)
#define USB_VDMA_ERROR_F5_UMSK  (~(((1U << USB_VDMA_ERROR_F5_LEN) - 1) << USB_VDMA_ERROR_F5_POS))
#define USB_VDMA_ERROR_F6       USB_VDMA_ERROR_F6
#define USB_VDMA_ERROR_F6_POS   (23U)
#define USB_VDMA_ERROR_F6_LEN   (1U)
#define USB_VDMA_ERROR_F6_MSK   (((1U << USB_VDMA_ERROR_F6_LEN) - 1) << USB_VDMA_ERROR_F6_POS)
#define USB_VDMA_ERROR_F6_UMSK  (~(((1U << USB_VDMA_ERROR_F6_LEN) - 1) << USB_VDMA_ERROR_F6_POS))
#define USB_VDMA_ERROR_F7       USB_VDMA_ERROR_F7
#define USB_VDMA_ERROR_F7_POS   (24U)
#define USB_VDMA_ERROR_F7_LEN   (1U)
#define USB_VDMA_ERROR_F7_MSK   (((1U << USB_VDMA_ERROR_F7_LEN) - 1) << USB_VDMA_ERROR_F7_POS)
#define USB_VDMA_ERROR_F7_UMSK  (~(((1U << USB_VDMA_ERROR_F7_LEN) - 1) << USB_VDMA_ERROR_F7_POS))
#define USB_VDMA_ERROR_F8       USB_VDMA_ERROR_F8
#define USB_VDMA_ERROR_F8_POS   (25U)
#define USB_VDMA_ERROR_F8_LEN   (1U)
#define USB_VDMA_ERROR_F8_MSK   (((1U << USB_VDMA_ERROR_F8_LEN) - 1) << USB_VDMA_ERROR_F8_POS)
#define USB_VDMA_ERROR_F8_UMSK  (~(((1U << USB_VDMA_ERROR_F8_LEN) - 1) << USB_VDMA_ERROR_F8_POS))
#define USB_VDMA_ERROR_F9       USB_VDMA_ERROR_F9
#define USB_VDMA_ERROR_F9_POS   (26U)
#define USB_VDMA_ERROR_F9_LEN   (1U)
#define USB_VDMA_ERROR_F9_MSK   (((1U << USB_VDMA_ERROR_F9_LEN) - 1) << USB_VDMA_ERROR_F9_POS)
#define USB_VDMA_ERROR_F9_UMSK  (~(((1U << USB_VDMA_ERROR_F9_LEN) - 1) << USB_VDMA_ERROR_F9_POS))
#define USB_VDMA_ERROR_F10      USB_VDMA_ERROR_F10
#define USB_VDMA_ERROR_F10_POS  (27U)
#define USB_VDMA_ERROR_F10_LEN  (1U)
#define USB_VDMA_ERROR_F10_MSK  (((1U << USB_VDMA_ERROR_F10_LEN) - 1) << USB_VDMA_ERROR_F10_POS)
#define USB_VDMA_ERROR_F10_UMSK (~(((1U << USB_VDMA_ERROR_F10_LEN) - 1) << USB_VDMA_ERROR_F10_POS))
#define USB_VDMA_ERROR_F11      USB_VDMA_ERROR_F11
#define USB_VDMA_ERROR_F11_POS  (28U)
#define USB_VDMA_ERROR_F11_LEN  (1U)
#define USB_VDMA_ERROR_F11_MSK  (((1U << USB_VDMA_ERROR_F11_LEN) - 1) << USB_VDMA_ERROR_F11_POS)
#define USB_VDMA_ERROR_F11_UMSK (~(((1U << USB_VDMA_ERROR_F11_LEN) - 1) << USB_VDMA_ERROR_F11_POS))
#define USB_VDMA_ERROR_F12      USB_VDMA_ERROR_F12
#define USB_VDMA_ERROR_F12_POS  (29U)
#define USB_VDMA_ERROR_F12_LEN  (1U)
#define USB_VDMA_ERROR_F12_MSK  (((1U << USB_VDMA_ERROR_F12_LEN) - 1) << USB_VDMA_ERROR_F12_POS)
#define USB_VDMA_ERROR_F12_UMSK (~(((1U << USB_VDMA_ERROR_F12_LEN) - 1) << USB_VDMA_ERROR_F12_POS))
#define USB_VDMA_ERROR_F13      USB_VDMA_ERROR_F13
#define USB_VDMA_ERROR_F13_POS  (30U)
#define USB_VDMA_ERROR_F13_LEN  (1U)
#define USB_VDMA_ERROR_F13_MSK  (((1U << USB_VDMA_ERROR_F13_LEN) - 1) << USB_VDMA_ERROR_F13_POS)
#define USB_VDMA_ERROR_F13_UMSK (~(((1U << USB_VDMA_ERROR_F13_LEN) - 1) << USB_VDMA_ERROR_F13_POS))
#define USB_VDMA_ERROR_F14      USB_VDMA_ERROR_F14
#define USB_VDMA_ERROR_F14_POS  (31U)
#define USB_VDMA_ERROR_F14_LEN  (1U)
#define USB_VDMA_ERROR_F14_MSK  (((1U << USB_VDMA_ERROR_F14_LEN) - 1) << USB_VDMA_ERROR_F14_POS)
#define USB_VDMA_ERROR_F14_UMSK (~(((1U << USB_VDMA_ERROR_F14_LEN) - 1) << USB_VDMA_ERROR_F14_POS))

