XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/usb_reg.h
/* 0x33C : DEV_MISG4 */
#define USB_DEV_MISG4_OFFSET     (0x33C)
#define USB_ML1_INT              USB_ML1_INT
#define USB_ML1_INT_POS          (0U)
#define USB_ML1_INT_LEN          (1U)
#define USB_ML1_INT_MSK          (((1U << USB_ML1_INT_LEN) - 1) << USB_ML1_INT_POS)
#define USB_ML1_INT_UMSK         (~(((1U << USB_ML1_INT_LEN) - 1) << USB_ML1_INT_POS))
#define USB_MVDMA_CMPLT_F15      USB_MVDMA_CMPLT_F15
#define USB_MVDMA_CMPLT_F15_POS  (16U)
#define USB_MVDMA_CMPLT_F15_LEN  (1U)
#define USB_MVDMA_CMPLT_F15_MSK  (((1U << USB_MVDMA_CMPLT_F15_LEN) - 1) << USB_MVDMA_CMPLT_F15_POS)
#define USB_MVDMA_CMPLT_F15_UMSK (~(((1U << USB_MVDMA_CMPLT_F15_LEN) - 1) << USB_MVDMA_CMPLT_F15_POS))
#define USB_MVDMA_ERROR_F15      USB_MVDMA_ERROR_F15
#define USB_MVDMA_ERROR_F15_POS  (24U)
#define USB_MVDMA_ERROR_F15_LEN  (1U)
#define USB_MVDMA_ERROR_F15_MSK  (((1U << USB_MVDMA_ERROR_F15_LEN) - 1) << USB_MVDMA_ERROR_F15_POS)
#define USB_MVDMA_ERROR_F15_UMSK (~(((1U << USB_MVDMA_ERROR_F15_LEN) - 1) << USB_MVDMA_ERROR_F15_POS))

/* 0x350 : VDMA_FnPS1 */
#define USB_VDMA_FNPS1_OFFSET  (0x350)
#define USB_VDMA_START_FN      USB_VDMA_START_FN
#define USB_VDMA_START_FN_POS  (0U)
#define USB_VDMA_START_FN_LEN  (1U)
#define USB_VDMA_START_FN_MSK  (((1U << USB_VDMA_START_FN_LEN) - 1) << USB_VDMA_START_FN_POS)
#define USB_VDMA_START_FN_UMSK (~(((1U << USB_VDMA_START_FN_LEN) - 1) << USB_VDMA_START_FN_POS))
#define USB_VDMA_TYPE_FN       USB_VDMA_TYPE_FN
#define USB_VDMA_TYPE_FN_POS   (1U)
#define USB_VDMA_TYPE_FN_LEN   (1U)
#define USB_VDMA_TYPE_FN_MSK   (((1U << USB_VDMA_TYPE_FN_LEN) - 1) << USB_VDMA_TYPE_FN_POS)
#define USB_VDMA_TYPE_FN_UMSK  (~(((1U << USB_VDMA_TYPE_FN_LEN) - 1) << USB_VDMA_TYPE_FN_POS))
#define USB_VDMA_IO_FN         USB_VDMA_IO_FN
#define USB_VDMA_IO_FN_POS     (2U)
#define USB_VDMA_IO_FN_LEN     (1U)
#define USB_VDMA_IO_FN_MSK     (((1U << USB_VDMA_IO_FN_LEN) - 1) << USB_VDMA_IO_FN_POS)
#define USB_VDMA_IO_FN_UMSK    (~(((1U << USB_VDMA_IO_FN_LEN) - 1) << USB_VDMA_IO_FN_POS))
#define USB_VDMA_LEN_FN        USB_VDMA_LEN_FN
#define USB_VDMA_LEN_FN_POS    (8U)
#define USB_VDMA_LEN_FN_LEN    (17U)
#define USB_VDMA_LEN_FN_MSK    (((1U << USB_VDMA_LEN_FN_LEN) - 1) << USB_VDMA_LEN_FN_POS)
#define USB_VDMA_LEN_FN_UMSK   (~(((1U << USB_VDMA_LEN_FN_LEN) - 1) << USB_VDMA_LEN_FN_POS))

/* 0x354 : VDMA_FnPS2 */
#define USB_VDMA_FNPS2_OFFSET  (0x354)
#define USB_VDMA_MADDR_FN      USB_VDMA_MADDR_FN
#define USB_VDMA_MADDR_FN_POS  (0U)
#define USB_VDMA_MADDR_FN_LEN  (32U)
#define USB_VDMA_MADDR_FN_MSK  (((1U << USB_VDMA_MADDR_FN_LEN) - 1) << USB_VDMA_MADDR_FN_POS)
#define USB_VDMA_MADDR_FN_UMSK (~(((1U << USB_VDMA_MADDR_FN_LEN) - 1) << USB_VDMA_MADDR_FN_POS))

struct usb_reg {
    /* 0x000 : HCCAP */
    union {
        struct
        {
            uint32_t CAPLENGTH     : 8;  /* [ 7: 0],       None,        0x0 */
            uint32_t reserved_8_15 : 8;  /* [15: 8],       rsvd,        0x0 */
            uint32_t HCIVERSION    : 16; /* [31:16],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } HCCAP;

    /* 0x004 : HCSPARAMS */
    union {
        struct
        {
            uint32_t N_PORTS       : 4;  /* [ 3: 0],       None,        0x0 */
            uint32_t reserved_4_31 : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } HCSPARAMS;

    /* 0x008 : HCCPARAMS */
    union {
        struct
        {
            uint32_t reserved_0        : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t PROG_FR_LIST_FLAG : 1;  /* [    1],       None,        0x0 */
            uint32_t ASYN_SCH_PARK_CAP : 1;  /* [    2],       None,        0x0 */
            uint32_t reserved_3_31     : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } HCCPARAMS;

    /* 0xc  reserved */
    uint8_t RESERVED0xc[4];

    /* 0x010 : USBCMD */
    union {
        struct
        {
            uint32_t RS             : 1; /* [    0],       None,        0x0 */
            uint32_t HC_RESET       : 1; /* [    1],       None,        0x0 */
            uint32_t FRL_SIZE       : 2; /* [ 3: 2],       None,        0x0 */
            uint32_t PSCH_EN        : 1; /* [    4],       None,        0x0 */
            uint32_t ASCH_EN        : 1; /* [    5],       None,        0x0 */
            uint32_t INT_OAAD       : 1; /* [    6],       None,        0x0 */
            uint32_t reserved_7     : 1; /* [    7],       rsvd,        0x0 */
            uint32_t ASYN_PK_CNT    : 2; /* [ 9: 8],       None,        0x0 */
            uint32_t reserved_10    : 1; /* [   10],       rsvd,        0x0 */
            uint32_t ASYN_PK_EN     : 1; /* [   11],       None,        0x0 */
            uint32_t reserved_12_15 : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t INT_THRC       : 8; /* [23:16],       None,        0x0 */
            uint32_t reserved_24_31 : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } USBCMD;

    /* 0x014 : USBSTS */
    union {
        struct
        {
            uint32_t USB_INT        : 1;  /* [    0],       None,        0x0 */
            uint32_t USBERR_INT     : 1;  /* [    1],       None,        0x0 */
            uint32_t PO_CHG_DET     : 1;  /* [    2],       None,        0x0 */
            uint32_t FRL_ROL        : 1;  /* [    3],       None,        0x0 */
            uint32_t H_SYSERR       : 1;  /* [    4],       None,        0x0 */
            uint32_t INT_OAA        : 1;  /* [    5],       None,        0x0 */
            uint32_t reserved_6_11  : 6;  /* [11: 6],       rsvd,        0x0 */
            uint32_t HCHalted       : 1;  /* [   12],       None,        0x0 */
            uint32_t Reclamation    : 1;  /* [   13],       None,        0x0 */
            uint32_t PSCH_STS       : 1;  /* [   14],       None,        0x0 */
            uint32_t ASCH_STS       : 1;  /* [   15],       None,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } USBSTS;

