XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/usb_reg.h
    /* 0x8c  reserved */
    uint8_t RESERVED0x8c[52];

    /* 0x0C0 : GLB_ISR */
    union {
        struct
        {
            uint32_t DEV_INT       : 1;  /* [    0],       None,        0x0 */
            uint32_t OTG_INT       : 1;  /* [    1],       None,        0x0 */
            uint32_t HC_INT        : 1;  /* [    2],       None,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GLB_ISR;

    /* 0x0C4 : GLB_INT */
    union {
        struct
        {
            uint32_t MDEV_INT      : 1;  /* [    0],       None,        0x0 */
            uint32_t MOTG_INT      : 1;  /* [    1],       None,        0x0 */
            uint32_t MHC_INT       : 1;  /* [    2],       None,        0x0 */
            uint32_t INT_POLARITY  : 1;  /* [    3],       None,        0x0 */
            uint32_t reserved_4_31 : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } GLB_INT;

    /* 0xc8  reserved */
    uint8_t RESERVED0xc8[24];

    /* 0x0E0 : REVISION */
    union {
        struct
        {
            uint32_t REVISION : 32; /* [31: 0],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } REVISION;

    /* 0x0E4 : FEATURE */
    union {
        struct
        {
            uint32_t DMABUFSIZE     : 5;  /* [ 4: 0],       None,        0x0 */
            uint32_t FIFO_NUM       : 5;  /* [ 9: 5],       None,        0x0 */
            uint32_t EP_NUM         : 5;  /* [14:10],       None,        0x0 */
            uint32_t DEV_ONLY       : 1;  /* [   15],       None,        0x0 */
            uint32_t HOST_ONLY      : 1;  /* [   16],       None,        0x0 */
            uint32_t reserved_17_31 : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } FEATURE;

    /* 0x0E8 : AXI_CR */
    union {
        struct
        {
            uint32_t AXI_SGLBST    : 1;  /* [    0],       None,        0x0 */
            uint32_t reserved_1_31 : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } AXI_CR;

    /* 0xec  reserved */
    uint8_t RESERVED0xec[20];

    /* 0x100 : DEV_CTL */
    union {
        struct
        {
            uint32_t CAP_RMWAKUP       : 1; /* [    0],       None,        0x0 */
            uint32_t HALF_SPEED_HOV    : 1; /* [    1],       None,        0x0 */
            uint32_t GLINT_EN_HOV      : 1; /* [    2],       None,        0x0 */
            uint32_t GOSUSP            : 1; /* [    3],       None,        0x0 */
            uint32_t SFRST_HOV         : 1; /* [    4],       None,        0x0 */
            uint32_t CHIP_EN_HOV       : 1; /* [    5],       None,        0x0 */
            uint32_t HS_EN_HOV         : 1; /* [    6],       None,        0x0 */
            uint32_t SYSBUS_WIDTH_HOV  : 1; /* [    7],       None,        0x0 */
            uint32_t reserved_8        : 1; /* [    8],       rsvd,        0x0 */
            uint32_t FORCE_FS          : 1; /* [    9],       None,        0x0 */
            uint32_t IDLE_DEGLITCH_HOV : 2; /* [11:10],       None,        0x0 */
            uint32_t LPM_BESL_MAX      : 4; /* [15:12],       None,        0x0 */
            uint32_t LPM_BESL_MIN      : 4; /* [19:16],       None,        0x0 */
            uint32_t LPM_BESL          : 4; /* [23:20],       None,        0x0 */
            uint32_t reserved_24       : 1; /* [   24],       rsvd,        0x0 */
            uint32_t LPM_EN            : 1; /* [   25],       None,        0x0 */
            uint32_t LPM_ACCEPT        : 1; /* [   26],       None,        0x0 */
            uint32_t reserved_27_31    : 5; /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_CTL;

    /* 0x104 : DEV_ADR */
    union {
        struct
        {
            uint32_t DEVADR        : 7;  /* [ 6: 0],       None,        0x0 */
            uint32_t AFT_CONF      : 1;  /* [    7],       None,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_ADR;

    /* 0x108 : DEV_TST */
    union {
        struct
        {
            uint32_t TST_CLRFF_HOV   : 1;  /* [    0],       None,        0x0 */
            uint32_t TST_LPCX        : 1;  /* [    1],       None,        0x0 */
            uint32_t TST_CLREA       : 1;  /* [    2],       None,        0x0 */
            uint32_t rsvd_3          : 1;  /* [    3],       None,        0x0 */
            uint32_t TST_DISTO_HOV   : 1;  /* [    4],       None,        0x0 */
            uint32_t TST_MOD_HOV     : 1;  /* [    5],       None,        0x0 */
            uint32_t DISGENSOF       : 1;  /* [    6],       None,        0x0 */
            uint32_t TST_MOD_TYP_HOV : 1;  /* [    7],       None,        0x0 */
            uint32_t reserved_8_31   : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_TST;

    /* 0x10C : DEV_SFN */
    union {
        struct
        {
            uint32_t SOFN           : 11; /* [10: 0],       None,        0x0 */
            uint32_t USOFN          : 3;  /* [13:11],       None,        0x0 */
            uint32_t reserved_14_31 : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_SFN;

    /* 0x110 : DEV_SMT */
    union {
        struct
        {
            uint32_t SOFMT          : 16; /* [15: 0],       None,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_SMT;

    /* 0x114 : PHY_TST */
    union {
        struct
        {
            uint32_t UNPLUG        : 1;  /* [    0],       None,        0x0 */
            uint32_t TST_JSTA      : 1;  /* [    1],       None,        0x0 */
            uint32_t TST_KSTA      : 1;  /* [    2],       None,        0x0 */
            uint32_t TST_SE0NAK    : 1;  /* [    3],       None,        0x0 */
            uint32_t TST_PKT       : 1;  /* [    4],       None,        0x0 */
            uint32_t reserved_5_31 : 27; /* [31: 5],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } PHY_TST;

    /* 0x118 : DEV_VCTL */
    union {
        struct
        {
            uint32_t VCTL_HOV      : 5;  /* [ 4: 0],       None,        0x0 */
            uint32_t VCTLOAD_N_HOV : 1;  /* [    5],       None,        0x0 */
            uint32_t reserved_6_31 : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_VCTL;

    /* 0x11C : DEV_CXCFG */
    union {
        struct
        {
            uint32_t VSTA_HOV      : 8;  /* [ 7: 0],       None,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_CXCFG;

    /* 0x120 : DEV_CXCFE */
    union {
        struct
        {
            uint32_t CX_DONE      : 1; /* [    0],       None,        0x0 */
            uint32_t TST_PKDONE   : 1; /* [    1],       None,        0x0 */
            uint32_t CX_STL       : 1; /* [    2],       None,        0x0 */
            uint32_t CX_CLR       : 1; /* [    3],       None,        0x0 */
            uint32_t CX_FUL       : 1; /* [    4],       None,        0x0 */
            uint32_t CX_EMP       : 1; /* [    5],       None,        0x0 */
            uint32_t reserved_6_7 : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t F0_EMP       : 1; /* [    8],       None,        0x0 */
            uint32_t F1_EMP       : 1; /* [    9],       None,        0x0 */
            uint32_t F2_EMP       : 1; /* [   10],       None,        0x0 */
            uint32_t F3_EMP       : 1; /* [   11],       None,        0x0 */
            uint32_t F4_EMP       : 1; /* [   12],       None,        0x0 */
            uint32_t F5_EMP       : 1; /* [   13],       None,        0x0 */
            uint32_t F6_EMP       : 1; /* [   14],       None,        0x0 */
            uint32_t F7_EMP       : 1; /* [   15],       None,        0x0 */
            uint32_t F8_EMP       : 1; /* [   16],       None,        0x0 */
            uint32_t F9_EMP       : 1; /* [   17],       None,        0x0 */
            uint32_t F10_EMP      : 1; /* [   18],       None,        0x0 */
            uint32_t F11_EMP      : 1; /* [   19],       None,        0x0 */
            uint32_t F12_EMP      : 1; /* [   20],       None,        0x0 */
            uint32_t F13_EMP      : 1; /* [   21],       None,        0x0 */
            uint32_t F14_EMP      : 1; /* [   22],       None,        0x0 */
            uint32_t F15_EMP      : 1; /* [   23],       None,        0x0 */
            uint32_t CX_FNT       : 7; /* [30:24],       None,        0x0 */
            uint32_t reserved_31  : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_CXCFE;

    /* 0x124 : DEV_ICR */
    union {
        struct
        {
            uint32_t IDLE_CNT      : 3;  /* [ 2: 0],       None,        0x0 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_ICR;

    /* 0x128  reserved */
    uint8_t RESERVED0x128[8];

    /* 0x130 : DEV_MIGR */
    union {
        struct
        {
            uint32_t MINT_G0       : 1;  /* [    0],       None,        0x0 */
            uint32_t MINT_G1       : 1;  /* [    1],       None,        0x0 */
            uint32_t MINT_G2       : 1;  /* [    2],       None,        0x0 */
            uint32_t MINT_G3       : 1;  /* [    3],       None,        0x0 */
            uint32_t MINT_G4       : 1;  /* [    4],       None,        0x0 */
            uint32_t reserved_5_31 : 27; /* [31: 5],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_MIGR;

