XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/usb_reg.h
    /* 0x154 : DEV_TXZ */
    union {
        struct
        {
            uint32_t TX0BYTE_EP1   : 1;  /* [    0],       None,        0x0 */
            uint32_t TX0BYTE_EP2   : 1;  /* [    1],       None,        0x0 */
            uint32_t TX0BYTE_EP3   : 1;  /* [    2],       None,        0x0 */
            uint32_t TX0BYTE_EP4   : 1;  /* [    3],       None,        0x0 */
            uint32_t TX0BYTE_EP5   : 1;  /* [    4],       None,        0x0 */
            uint32_t TX0BYTE_EP6   : 1;  /* [    5],       None,        0x0 */
            uint32_t TX0BYTE_EP7   : 1;  /* [    6],       None,        0x0 */
            uint32_t TX0BYTE_EP8   : 1;  /* [    7],       None,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_TXZ;

    /* 0x158 : DEV_ISE */
    union {
        struct
        {
            uint32_t ISO_ABT_ERR_EP1 : 1; /* [    0],       None,        0x0 */
            uint32_t ISO_ABT_ERR_EP2 : 1; /* [    1],       None,        0x0 */
            uint32_t ISO_ABT_ERR_EP3 : 1; /* [    2],       None,        0x0 */
            uint32_t ISO_ABT_ERR_EP4 : 1; /* [    3],       None,        0x0 */
            uint32_t ISO_ABT_ERR_EP5 : 1; /* [    4],       None,        0x0 */
            uint32_t ISO_ABT_ERR_EP6 : 1; /* [    5],       None,        0x0 */
            uint32_t ISO_ABT_ERR_EP7 : 1; /* [    6],       None,        0x0 */
            uint32_t ISO_ABT_ERR_EP8 : 1; /* [    7],       None,        0x0 */
            uint32_t reserved_8_15   : 8; /* [15: 8],       rsvd,        0x0 */
            uint32_t ISO_SEQ_ERR_EP1 : 1; /* [   16],       None,        0x0 */
            uint32_t ISO_SEQ_ERR_EP2 : 1; /* [   17],       None,        0x0 */
            uint32_t ISO_SEQ_ERR_EP3 : 1; /* [   18],       None,        0x0 */
            uint32_t ISO_SEQ_ERR_EP4 : 1; /* [   19],       None,        0x0 */
            uint32_t ISO_SEQ_ERR_EP5 : 1; /* [   20],       None,        0x0 */
            uint32_t ISO_SEQ_ERR_EP6 : 1; /* [   21],       None,        0x0 */
            uint32_t ISO_SEQ_ERR_EP7 : 1; /* [   22],       None,        0x0 */
            uint32_t ISO_SEQ_ERR_EP8 : 1; /* [   23],       None,        0x0 */
            uint32_t reserved_24_31  : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_ISE;

    /* 0x15c  reserved */
    uint8_t RESERVED0x15c[4];

    /* 0x160 : DEV_INMPS1 */
    union {
        struct
        {
            uint32_t MAXPS_IEP1      : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_IEP1        : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_IEP1       : 1;  /* [   12],       None,        0x0 */
            uint32_t TX_NUM_HBW_IEP1 : 2;  /* [14:13],       None,        0x0 */
            uint32_t TX0BYTE_IEP1    : 1;  /* [   15],       None,        0x0 */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_INMPS1;

    /* 0x164 : DEV_INMPS2 */
    union {
        struct
        {
            uint32_t MAXPS_IEP2      : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_IEP2        : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_IEP2       : 1;  /* [   12],       None,        0x0 */
            uint32_t TX_NUM_HBW_IEP2 : 2;  /* [14:13],       None,        0x0 */
            uint32_t TX0BYTE_IEP2    : 1;  /* [   15],       None,        0x0 */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_INMPS2;

    /* 0x168 : DEV_INMPS3 */
    union {
        struct
        {
            uint32_t MAXPS_IEP3      : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_IEP3        : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_IEP3       : 1;  /* [   12],       None,        0x0 */
            uint32_t TX_NUM_HBW_IEP3 : 2;  /* [14:13],       None,        0x0 */
            uint32_t TX0BYTE_IEP3    : 1;  /* [   15],       None,        0x0 */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_INMPS3;

    /* 0x16C : DEV_INMPS4 */
    union {
        struct
        {
            uint32_t MAXPS_IEP4      : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_IEP4        : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_IEP4       : 1;  /* [   12],       None,        0x0 */
            uint32_t TX_NUM_HBW_IEP4 : 2;  /* [14:13],       None,        0x0 */
            uint32_t TX0BYTE_IEP4    : 1;  /* [   15],       None,        0x0 */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_INMPS4;

    /* 0x170 : DEV_INMPS5 */
    union {
        struct
        {
            uint32_t MAXPS_IEP5      : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_IEP5        : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_IEP5       : 1;  /* [   12],       None,        0x0 */
            uint32_t TX_NUM_HBW_IEP5 : 2;  /* [14:13],       None,        0x0 */
            uint32_t TX0BYTE_IEP5    : 1;  /* [   15],       None,        0x0 */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_INMPS5;

    /* 0x174 : DEV_INMPS6 */
    union {
        struct
        {
            uint32_t MAXPS_IEP6      : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_IEP6        : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_IEP6       : 1;  /* [   12],       None,        0x0 */
            uint32_t TX_NUM_HBW_IEP6 : 2;  /* [14:13],       None,        0x0 */
            uint32_t TX0BYTE_IEP6    : 1;  /* [   15],       None,        0x0 */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_INMPS6;

