XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/usb_reg.h
    /* 0x1C0 : DMA_TFN */
    union {
        struct
        {
            uint32_t ACC_F0_HOV     : 1;  /* [    0],       None,        0x0 */
            uint32_t ACC_F1_HOV     : 1;  /* [    1],       None,        0x0 */
            uint32_t ACC_F2_HOV     : 1;  /* [    2],       None,        0x0 */
            uint32_t ACC_F3_HOV     : 1;  /* [    3],       None,        0x0 */
            uint32_t ACC_CXF_HOV    : 1;  /* [    4],       None,        0x0 */
            uint32_t ACC_F4_HOV     : 1;  /* [    5],       None,        0x0 */
            uint32_t ACC_F5_HOV     : 1;  /* [    6],       None,        0x0 */
            uint32_t ACC_F6_HOV     : 1;  /* [    7],       None,        0x0 */
            uint32_t ACC_F7_HOV     : 1;  /* [    8],       None,        0x0 */
            uint32_t ACC_F8_HOV     : 1;  /* [    9],       None,        0x0 */
            uint32_t ACC_F9_HOV     : 1;  /* [   10],       None,        0x0 */
            uint32_t ACC_F10_HOV    : 1;  /* [   11],       None,        0x0 */
            uint32_t ACC_F11_HOV    : 1;  /* [   12],       None,        0x0 */
            uint32_t ACC_F12_HOV    : 1;  /* [   13],       None,        0x0 */
            uint32_t ACC_F13_HOV    : 1;  /* [   14],       None,        0x0 */
            uint32_t ACC_F14_HOV    : 1;  /* [   15],       None,        0x0 */
            uint32_t ACC_F15_HOV    : 1;  /* [   16],       None,        0x0 */
            uint32_t reserved_17_31 : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_TFN;

    /* 0x1C4 : DMA_CPS0 */
    union {
        struct
        {
            uint32_t AWCHACHE_HOV   : 4;  /* [ 3: 0],       None,        0x0 */
            uint32_t AWPORT_HOV     : 3;  /* [ 6: 4],       None,        0x0 */
            uint32_t AWLOCK_HOV     : 2;  /* [ 8: 7],       None,        0x0 */
            uint32_t ARCACHE_HOV    : 4;  /* [12: 9],       None,        0x0 */
            uint32_t ARPORT_HOV     : 3;  /* [15:13],       None,        0x0 */
            uint32_t ARLOCK_HOV     : 2;  /* [17:16],       None,        0x0 */
            uint32_t BUF_LD_EN_HOV  : 1;  /* [   18],       None,        0x0 */
            uint32_t DST_WD_HOV     : 1;  /* [   19],       None,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_CPS0;

    /* 0x1C8 : DMA_CPS1 */
    union {
        struct
        {
            uint32_t DMA_START_HOV        : 1;  /* [    0],       None,        0x0 */
            uint32_t DMA_TYPE_HOV         : 1;  /* [    1],       None,        0x0 */
            uint32_t DMA_IO_HOV           : 1;  /* [    2],       None,        0x0 */
            uint32_t DMA_ABORT_HOV        : 1;  /* [    3],       None,        0x0 */
            uint32_t CLRFIFO_DMAABORT_HOV : 1;  /* [    4],       None,        0x0 */
            uint32_t reserved_5_7         : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t DMA_LEN_HOV          : 17; /* [24: 8],       None,        0x0 */
            uint32_t R_HPORT_HOV          : 4;  /* [28:25],       None,        0x0 */
            uint32_t UNDEF_LEN_BURST_HOV  : 1;  /* [   29],       None,        0x0 */
            uint32_t L1_WAKEUP            : 1;  /* [   30],       None,        0x0 */
            uint32_t DevPhy_Suspend_HOV   : 1;  /* [   31],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_CPS1;

    /* 0x1CC : DMA_CPS2 */
    union {
        struct
        {
            uint32_t DMA_MADDR_HOV : 32; /* [31: 0],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_CPS2;

    /* 0x1D0 : DMA_CPS3 */
    union {
        struct
        {
            uint32_t SETUP_CMD_RPORT : 32; /* [31: 0],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_CPS3;

    /* 0x1D4 : DMA_CPS4 */
    union {
        struct
        {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DMA_CPS4;

    /* 0x1D8 : DEV_FMAP2 */
    union {
        struct
        {
            uint32_t EPNO_FIFO4     : 4; /* [ 3: 0],       None,        0x0 */
            uint32_t Dir_FIFO4      : 2; /* [ 5: 4],       None,        0x0 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t EPNO_FIFO5     : 4; /* [11: 8],       None,        0x0 */
            uint32_t Dir_FIFO5      : 2; /* [13:12],       None,        0x0 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t EPNO_FIFO6     : 4; /* [19:16],       None,        0x0 */
            uint32_t Dir_FIFO6      : 2; /* [21:20],       None,        0x0 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t EPNO_FIFO7     : 4; /* [27:24],       None,        0x0 */
            uint32_t Dir_FIFO7      : 2; /* [29:28],       None,        0x0 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FMAP2;

    /* 0x1DC : DEV_FCFG2 */
    union {
        struct
        {
            uint32_t BLK_TYP_F4     : 2; /* [ 1: 0],       None,        0x0 */
            uint32_t BLKNO_F4       : 2; /* [ 3: 2],       None,        0x0 */
            uint32_t BLKSZ_F4       : 1; /* [    4],       None,        0x0 */
            uint32_t EN_F4          : 1; /* [    5],       None,        0x0 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t BLK_TYP_F5     : 2; /* [ 9: 8],       None,        0x0 */
            uint32_t BLKNO_F5       : 2; /* [11:10],       None,        0x0 */
            uint32_t BLKSZ_F5       : 1; /* [   12],       None,        0x0 */
            uint32_t EN_F5          : 1; /* [   13],       None,        0x0 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t BLK_TYP_F6     : 2; /* [17:16],       None,        0x0 */
            uint32_t BLKNO_F6       : 2; /* [19:18],       None,        0x0 */
            uint32_t BLKSZ_F6       : 1; /* [   20],       None,        0x0 */
            uint32_t EN_F6          : 1; /* [   21],       None,        0x0 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t BLK_TYP_F7     : 2; /* [25:24],       None,        0x0 */
            uint32_t BLKNO_F7       : 2; /* [27:26],       None,        0x0 */
            uint32_t BLKSZ_F7       : 1; /* [   28],       None,        0x0 */
            uint32_t EN_F7          : 1; /* [   29],       None,        0x0 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FCFG2;

    /* 0x1E0 : DEV_FMAP3 */
    union {
        struct
        {
            uint32_t EPNO_FIFO8     : 4; /* [ 3: 0],       None,        0x0 */
            uint32_t Dir_FIFO8      : 2; /* [ 5: 4],       None,        0x0 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t EPNO_FIFO9     : 4; /* [11: 8],       None,        0x0 */
            uint32_t Dir_FIFO9      : 2; /* [13:12],       None,        0x0 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t EPNO_FIFO10    : 4; /* [19:16],       None,        0x0 */
            uint32_t Dir_FIFO10     : 2; /* [21:20],       None,        0x0 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t EPNO_FIFO11    : 4; /* [27:24],       None,        0x0 */
            uint32_t Dir_FIFO11     : 2; /* [29:28],       None,        0x0 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FMAP3;

    /* 0x1E4 : DEV_FCFG3 */
    union {
        struct
        {
            uint32_t BLK_TYP_F8     : 2; /* [ 1: 0],       None,        0x0 */
            uint32_t BLKNO_F8       : 2; /* [ 3: 2],       None,        0x0 */
            uint32_t BLKSZ_F8       : 1; /* [    4],       None,        0x0 */
            uint32_t EN_F8          : 1; /* [    5],       None,        0x0 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t BLK_TYP_F9     : 2; /* [ 9: 8],       None,        0x0 */
            uint32_t BLKNO_F9       : 2; /* [11:10],       None,        0x0 */
            uint32_t BLKSZ_F9       : 1; /* [   12],       None,        0x0 */
            uint32_t EN_F9          : 1; /* [   13],       None,        0x0 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t BLK_TYP_F10    : 2; /* [17:16],       None,        0x0 */
            uint32_t BLKNO_F10      : 2; /* [19:18],       None,        0x0 */
            uint32_t BLKSZ_F10      : 1; /* [   20],       None,        0x0 */
            uint32_t EN_F10         : 1; /* [   21],       None,        0x0 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t BLK_TYP_F11    : 2; /* [25:24],       None,        0x0 */
            uint32_t BLKNO_F11      : 2; /* [27:26],       None,        0x0 */
            uint32_t BLKSZ_F11      : 1; /* [   28],       None,        0x0 */
            uint32_t EN_F11         : 1; /* [   29],       None,        0x0 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FCFG3;

    /* 0x1E8 : DEV_FMAP4 */
    union {
        struct
        {
            uint32_t EPNO_FIFO12    : 4; /* [ 3: 0],       None,        0x0 */
            uint32_t Dir_FIFO12     : 2; /* [ 5: 4],       None,        0x0 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t EPNO_FIFO13    : 4; /* [11: 8],       None,        0x0 */
            uint32_t Dir_FIFO13     : 2; /* [13:12],       None,        0x0 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t EPNO_FIFO14    : 4; /* [19:16],       None,        0x0 */
            uint32_t Dir_FIFO14     : 2; /* [21:20],       None,        0x0 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t EPNO_FIFO15    : 4; /* [27:24],       None,        0x0 */
            uint32_t Dir_FIFO15     : 2; /* [29:28],       None,        0x0 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FMAP4;

