XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/usb_reg.h
    /* 0x1EC : DEV_FCFG4 */
    union {
        struct
        {
            uint32_t BLK_TYP_F12    : 2; /* [ 1: 0],       None,        0x0 */
            uint32_t BLKNO_F12      : 2; /* [ 3: 2],       None,        0x0 */
            uint32_t BLKSZ_F12      : 1; /* [    4],       None,        0x0 */
            uint32_t EN_F12         : 1; /* [    5],       None,        0x0 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t BLK_TYP_F13    : 2; /* [ 9: 8],       None,        0x0 */
            uint32_t BLKNO_F13      : 2; /* [11:10],       None,        0x0 */
            uint32_t BLKSZ_F13      : 1; /* [   12],       None,        0x0 */
            uint32_t EN_F13         : 1; /* [   13],       None,        0x0 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t BLK_TYP_F14    : 2; /* [17:16],       None,        0x0 */
            uint32_t BLKNO_F14      : 2; /* [19:18],       None,        0x0 */
            uint32_t BLKSZ_F14      : 1; /* [   20],       None,        0x0 */
            uint32_t EN_F14         : 1; /* [   21],       None,        0x0 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t BLK_TYP_F15    : 2; /* [25:24],       None,        0x0 */
            uint32_t BLKNO_F15      : 2; /* [27:26],       None,        0x0 */
            uint32_t BLKSZ_F15      : 1; /* [   28],       None,        0x0 */
            uint32_t EN_F15         : 1; /* [   29],       None,        0x0 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FCFG4;

    /* 0x1F0 : DEV_FIBC4 */
    union {
        struct
        {
            uint32_t BC_F4          : 11; /* [10: 0],       None,        0x0 */
            uint32_t reserved_11    : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t FFRST4_HOV     : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FIBC4;

    /* 0x1F4 : DEV_FIBC5 */
    union {
        struct
        {
            uint32_t BC_F5          : 11; /* [10: 0],       None,        0x0 */
            uint32_t reserved_11    : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t FFRST5_HOV     : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FIBC5;

    /* 0x1F8 : DEV_FIBC6 */
    union {
        struct
        {
            uint32_t BC_F6          : 11; /* [10: 0],       None,        0x0 */
            uint32_t reserved_11    : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t FFRST6_HOV     : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FIBC6;

    /* 0x1FC : DEV_FIBC7 */
    union {
        struct
        {
            uint32_t BC_F7          : 11; /* [10: 0],       None,        0x0 */
            uint32_t reserved_11    : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t FFRST7_HOV     : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FIBC7;

    /* 0x200  reserved */
    uint8_t RESERVED0x200[256];

    /* 0x300 : VDMA_CXFPS1 */
    union {
        struct
        {
            uint32_t VDMA_START_CXF : 1;  /* [    0],       None,        0x0 */
            uint32_t VDMA_TYPE_CXF  : 1;  /* [    1],       None,        0x0 */
            uint32_t VDMA_IO_CXF    : 1;  /* [    2],       None,        0x0 */
            uint32_t reserved_3_7   : 5;  /* [ 7: 3],       rsvd,        0x0 */
            uint32_t VDMA_LEN_CXF   : 17; /* [24: 8],       None,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } VDMA_CXFPS1;

    /* 0x304 : None */
    union {
        struct
        {
            uint32_t VDMA_MADDR_CXF : 32; /* [31: 0],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } VDMA_CXFPS2;

    /* 0x308 : None */
    union {
        struct
        {
            uint32_t VDMA_START_F0  : 1;  /* [    0],       None,        0x0 */
            uint32_t VDMA_TYPE_F0   : 1;  /* [    1],       None,        0x0 */
            uint32_t VDMA_IO_F0     : 1;  /* [    2],       None,        0x0 */
            uint32_t reserved_3_7   : 5;  /* [ 7: 3],       rsvd,        0x0 */
            uint32_t VDMA_LEN_F0    : 17; /* [24: 8],       None,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } VDMA_F0PS1;

    /* 0x30C : VDMA_F0PS2 */
    union {
        struct
        {
            uint32_t VDMA_MADDR_F0 : 32; /* [31: 0],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } VDMA_F0PS2;

    /* 0x310 : VDMA_F1PS1 */
    union {
        struct
        {
            uint32_t VDMA_START_F1  : 1;  /* [    0],       None,        0x0 */
            uint32_t VDMA_TYPE_F1   : 1;  /* [    1],       None,        0x0 */
            uint32_t VDMA_IO_F1     : 1;  /* [    2],       None,        0x0 */
            uint32_t reserved_3_7   : 5;  /* [ 7: 3],       rsvd,        0x0 */
            uint32_t VDMA_LEN_F1    : 17; /* [24: 8],       None,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } VDMA_F1PS1;

    /* 0x314 : VDMA_F1PS2 */
    union {
        struct
        {
            uint32_t VDMA_MADDR_F1 : 32; /* [31: 0],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } VDMA_F1PS2;

    /* 0x318 : VDMA_F2PS1 */
    union {
        struct
        {
            uint32_t VDMA_START_F2  : 1;  /* [    0],       None,        0x0 */
            uint32_t VDMA_TYPE_F2   : 1;  /* [    1],       None,        0x0 */
            uint32_t VDMA_IO_F2     : 1;  /* [    2],       None,        0x0 */
            uint32_t reserved_3_7   : 5;  /* [ 7: 3],       rsvd,        0x0 */
            uint32_t VDMA_LEN_F2    : 17; /* [24: 8],       None,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } VDMA_F2PS1;

    /* 0x31C : VDMA_F2PS2 */
    union {
        struct
        {
            uint32_t VDMA_MADDR_F2 : 32; /* [31: 0],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } VDMA_F2PS2;

    /* 0x320 : VDMA_F3PS1 */
    union {
        struct
        {
            uint32_t VDMA_START_F3  : 1;  /* [    0],       None,        0x0 */
            uint32_t VDMA_TYPE_F3   : 1;  /* [    1],       None,        0x0 */
            uint32_t VDMA_IO_F3     : 1;  /* [    2],       None,        0x0 */
            uint32_t reserved_3_7   : 5;  /* [ 7: 3],       rsvd,        0x0 */
            uint32_t VDMA_LEN_F3    : 17; /* [24: 8],       None,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } VDMA_F3PS1;

    /* 0x324 : VDMA_F3PS2 */
    union {
        struct
        {
            uint32_t VDMA_MADDR_F3 : 32; /* [31: 0],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } VDMA_F3PS2;

    /* 0x328 : DEV_ISG3 */
    union {
        struct
        {
            uint32_t VDMA_CMPLT_CXF : 1; /* [    0],       None,        0x0 */
            uint32_t VDMA_CMPLT_F0  : 1; /* [    1],       None,        0x0 */
            uint32_t VDMA_CMPLT_F1  : 1; /* [    2],       None,        0x0 */
            uint32_t VDMA_CMPLT_F2  : 1; /* [    3],       None,        0x0 */
            uint32_t VDMA_CMPLT_F3  : 1; /* [    4],       None,        0x0 */
            uint32_t VDMA_CMPLT_F4  : 1; /* [    5],       None,        0x0 */
            uint32_t VDMA_CMPLT_F5  : 1; /* [    6],       None,        0x0 */
            uint32_t VDMA_CMPLT_F6  : 1; /* [    7],       None,        0x0 */
            uint32_t VDMA_CMPLT_F7  : 1; /* [    8],       None,        0x0 */
            uint32_t VDMA_CMPLT_F8  : 1; /* [    9],       None,        0x0 */
            uint32_t VDMA_CMPLT_F9  : 1; /* [   10],       None,        0x0 */
            uint32_t VDMA_CMPLT_F10 : 1; /* [   11],       None,        0x0 */
            uint32_t VDMA_CMPLT_F11 : 1; /* [   12],       None,        0x0 */
            uint32_t VDMA_CMPLT_F12 : 1; /* [   13],       None,        0x0 */
            uint32_t VDMA_CMPLT_F13 : 1; /* [   14],       None,        0x0 */
            uint32_t VDMA_CMPLT_F14 : 1; /* [   15],       None,        0x0 */
            uint32_t VDMA_ERROR_CXF : 1; /* [   16],       None,        0x0 */
            uint32_t VDMA_ERROR_F0  : 1; /* [   17],       None,        0x0 */
            uint32_t VDMA_ERROR_F1  : 1; /* [   18],       None,        0x0 */
            uint32_t VDMA_ERROR_F2  : 1; /* [   19],       None,        0x0 */
            uint32_t VDMA_ERROR_F3  : 1; /* [   20],       None,        0x0 */
            uint32_t VDMA_ERROR_F4  : 1; /* [   21],       None,        0x0 */
            uint32_t VDMA_ERROR_F5  : 1; /* [   22],       None,        0x0 */
            uint32_t VDMA_ERROR_F6  : 1; /* [   23],       None,        0x0 */
            uint32_t VDMA_ERROR_F7  : 1; /* [   24],       None,        0x0 */
            uint32_t VDMA_ERROR_F8  : 1; /* [   25],       None,        0x0 */
            uint32_t VDMA_ERROR_F9  : 1; /* [   26],       None,        0x0 */
            uint32_t VDMA_ERROR_F10 : 1; /* [   27],       None,        0x0 */
            uint32_t VDMA_ERROR_F11 : 1; /* [   28],       None,        0x0 */
            uint32_t VDMA_ERROR_F12 : 1; /* [   29],       None,        0x0 */
            uint32_t VDMA_ERROR_F13 : 1; /* [   30],       None,        0x0 */
            uint32_t VDMA_ERROR_F14 : 1; /* [   31],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_ISG3;

    /* 0x32C : DEV_MISG3 */
    union {
        struct
        {
            uint32_t MVDMA_CMPLT_CXF : 1; /* [    0],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F0  : 1; /* [    1],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F1  : 1; /* [    2],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F2  : 1; /* [    3],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F3  : 1; /* [    4],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F4  : 1; /* [    5],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F5  : 1; /* [    6],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F6  : 1; /* [    7],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F7  : 1; /* [    8],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F8  : 1; /* [    9],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F9  : 1; /* [   10],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F10 : 1; /* [   11],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F11 : 1; /* [   12],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F12 : 1; /* [   13],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F13 : 1; /* [   14],       None,        0x0 */
            uint32_t MVDMA_CMPLT_F14 : 1; /* [   15],       None,        0x0 */
            uint32_t MVDMA_ERROR_CXF : 1; /* [   16],       None,        0x0 */
            uint32_t MVDMA_ERROR_F0  : 1; /* [   17],       None,        0x0 */
            uint32_t MVDMA_ERROR_F1  : 1; /* [   18],       None,        0x0 */
            uint32_t MVDMA_ERROR_F2  : 1; /* [   19],       None,        0x0 */
            uint32_t MVDMA_ERROR_F3  : 1; /* [   20],       None,        0x0 */
            uint32_t MVDMA_ERROR_F4  : 1; /* [   21],       None,        0x0 */
            uint32_t MVDMA_ERROR_F5  : 1; /* [   22],       None,        0x0 */
            uint32_t MVDMA_ERROR_F6  : 1; /* [   23],       None,        0x0 */
            uint32_t MVDMA_ERROR_F7  : 1; /* [   24],       None,        0x0 */
            uint32_t MVDMA_ERROR_F8  : 1; /* [   25],       None,        0x0 */
            uint32_t MVDMA_ERROR_F9  : 1; /* [   26],       None,        0x0 */
            uint32_t MVDMA_ERROR_F10 : 1; /* [   27],       None,        0x0 */
            uint32_t MVDMA_ERROR_F11 : 1; /* [   28],       None,        0x0 */
            uint32_t MVDMA_ERROR_F12 : 1; /* [   29],       None,        0x0 */
            uint32_t MVDMA_ERROR_F13 : 1; /* [   30],       None,        0x0 */
            uint32_t MVDMA_ERROR_F14 : 1; /* [   31],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_MISG3;

    /* 0x330 : VDMA_CTRL */
    union {
        struct
        {
            uint32_t VDMA_EN       : 1;  /* [    0],       None,        0x0 */
            uint32_t reserved_1_31 : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } VDMA_CTRL;

    /* 0x334 : LPM_CAP */
    union {
        struct
        {
            uint32_t LPM_WAKEUP_EN : 1;  /* [    0],       None,        0x0 */
            uint32_t reserved_1_31 : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } LPM_CAP;

    /* 0x338 : DEV_ISG4 */
    union {
        struct
        {
            uint32_t L1_INT         : 1;  /* [    0],       None,        0x0 */
            uint32_t reserved_1_15  : 15; /* [15: 1],       rsvd,        0x0 */
            uint32_t VDMA_CMPLT_F15 : 1;  /* [   16],       None,        0x0 */
            uint32_t reserved_17_23 : 7;  /* [23:17],       rsvd,        0x0 */
            uint32_t VDMA_ERROR_F15 : 1;  /* [   24],       None,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_ISG4;

